{"Bank of America Travel Rewards + Preferred Rewards = Up to 2.775% everywhere card?": ["Click here for full rules!", "I have received my new card today and the numbers are on the back. Only my name is on the front", "I have a very old BofA card that earns world points. Is it worth PCing to travel rewards? Not sure if BofA allows PC.", "Anyone else read about this Voodoo? http://frequentmiler.boardingarea.co...-rewards-card/ I think them boys are smoking something funny.... or maybe not?!!?", "True    I call Bank Of America this is all true they are offering this new card .", "They are. You can't travel TR points to any of the cash rewards cards and I'm sure this card will be the same. You can transfer them to the AAA card, though, and get higher value redemptions on AAA club or mechanic vouchers...", "Has anyone tried to redeem points with Airline Gift cards?", "which account has higher interest rate if I do not trade?    To get preferred rewards status, one has to deposit quite some money into BoA or merrill edge. If I do not trade, which account has a higher interest rate that qualify for the preferred rewards?", "Both are crap. Just put money in Merrill edge and get some kind to money market fund in there which should pay competitive rates.", "I've read about the 3 month average requirement to earn the higher tiers for Preferred Rewards, but I was curious if anyone was granted a higher status immediately after reaching a balance threshold. I.E. I will be rolling over my 401k into Merrill Edge rollover IRA/Roth IRA, but I will obviously have to create the accounts prior to funding. If I had over $100K in rollovers within the first month of account opening, would that get me to Platinum Honors right away? Or, would I have to wait 3 months?", "Not sure what you mean by this, most people specifically use the ME account with a Taxable/Roth/tIRA to get the preferred rewards tier that enables you to get the goodies with BoA in addition to commission free ETF trades if that was your thing?  What is \"crap\" about that? Quote: It's a three month average, and they weight it on a particular day of the month.  So if that day is the first of the month, and you have $300k in your Edge account on the first of the month, then the following 1st of the month you would have a 3 month average of $100k and be able to enroll in preferred rewards I believe.", "Makes sense, thanks for the input!", "As  @FrequentFlyer9000 mentioned, you can buy money market/ETFs, or CDs If you have at least 100k in cash in ME, you can also put it in Preferred Deposit. 1.3% right now, but no need to worry about short vs long term capital gains compared to buying etf plus fdic insured (and not possible for capital to fluctuate like etfs) (Need 100k to open preferred deposit but can dip below. Says need to call for every transaction which settles the same day, think I saw somewhere u can do online but not sure", "16", "20", "21", "22", "23", "24", "25"], "Barclays AAdvantage Aviator BUSINESS card - 75K for $1,000 spend in 90 days.": ["Click here for full rules!", "It doesn't hurt to call, but like mentioned above, wait for the letter and then call, i have applied for a Bus. Card with Barclays with a real business, went pending, they called me 12 days later, couldn't answer, called back in couple of hours, (i guess since they didn't talk to me they denied my app), i talked to a CSR, asked questions about my business and then asked me why i have 10 new accounts in the last 12 months, i explained that since i have an excellent credit score banks love to invite me to apply with some perks and i said \"yes\", but this card is for my business.(all true), she reversed it and got approved", "22", "26", "27", "28", "29", "30", "31", "Click here for full rules!", "Did Barclay do another hard inquiry when you called in to followup on your fax / application status?", "Just applied and Barclays is requesting documents \u0096 License, SSN card, bill with current address, etc. for ID verification. Business and personal info submitted in application was all legit. (1) Is it worth submitting ID documents or is the approval rate for those not auto-approved so low that submitting them is not worthwhile? (2) What are the chances Barclays does a second hard inquiry either after ID document submission or during the (probably necessary) phone call follow-up?", "Try 866-205-5973.", "Its been 10 days since application and the \"Check business card application status\" page still says \"We're in the process of reviewing the information\". Should I wait for a document request or a decline before trying the 866-710-2688 or 866-205-5973 numbers or pro-actively call? Thoughts?", "Only those who abused the card mailers were impacted correct right? Not those who have applied for multiple cards?", "False. AA is locking anyone that they deem has earned too many bonuses in the last few years. There are people locked currently who have never used a mailer.", "Forgot to set up auto pay and paid my balance one day late... will this show up on my personal credit report? I know the biz card tradeline itself doesn't show but not sure about derog marks.", "No.  That may the majority of the people affected, but that doesn't explain all of the people affected. People who applied for maybe 2, at least definitely 3, of the exact same card within 2 or 3 years are impacted, probably because Citi (mistakenly) thinks that they must have abused mailers to do this, but a few people were sent mailers addressed directly to them multiple times due to Citi's oversight, and in the strictest terms those were not \"mailer abuse\" (they did involve changing the name of the person on the mailer when applying, they did not involve opening up new AA accounts at all). And so if AA can misunderstand the various ways that some people can be able to apply for multiples of the same Citi card without \"mailer abuse\" (and do rash things like terminate people's accounts based on that misunderstanding), I fear that they could misunderstand how someone could get multiples of the same Barclay card in 2 or 3 years if that were possible through some other \"loophole\". So I think all AA same-card churning faster than the official rules allow should be put on hold until we understand much more about this shutdown wave.  So far AA hasn't explained anything about it, we just have random datapoints (all too many of which are hidden in a private Reddit forum).   Biggie Fries likes this.", "Just checked and havent seen even the first pull yet", "In general a late payment of 30+ days only shows up on your credit report, 1-29 days late should not", "Applied earlier this month with a legit business. I have a 770+ fico and I'm at 4/24. Checked my status today and my application was denied: \"Currently we are unable to offer you a credit card issued by Barclays Bank Delaware. Details on why we could not make you a credit offer will be mailed to you.\" They never requested any additional documentation from me. Is this a denial for this specific card or all Barclays cards? I don't have any other Barclays cards at the moment. Is it worth for me to call recon?", "It's worth it for you to wait for the letter and see what is says.  It's hard to offer any advice, not knowing yet why you were denied.", "It is stunning true how it is harder to get business credit cards with a real business. A coworker of P2 is starting her own practice, a real b&amp;m business, and had a hell of a time getting the documents right. She eventually had to hire a consultant to help her get 4 business credit cards with a total $50K credit limits. And hear this, the consultant was going charge her $5k (10%). I was floored. I could have helped without charging her a penny, except a few referrals.  What’s worse, she never even knew about the SUBs. And now it’s too late for her to get them.", "What are subs?", "Sign up bonus", "21", "25", "26", "27", "28", "29", "30", "32", "Click here for full rules!", "how to extend the expiration of the AA miles?    dont know when i can afford vacation so whats an inexpensive easy way to extend the AA miles expire date?", "earn miles via their shopping portal.  https://earnmoremiles.aa.com/BonusOffers/RetailDining", "If you live in an area with enough participating restaurants, join AAdvantage Dining, and then use it at least once a year (but if you find enough restaurants nearby that you like, you can earn more if you dine 11+ times a year). Most such dines post within less than a week. And you can earn 1000 miles for spending $25 as a signup offer: https://www.aadvantagedining.com/", "I got the Barclays AA Biz card with 65k +10k signup offer back in december. I finished all my spend ($1100 or so not including the annual fee, and also employee card spend of $2) by 1/03, and my statement closed on 1/06. On 1/06, on my AA account, I got 10k miles for \"AA Biz anniversary\" which I assume to be from the 10k signup for employee spend. However I did not get any of the 65k signup bonus. I checked past threads and people got the signup bonus as soon as the statement closed. Does anyone have data points that suggest I would get the miles after the next statement? For extra info, on my blarclay aviator account screen, I see that I got 11000 or so miles coming in, 10k is due to the employee card, the 1000 or so is from the normal spend. But no sign of the 65k", "You won't get the signup bonus until the statement comes out showing your payment of the annual fee.  If you just paid it for the the 1/6 statement, then the 2/6 statement will show the credit for the fee payment and that is what triggers the bonus (besides the spend that you already did.)", "folks what is the best strategy to apply for this card and the personal aviator card thanks", "Churning Aviator Bz Card    I and my wife successfully applied for the Aviator Bussiness Card in November 2019. The AF and miles were posted in Dec. Since I only need to keep one card, if my wife closes her card, how long she has to wait before she can reapply?", "Applied on 9 Jan following the others suggestion of Sole proprietor Business name my name 0 income 0 yrs in business, etc.  Got the \"application under review\" reply.  7 days later a letter requesting SS# proof, Drivers License, and Utility bill.  I faxed the info requested.  Called in 2 days later and was approved.  The followup call may have helped to connect the fax sent to my application. I do not apply for cards very often, have excellent credit.  Looking forward to the $3k EQD on AA.", "Was the utility bill you provided for a business or just your personal residence utility bill? Regards", "Folks - what's the best strategy to get this business card and the personal card? Should I apply 3 months apart? Any other considerations? Thanks", "Just a copy of the residence utility bill first page. Seemed like they just wanted to verify that i am who I say I am (to avoid identity theft).  The other impression I got from reading this forum is that they push back on people applying for credit frequently.  Whether the business has longevity or significant income seems less important.", "You might want to hope that it's not too soon. AA is now locking down (in some cases shutting down) accounts for people who \"churned AA cards too much\". That may be just Citi cards right now, but who knows if they'll look beyond Citi (to Barclay also) in the future. AA accounts restricted  (Nov/Dec 2019) No one knew half a year ago that \"fast churning\" of AA credit cards could be so dangerous.", "Thanks! Regards", "Get the first card and wait and it depends on your credit history wait for awhile may be 6 months and then apply, i don't believe there is a concrete strategy.", "this reconsideration line isn't working for me - 866-710-2688 Any other numbers i should try? Thanks", "20", "24", "25", "26", "27", "28", "29", "31", "32", "Click here for full rules!", "it'll pull your credit but most business cards don't count to the 5/24 rule.", "As this is more of a credit card question vs. an AA question, we will move this over to the more relevant forum for further discussion.  Thanks. /JY1024, AAdvantage forum moderator", "Moving to the relevant credit card forum, as Barclay rules come into play here and not necessarily AA/AAdvantage. /JY1024, AAdvantage forum moderator", "Wells it\u0092s in there now lol", "But, Chase will not \"see\" this hard pull.", "Chase's 5/24 has nothing to do with pulls. Chase determines your N/24 status by looking at the credit card accounts on your credit report (both the open and closed cards) and counting how many of those credit card accounts show an \"opened on\" date in the past 24 months. Since Barclay business card accounts don't appear on your EQ/EX/TU credit report, they are invisible to Chase's N/24 counting process, even if Chase can see the pulls. Quote: But because of what I just explained, it doesn't matter, Chase won't count it, because that's not what Chase counts.   beltway likes this.", "I'll answer to \"SaS\"; \"Spammer\", not so much. I agree with your added note, but flagging your post and making that comment to the moderators.would be the best way to get it sorted.", "SaS -- lol --- Sorry about that!  I didn't catch the full implication of your name.   Good point!  No Spammers!    I did send a note to the moderator but must've of screwed something up because it didn't go through, so I added the note.   I'm not too worried about it -- just mainly added the note because I didn't want anyone to think I'd been trying to do something \"scammy\".   :-)    It was kind of weird the question was moved.", "Just to follow up:  I cancelled my Aviator Business Card a couple of months ago only after missing my payment for the annual fee, and the (badly printed, like a xerox of a xerox) letter I got from Barclay said that I still owed the fee and penalty!    I was not relishing arguing with them about this, esp as I couldn't do so online since I no longer had an account. However they sent me a monthly statement (?!) last week noting that the fees had been credited back, so nothing owing. That's better.  Though I suspect I'm going to continue to get statements for a while.", "Just applied for this card as a sole proprietor, $0 income, and 0 years in business. I was instantly approved!", "Data point: sole proprietor, ~$35k annual income, 5 years in \"business,\" and was instantly approved for $14k credit line. First Barclays card of any kind, ever.", "I just found out my Barclays Biz AA account’s online access has been “restricted”.  Is that something that just happens for no reason?   No unusual activity.  No MS.  100% organic spend.  Minimal spend just met.  Paid in full.  And I have never churned any Barclays or AA cards.  In fact this would be my very first ever Barclays or AA sub.", "What  does it say on the site? do you get a restricted page when you try to login? Did you call Barclays? Let us know the outcome please and thank you", "Not sure if I am allowed to upload a picture but when I log in I see a light blue box saying your online access is restricted and please call.  I can see my last statement and payment and miles.  The box is a picture not text so not easy to copy and paste.   Bonus miles already posted to AA and AA account looks perfectly fine though I didn\u0092t test beyond calling the 1 800 number to check if I got transferred to a live agent. I wasn\u0092t. In fact it was darn near impossible to try to get a hold of a human.  I will probably call Barclays tomorrow.  Curious to why.  Will report back.", "I went to check if mine said something, and while it didn't, it asked for 2 security questions answers, as if it had forgotten my browser. And the other day the personal Barclays website asked me for 2-factor authentication for the first time, and started throwing me to another browser window to log in. But today the personal website did not ask me for 2-factor authentication, even though it still threw me to another browser window to log in. So it could be just normal Barclay random security stuff having nothing to do with what the card earns.   Dream of Flying likes this.", "19", "23", "24", "25", "26", "27", "28", "30", "31", "32"], "Apple and Goldman Sachs to partner on new credit card": ["Click here for full rules!", "Thanks for the DP.  As I did not realize that joint cards had largely gone by the wayside.  Interesting.  I wonder why the shift.", "Aren't you able to use household income and not individual income? My mom is a homemaker and was denied a BOA credit card because the application wasn't clear if household income was permitted (she's used that in the past and never been declined) and she ended up not putting in any income. After calling and explaining, they approved her based on joint income.", "The Credit Card Act of 2009 \"permits issuers to consider income and assets to which such consumers have a reasonable expectation of access.\u0094 So if the credit card application doesn\u0092t explicitly ask for individual income and you are at least 21 years old, the gray zone would in all likelihood work in your favor.", "It seems at least one of the major bill pay vendors added GS for Apple Card payments. It is showing up at banks that use that service and is a paper check it seems. Account number is optional. What typically happens is if the daily volume gets high enough, it will convince the payee to accept ACH or wire payments making the payment electronic, but not always. Because the cleared check is visible, you should be able to see where the bill pay service actually sent the payment.", "Just got a push notification from Apple.  6% cash back on Apple purchases!", "Sweet!  That iphone 11 pro is looking more and more doable...", "In some other places, people have said it looks electronic, but I'm prompted for an account number and zip code\u0085has anyone actually given this a try and what information have you used?", "You can get all the info that's usually on the card from within the app.  Strangely enough ITUNES doesn't \"accept\" Apple Pay so I had to enter my Apple card as if it were a M/C", "Sorry, I was talking about pushing an ACH payment from a checking account to the Apple Card. Initially, it hasn't been supported, but some people have been seeing it as an option when they go to add a new bill pay recipient on their various banks' web sites. In most cases, if it's a known recipient, you'd just plug in an account number, but some places ask for either a phone number or zip code of the receiving institution. Some seem to ask these data points to also differentiate between consumer credit cards, business credit cards, loans, etc. as the destination. I typically use this method for my other cards because it keeps me from having to put account and routing numbers in on each card's web site. Officially, the only way to pay the Apple Card is either pulling an ACH payment from your checking account or using money on Apple Cash. This would be nice because ACH push tends to be a bit quicker than ACH pull in my experience. By the way, for iTunes, it seems that the mechanism isn't there on the web or in the desktop client, but you can set the default billing source by going to Settings &gt; Your Name &gt; Payments &amp; Shipping and then adding a payment method.  \"Found in Wallet\" lets you pick any Apple Pay card and even reorder them based on priority.  It feels kludgy compared to the normal Apple Pay interfaces, but it appears to stick across the account.", "I've spent less than $200 total (obviously no MS) and got a restricted account. They couldn't clear it up over iMessage or on the phone, so I filed a CFPB (wrote a very friendly inquiry)...   cuthroat likes this.", "Thank you for that heads-up, sdix!  I was ready to buy an 11Pro and had looked in vain for Black Friday and Cyber Monday deals.  Apple's 6% back, and a better trade-in on my old iPhone SE than Verizon offers ($45 vs $18) makes quite a difference.   The phone is very nice, too!   msp3 likes this.", "Is it Check free pay? I just noticed in Walmart bill pay...", "It's been appearing in many bill pay services, and asks for the account number and biller zip code for me, but I'm not sure what to use there.  Officially it's not supported, but someone posted on reddit that it worked (didn't state which zip code, used account number for \"online\" payments).", "I\u0092ve been trying to pay it no ZIP required but it keeps on erroring out \u0093Oops! We\u0092re having temporary systems issues. Please try back soon.\u0094", "10", "14", "15", "16", "17", "18", "19"], "Poor experience with Am Ex Concierge": ["Click here for full rules!", "I vaguely remembered that as well, so I did a search a couple of months ago. The available information I could find included Glassdoor listings where former employees seemed to indicate Circles still handles Amex. Who knows if that is really true or not. However, what is definitely the case is Circles moved to Canada which presumably means most of the staff are not the same people who used to service Amex in the past. I also read numerous reports of questionable management practices at the company, which might be why service quality is so uneven these days. However, like I said, I've still had some great experiences with them, so whatever is going on at whatever company handles the Platinum Concierge, it's not all bad. Sometimes you win, sometimes you lose. But also, even the best concierges can't make miracles happen. They're not going to magically be able to get reservations at a restaurant where no reservations exist. However they CAN sometimes come through when you wouldn't be able to on your own.", "30", "34", "35", "36", "37", "38", "39", "Click here for full rules!", "I never really understood what a concierge of a $500/yr credit card could do that I couldn\u0092t do myself, other than maybe sit on hold.  It isn\u0092t like they are going to get me backstage passes to shows, last minute reservations at popular restaurants, etc; they don\u0092t have special hookups, they are simply doing the manual labor for you.   notquiteaff and Gasolin like this.", "If you did not purchase the tickets through the concierge this is just a way to get you off the phone. Work your way up the Telecharge chain until you find someone who will listen -and- who has the personal authority to do what you want, but be specific about the resolution that you will accept, bearing in mind that they may simply offer a refund.", "You could file an ADA complaint, and let Telecharge know that you have. That would get their attention pretty fast. https://www.ada.gov/filing_complaint.htm gooselee and IndyHoosier like this.", "I think ADA even gives the public the legal standing to sue, which would be a stiffer slap than a complaint. Good luck.   This whole story is one reason I really am reluctant to spend up for live events far in advance.", "Assuming this is in the US, the venue should be required to provide reasonable accommodation for people with disabilities. Push this route directly with them. If you do find better seats for a reasonable (to you) price, you could inquire whether the venue change and higher prices somehow enable you to use the Event Protection coverage (or whatever it's called) that comes with Amex Platinum. That's more designed to cover if the event is just cancelled altogether, but it doesn't cost anything to read the T&amp;Cs just to check. And in all cases, I agree with the sentiments above that the Amex Concierge is mostly worthless for stuff like this. Good luck getting it resolved, and hope you enjoy the show!", "Thank you for all the advice.  I wanted to follow up to say that you all encouraged me to push a little more when phoning AmEx, and I was finally able to talk with a supervisor who was able to help. (I had asked for a supervisor previously but I guess I really never got one!)  She was able to get to the right person at Telecharge and they were able to move us into seats that were in the same row as initially bought!  So, in this case, AmEx did come through but I had to find the right person, which wasn't easy. I appreciate all of the suggestions for any future issues of this type!   Cardboard55, miles4CDG and IndyHoosier like this.", "Today the Concierge got me a reservation at Pujol in Mexico City for later this week. Opentable was showing the next available seating was in March for both the taco bar and tasting menu. Amex came back with options for both menus on both days I asked them to check. Total time spent was about 7 mins on the phone.   miles4CDG likes this.", "I just recently saw that you can chat with the Amex Concierge on the app, so last week i tried it out.  They were able to get me a reservation to a restaurant that was full for my birthday with only 24 hours notice.  Best part was that I didn't have to call anyone. Just did it all through the app. Now that this is available I will use it more frequently.  I really didn't like the idea of having to call, go through the phone tree, etc. just to make a reservation.   lax01 and NeTWorKz like this.", "I have had success emailing them as well.  I have them set up as a contact and just tell Siri to send them an email with my request.", "Where in the app is this concierge chat option? I can't find it on the iPhone version of the app.", "Murphy's law strikes again....  I messaged them yesterday to try and get reservations and two different restaurants.  Both times they came back with the same exact openings that I could have booked on Open Table.    Not to bash the Early Bird folks, but dining at 5pm isn't for me.  lol", "Top right corner of the screen.", "Concierge got a table for two on valentine's day at Manhatta at 7:30 PM. Unfortunately had to cancel, but that's a tough reservation.", "Like I was saying above, the Platinum Concierge isn't the Centurion Concierge. Basically you're getting luck of the draw with Circles, which is an outsourced company in Canada. If you expect to RELY on them to do anything important you're likely to be frustrated, it seems to me, based on all the reports we've seen on them. But it is definitely NOT the case that when they do come through it's just what you could have done on your own. I've used them multiple times to get recommendations for restaurants, restaurant reservations, and tickets when there was no availability online. We had an amazing vacation in Spain largely due to two great restaurant recommendations they gave us, which fit our specific request very well. These were definitely above and beyond the things we could have found online easily .. really special places both times. Compared with the Visa Infinite concierge (Sapphire Reserve) it was night and day --- the CSR concierge recommendations were really terrible haha. But I certainly wouldn't give them any task that I felt had to happen right, at a certain time, etc. That's just setting yourself up for disappointment. I like to think of them more like a surprise grab bag where you don't know what you're going to get and half the time it might be a lump of coal but the other half it's something pretty cool and hard to obtain any other way.", "No doubt American Express outsources the concierge function, but I had the impression that Circles had lost the contract some years ago. Is there any recent evidence that Circles is the current service provider? Not important, just curious.", "29", "33", "34", "35", "36", "37", "38", "40", "Click here for full rules!", "Thats nice. Which top 50 did they get for you? Did those have open reservations on their own sites at the same time? Or was Amex able to get them when you werent?", "Quote: I'd be interested in this also. I'm 0 for 3 on them being able to get a Top 50 restaurant reservation. I only call when I can't get reservations on the restaurant's own website. The concierges seem very professional and knowledgeable on the phone, but it doesn't seem like they have a lot of influence in this particular area. Then they usually come back a few days later with a bunch of recommendations and offering to make reservations for other restaurants that I can easily book myself.", "I looked online and called around but couldn't find the 1 metre Rilakkuma plushy (https://shop.san-x.co.jp/product/detail/RLK4989) in Hong Kong. I asked for help from Amex concierge but they couldn't find it. Amex concierge asked where I was staying (Mandarin Oriental) and proceeded to pass the request off to my hotel concierge, who also couldn't find it. I ended up finding it myself in a small shop - oddly enough, not too far from the hotel. I checked that it was tagged by San-X and appeared genuine, as knockoffs are a known problem... I was a bit disappointed in the concierge, since I thought they were renowned for being able to handle requests like these.", "Do you happen to recall where they managed to get reservations for?  Amex recently bought Pocket Concierge a japanese restaurant booking service, so I would assume thats helped. Currently have enquires in with the hotel concierge, but wondering if its worth chasing amex also.", "In the past week they were able to get me dinner reservations at Epicure in Paris (only 2 weeks in advance!) and Atelier Crenn (next month) that were both unavailable online or by calling. These are both three michelin star restaurants. Safe to say I'm very impressed with the concierge service.", "A tale of two concierge services: Chase Sapphire Reserve concierge, aka \"Visa Infinite\" concierge -- asked for recommendations for restaurants in this beach resort in Spain we were going to visit for my friend's wedding. They came back with two utterly bizarre recommendations for breakfast -- \"Tea for Two\", a British high tea spot, and \"Cafe Flandes\" which is supposedly a Dutch-style coffee shop. \"Tea for Two\" wasn't even open on the days we were there, due to vacation schedules. We decided to try \"Cafe Flandes\" to see what it was about -- which wasn't much. It was literally diner food, not horrible but nothing other than completely mediocre. Also: how odd is it to recommend a British place and what amounts to basically just some random diner when we are traveling in Spain? Were they terrified of recommending anything local or authentic or even basically high quality? Asked Amex Platinum Concierge to give us recommendations for moderately priced restaurants in Valencia and Barcelona, our next two destinations. In Valencia they recommended a couple spots near the train station we were going to use. The first was Sagardi Valencia Centro, a perfect spot a short walk from the train, which they described as \"for years the great reference of Basque cuisine in Valencia\". It was simultaneously quite affordable and superb -- everything from the ambience to the service to the food itself -- stupendous, and something we wouldn't have easily found by Yelp searches. It was also across from some amazing medieval architecture which we also loved looking at as we dined. Barcelona was a bit more of a mixed success. Their primary restaurant recommendation was awesome -- Cera 23. There were some issues though -- the whole thing is happening during the holidays and when I tried to make reservations after receiving their recommendations, nothing was available until very late in the evening (10:30pm). I asked them to try to reschedule and/or get a reservation at another restaurant but they didn't even look at my email for over a day. By then there were no options left. It appears that email responses and emailed requests get low priority, even when responding to an email they sent. In future whenever I need to do anything with the concierge, I will call, not email, if I can. The other thing is Cera 23 is in a rough neighborhood of Barcelona. It was fine for us -- we like to go to places more on the \"edgy\" side and this place perfectly fit our preferences. I wonder if this is something they somehow figured out from my profile or if they knew it. I didn't mention anything like that when I contacted them, On the other hand, if they give this recommendation to a lot of people I imagine some might find the place a little intimidating. We had a fabulous time, however, at Cera 23 and were suitably impressed with both the quality of their recommendations and how well they happened to suit our mood and taste, based on very little hinting from me. The contrast, however, with the awful Visa Infinite concierge was immense. It may be that Amex isn't always able to pull off restaurant reservation miracles --- but even just putting together a cool itinerary was itself pretty amazing. I will definitely consider using them again when I visit an unknown city especially abroad.   Statman, lax01 and happychic like this.", "Called 6 months in advance for restaurant reservation in BCN.  Concierge understood that restaurant needed to be booked a midnight Spain time on a specific day.  Got an email three days after the required booking day saying they were unable to book.  Funny thing is, I anticipated their failure and got online at about 1 AM Spain time and booked a backup reservation at the same restaurant.  That tells me that 1) Amex missed the midnight deadline and 2) they missed it by a pretty wide margin. I think I'm going to cancel my Biz Plat card at this point.  It's been a good run, but they're not saving me any time anymore and the annual fee has become exorbitant at $595.", "From this and other reports I don\u0092t think you can really use the Platinum concierge for anything you actually need reliably to happen at this point. It\u0092s more of a value add service where anything you ask them to do has to be something that would be a value add if it happens but OK if it doesn\u0092t work. On the same Spain trip I had a good experience with above, they also forgot to respond to an emailed request in a timely manner and only \u0093noticed\u0094 it when I sent another request to remind them. Etc. So they\u0092re really not a reliable \u0093personal assistant\u0094; maybe they used to be in the past but certainly not these days. It seems like Centurion is really what you have to have to get truly reliable personal assistant level service rom the concierge.", "Years ago, it used to be a real value-add for tricky reservations like that.  Particularly ones with  complicated timings or language barriers.   Now, unreliability seems to be the trend.  They botched a trip to Mexico City two years ago for us, too, missing the booking window for Pujol by not minutes or hours, but days.  Oh, well.  As with all good things, devaluation as inertia is always a at work.", "Yeah I\u0092ve been reading management at Circles has declined in quality since they moved their offices to Canada. There\u0092s too much attrition and a focus on customer surveys; they fire employees for bad survey results without checking to see why they got the reviews: but if an agent fails to get a request done it may have nothing to do with the agent, it may have been systems or processes beyond their control - this is a lesson anyone in quality control needs to learn - you need to investigate why a failure occurred not simply that it occurred, and firing the employee may do zero to improve quality when the problem is elsewhere in your system. However since I don\u0092t rely on them for anything critical I\u0092m still getting value out of it. It\u0092s easier to maximize the credits on the personal card anyway so for $50/year why not? I also have a business card but it\u0092s paid for by my company so I might as well keep that one.", "Poor experience with Am Ex Concierge    I'm not quite sure where to ask about this so thought I'd start here. A few months ago I bought tickets to a show through Telecharge using my AmEx platinum card. Because of a disability, I need an aisle seat, so that is what I bought. I bought the tickets a year in advance as the show is likely to be very popular (it won't start until next fall.) Three months after I bought the tickets, I was browsing the Telecharge site and noticed that my tickets weren't on the aisle. The seating chart had been inexplicably changed. I called Telecharge and they were able to move me over two seats to the aisle, but I had to also choose a different day, which was fine. I also ended up having to pay more because the pricing had gone up - which didn't seem right but whatever. Then about two weeks after that, an announcement was issued that that the venue had been changed and now my *second* sets of seat were no longer on the aisle. It was impossible to get through to Telecharge this time, so since I had bought these with AmEx Platinum, I decided to call the concierge line to see if they could help this time. They said that they would reach out to Telecharge for me as they have an internal group that deals with them. The result was that they got me back on the aisle, but in the back of the section *and* I had to again pay more since the price of the seats had gone up again. They told me that I was best off securing these seats so I had *something* on the aisle but that they would try to get me closer to where I was going to sit initially. It has now been six weeks since that first call. I keep getting emails from AmEx (from different people - there was one person working on it for about three weeks and she seems to have disappeared, so now it's different people each time) that they are \"working on it\" and meanwhile, I'm sure all those new aisle seats that popped up when the venue changed are being sold if not sold already. I did try to call Telecharge again myself, but they told me that since AmEx had contacted them, they were working directly with AmEx and that there was nothing they could do for me - that I should continue to work through AmEx. These two tickets were close to $500 once I paid twice more each time my seats were changed. Going in and buying a whole new set isn't really an option - and I think they have also hiked up the price significantly since I initially bought (which is probably why they don't want to give me seats like I initially had). I know I will see the show and I do have an aisle seat in the back, but it doesn't seem right or fair. I know the theatre change is not AmEx's fault but I am so disappointed that, using their concierge service, I was asked to pay more money for worse seats and that they have not been able to help me with something that doesn't seem like a crazy request - but I'm happy to hear opinions/suggestions about this. (I don't have a Twitter so I won't be Tweeting anyone to complain - in fact, I'm not great at the public complaining thing in general...) Thank you for any thoughts. P.S.  I think this probably belongs in the AmEx forum but I don't know how to move and don't want to repeat post.  Hopefully a moderator can move it.  Thanks in advance.", "I'm sorry to hear about your experience, but I doubt there is much that Amex can or will do.  This is very much down to the organiser/promoter, and how they deal with guests with disabilities.  Amex Concierge talks a good deal, but in my Platinum Card days they were never really able to deliver anything that I couldn't sort out better myself.   onetess and Often1 like this.", "Telecharge provides specific instructions for people who require accessible seating.  Search \"disability\" on its website and you are taken to this language (as you will be for the website of pretty much any venue, seller or reseller).  It's really important to make certain that when your needs relate to a disability that you make that known.  Otherwise you are simply lumped in with everybody else who is subject tot he standard \"seats are not guaranteed: language, How do I find out about accessibility for audience members with disabilities? On our website, we include accessibility information for every theatre. Please click on the title of any show you are interested in and click on the Access Information tab. This area will also provide you with specific phone numbers to call for each show if you have special seating requests. You can also order special seating for patrons in wheelchairs and patrons who need to transfer from a wheelchair to a seat.", "Thanks - I actually did that during the first change so they should have been aware.  But - my request somehow didn't get \"saved\" when they changed the theatre.", "More generally, I have given up using the Amex Plat concierge because the few times I did try to use them, they failed every time. In one case, after failing to get what I asked for, they even tried to charge me a fee for their time! I believe this is still an outsourced function and I have no intention of ever using them again, except possibly for restaurant reservations at a US restaurant where Amex has an arrangement. For anything else, they do not add value.   IndyHoosier likes this.", "28", "32", "33", "34", "35", "36", "37", "39", "40"], "Credit card annual fees waived for military": ["Click here for full rules!", "I'm new to all this too, but I should add that it was specifically for the CSR and not the Ritz card. I assume that Chase honors AF-waivers on all their cards regardless of quantity or type.", "Thank you for the clarification.  Big difference between the CSR and the Ritz is that the CSR is subject to 5/24 and the Ritz is not.  Pretty sure Chase would just laugh at me if I applied for the CSR.", "Well, I jumped the gun on this one.  I received a letter today stating that Capital One was waiving the membership fee (two days after I canceled the account).", "I was recently approved for a Flexperks card and was pleasantly surprised to also receive a MLA letter from US Bank.  It states that \"We will also eliminate all fees while you are subject to the terms under the MLA.\"  It sounds like that includes annual fees.  I'll update this next year when the fee posts.", "Any data points on how Bank of America treats annual fees for cards approved post MLA (9/17)?", "Still looking for any data points for Bank of America or Barclaycard annual fee waivers for post MLA credit card approvals. Thank you!", "1"], "Heads up: Apple Music doesn't trigger 5x points on Chase Freedom (and it should)": ["Click here for full rules!", "My internet and wireless phone bills were on autopay with a different card.  So for the next 3 months, I just have to manually pay the bills with Freedom before autopay took place at the end of the month.  It's about $300 x 3 months = $900.   But I only get 900 x 2 = 1800 UR points extra because my autopay card is Chase Ink Preferred which gave 3x points on internet and phone.   I guess 1800 points is better than nothing.  I won't be getting gas as I only have EV cars.    I used to get Amazon gift cards from 7/11 gas station, but now I have Amazon 5% card on the account, it doesn't really make sense to buy 5 UR points gift card in place of 5% cash.", "I don't SPECTRUM existed 10 years ago under that name, did it?", "Does anybody know which gas stations in Tennessee sell VGC with CC? There is no 7-11 here. I saw $500 VGCs at Pilot gas station, and they allowed me to buy it with CC, but it didn't pass through, I guess it's hardcoded. Need to utilize my 6 Freedom cards this quarter. It was a blast to buy VGCs at 7-11 in CA, but I moved.", "In that case, you may want to update your FT Profile. It still says SJC/SFO, which made me wonder why you were asking about Tennessee until I finished reading your post.", "Why yes; they've used the name since the 80s. You might be thinking of somebody else.  Spectrum Entertainment Carnival", "Of course I'm thinking of somebody else: The company actually called Spectrum (no other words in the name): https://www.spectrum.net/ That company called exactly Spectrum is a merger of Charter Cable and Time Warner Cable, and so that's why I said I doubt it existed 10 years ago as exactly Spectrum. Besides, while the website URL you gave just calls the company you're talking about \"Spectrum Entertianment\", the actual web page that pulls up just uses the name \"Spectrum Carnival\", with no mention of \"Entertainment\" being part of the name. So they can't even seem to make up their minds as to what their own name is!", "1", "2", "Click here for full rules!", "Does using Chase pay at gas station qualify for gas station category? I would assume it would count since it's like using Apple pay at a merchant.", "Don't see why it shouldn't. Chase Pay is just a way to use your Chase card and doesn't impact what a merchant codes as.", "Well buying GC's at gas stations continue to be problem for the Q1 2020 category. In Q3 last year I was able to go to a local 7 Eleven and got the guy to let me buy an Amazon GC with my CF, no problem. The other night I went to the same 7 Eleven and a different guy was working and said he couldnt do it unless it was cash or debit. I asked why and that I had bought a GC there before, he just said that was what he was told. By who and when? No Answer.  I just dont understand this weird rule with Gas stations?! When home improvement is the category I can walk into any Lowes or Home Depot, go straight to the GC section, pick one up and go straight to the register and pay with my CF card and they dont even bat an eyelid. Zero problem! What sort of fraud are they worried about, my name is on the credit card and I can show my I.D. - What is the problem??? Are they operating under some urban myth of a scam that just isn't true?", "Yes, they are operating under an urban myth.  It is called “profit.”", "Profit for who? Gas station or credit card company?", "It doesn\u0092t really matter which one, or both.  Neither wants a sale with no profit.", "Well in the case of the gas station it could be that they dont want to pay the credit card transaction fee on a non-profit sale, but if so, why dont they just say that? They're usually franchises owned by a small business person so I get that. However, none of the workers or managers there can seem to give a reason other than its some vague rule that they were told by someone. Even with cash purchase of GC's are they making a profit? Why do gas stations carry GC's at all then? Do they in fact get a piece of a GC sale? I dont know but it would be interesting to find out. In the case of the credit card company part of the reason I have one of their premium credit cards is for the points transfer perks. It their cost of doing business and competing with other credit card issuers. I didnt create the game I just play it. If its their rule well then I guess some people are getting around it by searching for a gas station that doesnt care about either scenario. The urban myth part of my comment above was that it seems that there is some feeling of it being a scam to buy GC's with a credit card which is false. I suppose someone could steal a credit card and then immediately go make a big GC purchase but just a minimal amount of verification of identity would solve that concern.", "Why would you expect a clerk in a gas station to understand (and be able or willing to explain to you) the owner\u0092s business model? The gas station owner has no reason to modify his/her business practices to facilitate your credit card spending goals. As to your second point, it is extremely unlikely that your credit card issuer is the same company that is selling the gift cards  (and setting the rules) in the 7-11 store that you wandered into.  They are different companies, with different motivations and different rules.  The company selling the gift cards did not, in fact, issue you \u0093one of their premium credit cards\u0094 \u0097\u0097- even if they both say \u0093Visa\u0094 on the front.", "To be fair, buying gift cards is a well known way of cashing out cloned credit cards. Combine that with gas stations being one of the merchant categories with higher fraud rates (especially since most pumps are swipe only, not to mention that many didn't even get chip inside until recently), I'm not surprised a lot of gas stations don't approve.", "Fair enough.", "Heads up: Apple Music doesn't trigger 5x points on Chase Freedom (and it should)    I just activated a Chase Freedom, and was expecting my monthly Apple Music charge to trigger the 5x point reward as Apple Music is listed under the \"select streaming service\" reward category for this quarter. It only triggered the regular 1x point. I'm assuming that's because the charge appears as \"Apple.com/bill\" on the statement, which doesn't suggest anything about Apple Music. I called Chase to alert them -- this effectively removes Apple Music from the 5x reward category for all customers -- and the representative said they'll escalate the issue. No clue how they'll fix this -- all recurring Apple charges appear under \"Apple.com/bill,\" blind to the service provided -- but anyway, figured I'd give folks a heads up if you want your Apple Music bill to be rewarded accordingly this quarter.", "They didn't at least fix yours?   I contacted Chase one time for missing bonus and they gave me the same standard response saying it is the merchant's decision to select their category but they manually issue the points to me.", "Since Apple Music is listed, Chase should be able to give you a manual credit. There is no need to fix it as those manual credits won't count against your $1500 total.", "Quote: Yes, they said they\u0092ll manually adjust the credit for me. What I meant by \u0093fix\u0094 is how they\u0092ll make sure all customers can get 5x rewards for Apple Music if the charge itself doesn\u0092t trigger the reward, since it\u0092s a vague \u0093Apple bill\u0094 on the statement.", "There seems to be some wonky category postings. Payment made on the same portal (two different accounts) posted to different categories; although I believed the Jan 3 transaction initially had coded to \"Bills &amp; Utilities\" before the switch, which is why I see still 5x despite the (updated) \"Entertainment\" category. Jan 7, 2020 SPECTRUM Bills &amp; Utilities Jan 3, 2010 SPECTRUM Entertainment Not on the Freedom card, but Sapphire had coded an obvious transit charge to the \"Shopping\" category.", "1", "3"], "HSBC Premier World MasterCard": ["Click here for full rules!", "I'm a recent Premier customer (I like how having 5k/mo via Direct Deposit qualifies you). Looking at the CCs it seems the Premier World Mastercard is a no brainier as the AF is waived  (I guess the con is that it burns a 5/24 slot). The Premier World Elite Mastercard has an effective AF of $195 after the travel and rideshare credit. A few questions I'm hoping some people may know. Is this card worth it? (I know that is subjective) Are there any other major benefits I'm not seeing on the website? Maybe some soft benefits? HSBC tech isn't that great. Do the credits post automatically or does it require calling in? Is the travel portal 1.5cpp and is that interface somewhat easy to navigate?", "Rideshare credits post automatically - no need to call. I've even gotten &gt;$50 in some years... they have a weird way of calculating. Travel portal cpp depends on redemptions. I always redeem for airlines miles and wait for their 30-40% bonus to do so. I get card for free as Premier so that card is surely worth it. Works all over world, great exchange rates, and no or rare fraud nonsense like Cap One. Also offers cell phone insurance so pay your cell bill with this card and they'll cover it against damage.   JHake10 likes this.", "Thanks for the details. I\u0092m looking at the World Elite card as well (the $395 AF version above the base Premier card). It doesn\u0092t seem as lucrative as other cards but does seem decent. I normally transfer points to BA or SQ and HSBC has those covered based on what I read.", "How sensitive is HSBC regarding the number of inquiries/new accounts from other banks?  Thanks.", "I\u0092ve read (nothing to back this up) that if you\u0092re a premier member you should get approved. I\u0092m sure there are limits to this though.", "Thanks.  Just got approved for the card. Would the $50 Uber credit work with UberEat?", "I'm new to the card as well. However, an earlier post noted that purchasing Uber Cash triggered the credit. I'd guess Uber Eats would most likely work too. https://www.flyertalk.com/forum/31662404-post557.html asdfghjk likes this.", "Interesting data point. It seems the points from the HSBC Premier World Elite card post as the transactions clear. My first statement hasn't closed yet and I'm seeing points post to my account. That is pretty snazzy.", "I noticed this as well - interesting! Have you noticed the rounding HSBC does with the Uber credit? I had a $23 ride round down to a $20 credit, and a $17 ride round UP to a $20 credit.", "The benefit for Uber/Lyft for the Premier cards are $50/$100 (depending on card) per calendar year. However, it\u0092s up to $20 a ride. Another poster mentioned HSBCs odd rounding as well. You\u0092d think on the $17 ride you\u0092d just get a $17 credit. I wish HSBC updated their IT. Their main website looks ok but once you login everything seems to be early 2000s.", "That explains it!  And yea, the website (and mobile app) are a bit dated...", "Not to mention the glacial pace of an ACH transfer requiring 3 business days to complete. Or up to 5 days if you initiate the request on a Wednesday,Thursday or Friday. Most banks can complete the transfer in about one day. They just want to cash in on the float of your funds.", "That is true. My direct deposit shows up on the pay date and not two days before like other banks. Their IT isn\u0092t great. With only letting Premier clients get access to certain cards they have a real opportunity to make a good card that actually draws in outside funds.", "29", "33", "34", "35", "36", "37", "38"], "Keeping Capital One Venture? [Cancel, Exchange, Retention Offers]": ["Click here for full rules!", "I get tired of seeing customer services experiences like this. Bank reps need to smarten up.   Horchata likes this.", "I also ran into the same issue.  Downgraded the venture card to quick silver.  Was told that annual fees will be reversed and it never did.  When I called customer service they told me that once the annual fees is assessed they cannot reverse the change even I do a product change because of their terms and conditions.  So be careful with Capitalone.", "Haven't paid an AF on the Venture card since I got it with the match your miles bonus. %59 fee hit yesterday, I called and was told that corporate had decided no more AF waivers. I asked to escalate and got the same message. I have until April 15 to cancel the card and reverse the fee. Asked about converting to the 1.25 venture card and was told that was possible but that the fee wouldn't reverse since I was converting. I guess I'm going to finally cancel completely. Too many other cards out there with better than 1% bonuses. And I've been using them -- my spend on the Venture was only $10,500 last year, down a third from prior years. Will try again in a few weeks.  Otherwise decide if the $59 fee is worth the extra $105 in rebates.", "Also had the same experience that fee could not be waived. Cust svc rep could ni t explain upgrade or downgrade options. Cancelled the card", "$95 AF just posted for my one year old Venture card. CSR credited me $95 to keep it open.  ~$3,500 in spend last 12 months.   akr1970akr likes this.", "Just called in and was able to get my $59 annual fee waived with no hassle - it showed up for the rep right away. Have not paid the fee since opening the card in 2012. I do have Capital One 360 Savings &amp; Checking balances, which may contribute to their willingness to waive the fee.", "Nice. I too had those accounts (though small balances) AND their brokerage but still they played hardball w/ me and would not waive. Glad they allowed you waivers so many times!", "was able to get the $95 fee waived on my venture one card by calling CSR - wasn't a hassle for me. About $7k spend in the past 12 months", "Your Venture One has an annual fee? Strange. Might as well get yourself a Venture card.", "Called CSR regarding the $95 AMF on the Venture card that hit almost 2 months ago. CSR checked and said a waiver is available - didn't need to pretend to cancel or downgrade. First AMF on the account, about $15K spend (mostly Hotels.com) since opening.", "I have a Venture and Spark for Business, opened last November. Planning on keeping one. Which is a good option to keep?", "I'd keep the Venture. Were you able to make the 50k spend for the 200k bonus miles? If so, you should definitely drop the Spark. They just offered the promo again, and maybe will continue to do so in the future. If so, you could churn another 200k.   VinsTravel likes this.", "I called the day that my annual fee posted two times. One time I got an offshore rep and in the morning I used the \"backdoor\" number that I found on google. I spent around 8k-10k on this card last year. They said I only have options to downgrade even when I mentioned the Citi Double Cash essentially provides the same benefit and I was thinking of cancelling. Any idea when fee waiver might potentially show up in account or how to ask for it?", "Fee waived on first call!    I called the number on back of the card. Spoke to a very upbeat and helpful gentleman who immediately understood why I had called. He waived the fee after looking at the account. It took just five minutes. Very pleased with their agent, their app, no foreign transaction fee and ease of use of miles. Spent $10-12K last year and will continue to use it to diversify from Chase and Amex points   akr1970akr likes this.", "13", "17", "18", "19", "20", "21", "22"], "Barclays Arrival Plus, now 70K w/$5k spend": ["Click here for full rules!", "Perfect, good looking out.", "Well, my AF just posted.  I guess I will apply my remaining points to some travel charges I had directed to this card and will then call to request a fee waiver.  I won\u0092t keep the card without some sort of retention offer.", "Well, I called and after the usual rigmarole about all the great benefits I'm going to miss, I was offered the option to downgrade to a no-AF card, presumably Arrival (without the plus). Since I redeemed most of the \"miles\" by now, I declined and closed the card.", "I'm in a similar boat and have yet to make the call. Without an AF, why not downgrade and sock drawer it to preserve the CL?", "I am not the person you asked, but I am sharing the same boat. I want to simplify my life. A credit card that doesn’t do anything for me, especially if relatively new (got the A+ a year ago), isn’t worth keeping even if it doesn’t cost an annual fee. The loss of a $12k credit line doesn’t bother me. The one feature I am considering as a plus of the A+/A cards is the PIN capability for international travel. I mostly have no issues with my preferred card (CSR), but did use the A+ a couple of times for unattended ticket vending machines last year. I was curious to see if it would accept my PIN (it did); I did not compare with the CSR at the time. I still have the Aviator Red card (with the same PIN behavior, I believe). Also on the chopping block, though, once the final 10k AA RDMs post. My ultimate fallback PIN card is a European bank issued MasterCard. Earns me nothing, but good to have for that occasional unattended gas pump. In short, if they offer me the downgrade, I might take it. Have some more European trips coming up, so I can experiment some more with other cards. But it would likely be canceled soon as part of my “simplification” project. Note to self: review USA EMV cards: Availability, Q&amp;A (Chip &amp; PIN or Signature) [2017&gt;] https://www.spotterswiki.com/emv/index.php EkekoBWI likes this.", "Likewise, only reason I app'ed for this is, of course, the bonus. $89 fee for a 2% travel credit only restricted to increments minimum 10K points threshold? No thanks.   notquiteaff likes this.", "Is it increments of 10k? I thought it was the minimum (for travel). I was actually looking for what the increment was the other day since I have some 11800 points to burn.", "You're right, it's minimum 10K.  I just didn't imagine anyone would have that much remaining after nearly a year!  By the way, not that you would want to, but you could use that to offset the annual fee.", "I'm getting deep in the weeds, but the one exception to the 10k threshold ($100 credit) correctly noted above is AF: every 2,500 miles for each $25, as I understand it. Even that doesn't answer the larger question, \"But, why keep it?\" Is it 60 days from AF hitting to be reimbursed in full when canceling or does Barclays operate by different rules?", "Only reason I can envision is unlike nqtaff one has less than 10K and didn't want it to go entirely to waste?  Far as I know, they're subjected to the consumer card act for personal cards, but I'm unsure if it's 30 or 60 days.   notquiteaff likes this.", "No interest in paying the AF in any way.  There are several NAF 2% cash back cards I could use instead if I wanted a flat rebate card.   I still have nearly 12k points because I put some estimated taxes on it, to get my remaining balance beyond the redeemable threshold.  Made some 5 bucks on it, I think (1.87% fee for tax processor) .  Silly games  Visconti likes this.", "I get it, completely. Generally, I never use Paypal but did so with my Freedom on WN flights originating from SFO (assuming it's hard to claim travel insurance from my home airport for \"reasonable expenses\" - you know, don't think that HMB Ritz idea of mine would pass the smell test) because of the rotating 5% thing. Post 2008 (even before), we've been in the golden age of sign up bonuses here in the States that will unlikely be seen again for a long time once this is over. People outside the US are now beginning to understand how great we've had it in this game for a very long time. Here's the thing. Even if we could pay for everything, why in the world would we subsidize the cheesers? Are we chumps? While I'm not willing to break any laws or Amex/Chase T&amp;Cs (the rest I couldn't care less and don't need them, ever), I have no compunction pillaging them until this golden freebie era is behind us.", "Has anyone tried getting a passport renewal fee reimbursed, probably as a manual request?  I doubt it but read one case here of success with a visa fee. Thanks.", "188", "238", "278", "282", "283", "284", "285", "286", "287", "Click here for full rules!", "I bought Universal Studios Hollywood tickets this summer -- through UndercoverTourist.com -- and it worked. A theme park itself may not code as travel, but if you go through a third-party travel agency (or possibly even through Universal's own vacation line if they allow ticket purchases without lodging through that division) it should work next time.", "I've been having an issue getting my 500 miles for completing a profile in the Barclays Travel Community. It's been over a month, and my profile there still shows 0 Community Miles, and no miles have been posted to my linked Barclays Travel+ account. I read there was a longstanding bug preventing miles from being displayed in the Community page, but they still should have been posted to my linked account after the 1st of September. When I messaged Barclays customer service, they replied:  Quote:  ...and asked for documentation that I was offered this \"promotion\". But AFAIK this is procedure is just outlined on the respective sites (barclaycardus.com and barclaycardtravel.com) shown to all users, not a targeted promotion. Anyone else have trouble getting 500 miles? Any pointers?", "No luck, but I'm having the same issue. I've had the card since 2013 and never bothered to sign up for the travel community. Now, I'm hoping to receive the 500 bonus miles in order to hit the minimum redemption threshold more quickly (only use the card for my spotify subscription). I find it strange the CSR says it is a targeted offer; the terms read as if the opportunity to earn bonus points via the travel community is a feature of the card. Hope you can get them to grant you those points.", "Here's what I got today: Quote:", "Awesome, I'll try that route. Thanks!", "Barclays Arrival cards - gone for good?    With AF coming up in the next billing cycle, I thought I'd downgrade my Arrival+ to no AF Arrival. But that card is nowhere to be found on the Barclays web site, nor do I see any recent mention of a similar downgrade here. Can someone confirm if Barclays Arrival cards are now history? If so, any other options for keeping the points w/o the AF?", "What did they say when you called the number on the back of the card and asked about this?", "My A+ card is about to post the annual fee, and I\u0092ll be calling about an AF waiver.  But if they don\u0092t offer one, I will simply apply my accumulated points to some travel expenses I have built up and call it a day, i.e., cancel the card. It\u0092s not one I am emotionally attached to,  There will be a few leftover points, but it doesn\u0092t seem worth worrying about those.", "I haven't called yet, will do after the holidays. I fully expect to be offered no options and will apply the remaining points to some travel expenses I had in the last 120 days, and then close the card.", "Rumor has it that they're only going to do cobranded cards from here on out. The fact that those appear to be all of the ones on their website seems to bear that out, but it's possible you can still downgrade to the no-AF version. Guess one will need to call in to confirm either way.", "My no-AF Arrival still works. I got an Aviator Red around August 2018 and was unable to PC after the second year's AF hit (admittedly, I only called once to inquire). So PCs are not guaranteed even for card families with more life in them.", "With my AF hitting in Jan, looks like canceling is best option now that's there's no AF-free Barclays option. Anyone get the AF waived / credited?", "I hope not. I believe in April 2018 they anticipated all products to feature the new Barclays branding by 2020. Perhaps they will relaunch all of the Barclaycard products as Barclays next year. In March of last year someone spotted new card art for Arrival @ https://www.doctorofcredit.com/new-b...-arrival-card/", "So I just called A+ number on the back of the card and was told that this card is now invitation only. Also, there are no downgrades, upgrades, or product changes. If you have this card, you either pay the AF, or cancel. I only talked to one CSR. Would be interested to see if anyone else has other input.  I did ask if I could product change to the Premier, and was told no.", "Or use the travel credit against the AF.", "187", "237", "277", "281", "282", "283", "284", "285", "286", "288"], "Paying someone's credit card from my account?": ["Click here for full rules!", "I always wonder where the security is in these ACH pulls. We all know basically how credit card security works. But ACH? I figured it relied on, at least, last name. But that doesn't seem to be the case here, at least according to the data points above. Maybe the thinking is that only companies that can reverse ACH pulls can initiate them in the first place? So if you pay a credit card from a checking account, and then the checking account owner cries foul, the cc company just reverses it and tells the cardholder to try again? I'm sure if there was no security, we'd see tons of fraud here, and there really don't seem to be too many reports of it.", "I had issues getting autopay to work for my wife's Chase card from my Chase checking account. Billpay works fine, but I prefer automatic payments.", "1"], "Bank of America Reconsideration?": ["Click here for full rules!", "You need to wait to the snail mail letter to find out the reason for the decline. IMHO it's a waste of time to try to figure out what else to do without that information. Is that total inquiries across the 3 bureaus, or the number of inquiries on whichever bureau that BofA pulled? If BofA only pulled one bureau, all that matters is the inquires on that bureau, not the total inquiries across the 3 bureaus. Meanwhile, do you need $10k CL on your Travel Rewards card?  At BofA, it's prudent to reduce the CL on a new card to as little as you need (to stay below 30% of the CL on any expected future purchases), because BofA can take many many months to free up CL from an old card to be available for new applications.  That's the way to make CL available to new applications at BofA.", "To be clear, the Reconsideration rep told me I have 13 inquiries, lack of installment loan, and lack of significant deposits in my bank account. Are you telling me the letter will be more clear and concise as to what I need to do to get this application approved?", "No, the letter will tell you why the application was rejected. You cannot change the number of inquiries or retroactively create other types of activity on your credit report(s). Sounds as if you should take a year off opening credit cards and use what you have.", "Oh? It sounds like you have experience on this. I thought the reasons that the reconsideration rep outlined were official. Do you think I have a lot of inquiries? It seems like lots of people churn. I think 13 inquiries over 2 years ain't that bad right? At the end of the day, I did paid all of my bills on time and don't keep any balances. I just don't get it.", "13 over 2 years sounds like a lot in my personal opinion.  Were they all credit cardss? Were they all opened/some rejected?", "No. Some are charge cards from AMEX. I think all were ultimately approved cuz I also dealt with Chase reconsideration. I thought you guys got more than 13 inquiries over 2 years. I'm averaging less than 10 per year.", "13 inquiries on one bureau (which is presumably what they told you) is a lot in today's world at several banks. Now, perhaps you are unlucky enough to have every single card pull the same bureau, but still. Someone who isn't doing MS and doesn't have a lot of business expenses is not likely to be able to necessarily do the minimum spend on that many cards a year while still earning category bonuses on cards they already have. I have only about 7 inquiries on 1 bureau and 1 or 2 inquiries on another bureau (0 on the third), and I've been churning several cards (most with higher spend requirements) a year still. But then at least 1 application was for an Amex card where they did not do a hard pull at all (as they often don't for longtime Amex cardholders), so I probably applied for one or two cards more in the past 2 years than my inquiries total shows. (I've been churning almost solely business cards, so my N/24 count is well below 5, despite all those inquiries.)", "I don't know what else to tell you. That's what the rep told me over the phone. I guess I'm locked out of Bank of America then. Oh well. I don't think I can go through 2020 without a new app since I got a card lineup in mind. I guess I'll try other banks then.", "can confirm that 0401 is the only valid number left for personal recon.  similar situation, they pulled my experian and said i had 8 inquiries (7 of which are biz cards, majority chase) over last 2 years.. even if i called in to say these are all business credit cards.. they will still say 1) too short of relationship with BOA. only 1 alaska card from 6 months ago. 2) no deposits or other accounts with them. apparently they are very big on relationship to open cc", "6", "10", "11", "12", "13", "14", "15", "Click here for full rules!", "I just got my recon failed, reason being too many account. It is true I am a churner and had 7/12. Asked what is the # I have to get down to within a month, she said she couldn't answer. Asked if opening a CD or bank account or investment account would help, she said she couldn't answer. Then what is her job?", "I mean, they aren't required to disclose specifics with their underwriting such as how many new accounts are acceptable. It could definitely vary with one's profile. You won't necessarily be approved just because you fall below the \"threshold\" (if there is even a firm one) for new accounts. Keep in mind that all regular underwriting would still apply. Sometimes we fixate too much on these \"x/y/z/12/24\" rules and forget that overall profile still matters and that banks are unlikely to give you specifics such as \"when you are below xyz, you will be approved\". They won't tell you these things because it's not like they want to promise you an approval later, only to have you upset if you are denied for some other reason.", "It just very well maybe (and likely is) whoever you spoke with simply doesn't have the authority/function to approve your requests. Nor are allowed to give information you requested either because they do not know themselves, and or there is  script which must be followed that provides a standard answer. In nearly all areas of CS today who can see or do what is tightly controlled *upstairs*.  Going from a Tier 1 CSA to \"retention\" or whatever still may not get someone what they want because the system is programs are what they are. Years (decades) ago when things were largely paper and pen, and or far less powerful computer systems were in use yes, it was possible to get low level rep or someone to speak personally with a supervisor or someone that could override a system generated response. That today is largely gone. Those who make the decisions/write programs or whatever for approvals, acceptance, retention, offers, etc... likely are far removed from CS departments and take their marching orders from *upstairs*. That is whatever goals BofA or any other CC company has in mind. Probably only persons with enough juice to override these decisions are CEOs and some others very high up on the food chain. CSR, supervisors, various other \"review\" departments obviously don't have that kind of pull. The latter three maybe able to finesse things to within acceptable set parameters, but again the system is what it is.", "I was just denied for the Amtrak World MC (which I've had in the past). Also have credit scores 800+, flawless history. Recon rep cited too many new CC accounts in the past year (3 in the past year, yet none in the past 6 months), and no banking relationship with BofA. However, I have a 17-year continuous CC relationship (2 cards currently open with BofA), which apparently doesn't count for much. She also cited my weak spending on the existing CCs. I offered to reallocate credit from another card, no dice. I just opened a basic Rewards Savings account, plan to dump six figures into it then call back towards the end of the 90-day recon window, and to also put significantly more spend on my existing BofA CCs. I'll be down to 2 new CCs in the past year at that point, and hopefully the savings deposit being in place for a few months by then (plus the spend activity) will help?   LWT3 likes this.", "Since when was 3/24 or 4/24 a lot? I'm at 4/24 if we only take personal cards into account since business cards don't show up on our credit reports right? I've had a BoA credit card for 13 years now, but I put little spending on it since the earn rate sucks. Now I have a card in mind, but you guys are getting me worried.", "Can BoA see that you have biz cards? If not, then your profile looks better since you won't appear as a churner to them right? I've had a BoA credit card and chequing account with them for 13 years now. When I see posts like these, it makes me think that I won't get my new app approved. Can BoA see the credit inquiries on my report? I haven't put my spending on BoA over the years because I just have a basic credit card with them. It's hardly worth the time to put any spending on it. I only kept the card to help make my credit history look good.", "My strategy worked: I made a large savings deposit and was immediately approved for the AGR card upon reconsideration. I would have waited a big longer to let the savings sit. But when I made the deposit in-branch, the teller intro'd me to a manager (naturally, attempting to grow the relationship, pitch me ML products, etc.). At the end of the conversation, I mentioned my denied card app in passing. We called recon together and voila. ^ Incidentally, my wife has zero prior history with BofA and a shorter credit history/lower score, but she was approved for the AGR card instantly online. Looking forward to the 80K combined bonuses!   808traveler likes this.", "Phone Number for Business Card Reconsideration?    Hi all. Searched the post, tried the numbers in the wiki, and yes, the only one that works is 800-354-0401 to get to a live person. However, that live person is in Consumer and couldn't do anything other than to transfer me to someone. Where I sat on hold for 45 minutes earlier listening to inane hold music before having to leave for a meeting. On hold right now for 35 minutes and counting right now while I work.  Anyone have a phone number that works? My stats shouldn't have been an issue, over 800 scores, no personal cards since November 2018, 4 in the last 24 months, thought the Alaska Business Card would be easy...", "I got through for a business card at 866-570-1603. Hold time was probably 25-30 minutes though and they did a business review asking revenue, profit, years in business, etc.", "Thank you! Tried the number and after 20 minutes, got through. My apologies application is now upgraded to in process and pending...", "This number worked.  I actually got a live person almost immediately.  Needed to verify an application due to a fraud alert.", "I miss-dialed. May still be working", "Business Card Numbers    These numbers go directly to the business card credit department. Wait times can be brutal but these are verified numbers to reach a person. It was suggested that calling between 6 pm and 7 pm Eastern time may have shorter wait times. 877-665-5020 877-261-3494 My wife applied for the business card for a new business with $0 income. After faxing the previous two years tax returns per their request, the app was denied. Reason: too little info and no relationship with the bank. The agent said a checking account qualifies as a relationship but did not have a suggested minimum balance or other information.", "Long story short, but I tried to apply for the Bank of America Asiana Card over the phone. The rep was unable to tell me the status after I gave her my info so I checked online. Unfortunately for me, I got declined and this is my first application declined in a while. Not sure what to do and I'm sure my credit score is not a problem. I currently have a Bank of America Travel Rewards card with a credit limit approaching $10,000. What can I do with reconsideration to get my application approved? My understanding is that I can't do a product transfer from BoA Travel Rewards to the Asiana card. If BoA cannot extend anymore credit to me, is it possible to shift some credit from my Travel Rewards card to help get that application approved? Thank you!", "No one here got declined by BoA recently? So I called BoA Recon and asked about my application. They said they cannot reallocate credit from my existing account to help open the Asiana card. Furthermore, I have 6 inquiries in 2019 and a total of 13 inquiries in 2 years. Is this a lot? I don't have an installment loan because I don't need a loan. Even though I don't have any late payments and my bills are always paid in full, I'm still denied. I don't have a lot of deposits in my BoA chequing account because it doesn't make any sense to deposit a lot of money into an account that accrue almost no interest...So what do I do now? Apparently the decision stand and I'm not sure how to move forward on this.", "5", "9", "10", "11", "12", "13", "14", "16"], "How to re-enable United Mileage Plus Explorer signup?": ["Click here for full rules!", "*** Above i noted..that Chase Explorer Support Manager disputed the fact that I signed up for the $250 statement promo credit at all.. he said i signed up for a differnt promo.one that does Not include statement credits..only miles for purchases. so.. \"waiting 6 to 8 weeks\" is immaterial to the issue of the BAIT N SWITCH trick to get people to click a false offer. CHASE IS DECEPTIVE advertising on United Website. I hold both accountable for FRAUD", "Customer service agents and managers at all mass market companies often invent explanations when they do not know what's happening. Have you looked at the thread linked in Troopers reply?", "Interesting offer from Chase today for my Explorer Card: Offer period Feb 1-Mar 31 Spend $600 during the offer period and get an additional 2,200 miles, then an additional 1 bonus mile per dollar up to $9k in spend.  Going to do the first $600 as  that comes to 4.66 or 5.66 miles per dollar spent after factoring 1 or 2 miles per dollar normal earning rate.  Then I will switch back to my CSR and Freedom Unlimited Combo, as I would rather have UR points instead of UA miles. I will note I only use my UA card for UA purchases (tickets and on board), so not sure how targeted this offer is", "I got a slightly different one (though yours is better) 6100 bonus miles for $3500 in spend; 1 bonus mile / $ after that up to 12k total bonus miles. So assuming I spend $3500 or more, that's 2.74 total miles / $ in the first $3500 2 total miles / $ on the next $5900 I'll probably throw some otherwise unbonused spend on it to hit the $3500 threshhold. 2 miles/$ after that doesn't really excite me... UA miles just aren't all that valuable.", "where are you finding these offers, on the web, app or elsewhere??  Thanks.", "Email.  Targeted (since everyone has different offers) The landing page is here:  https://promotions.united.com/offers...tionmilesoffer", "Nice. Thanks for the link. I got the following: Quote: Haven't used the card since October...", "My offer: Tier 1 Spend at least $6,700 on purchases and earn 3,300 additional miles. (or) Tier 2 Spend at least $7,200 on purchases and earn 4,200 additional miles. (or) Tier 3 Spend at least $8,100 on purchases and earn 6,300 additional miles. Not enough to lure me in.", "thanks, no offer here", "\"Here's your personalized opportunity to maximize your bonus miles between February 1 and March 31, 20201.Your offer goal: Spend at least $600 on purchases and earn 2,000 bonus miles.After you spend $600 in total (your offer goal), you'll continue to earn 1 additional mile per $1 spent (up to 9,000 bonus miles).\" For those looking to game this, the footnote says \"Register in the month of February and your purchases will count toward your total spending from February 1 to March 31, 2020. Register in the month of March and your purchases will count toward your total spending from March 1 to March 31, 2020. All registration and spending deadlines are 11:59 p.m. CT on the last day of the month.\"", "Same here: Quote: On the other hand, I received this promotion several days ago: Quote:", "My offer: Quote: Yeaaaaaah, no.   beltway likes this.", "16", "56", "60", "61", "62", "63", "64", "65", "Click here for full rules!", "which card is this and can I product switch to this from a Chase MileagePlan CC?", "It's the old Chase MileagePlus (non-Explorer) card, with no AF and weak earning (1 mile/$2 in spend).  They certainly still exist; my DW has one, which she downgraded to from an Explorer card a few years back, even after the no-fee card had stopped being something you could sign up for directly. The wiki for the current Chase downgrade thread and its predecessor  both mention this as a possible downgrade option, although I don't recall seeing any recent data points, so the info may be stale.", "I have downgraded two cards to both the Mileage Plus and Travel Bank no fee versions in mid 2019.   beltway likes this.", "Is the no-fee MileagePlus card just for keeping the credit line open, or does that also have the increased award availability, BG2 boarding, etc.?", "My wife applied for a CIP Biz card and got the \"We have received your request for a Chase credit card. We'll let you know our decision as soon as possible.\" note. With the 65K offer ending on Wednesday, is it OK for her to apply for this card now or do I need to wait on a decision on the CIP card?  I'd apply myself, but I'm at 6/24.  She's at 3 or 4/24.", "I sill have increased award availability. I downgraded to this card in case I ever need to upgrade back to the Explorer card while being over 5/24. Quote: Applying for another Chase card prior to the CIP being approved could put that application at risk.   beltway likes this.", "OK.    Thanks.  Wish I had seen the end date for the offer before going for the CIP.  Oh well, guess I'll have to wait and maybe go for the CIU in a month or so.", "Can anyone else confirm this?  That's half the reason I keep the MPE card.", "Theres a no fee UA card?", "Yes: https://www.chase.com/personal/credi...k/earn-rewards There is also a free card that is not open for applications, but might still be open for downgrades.", "I want to apply for the new United MPE offer that came out today 60K for $3K spend.  I just looked and received my last bonus on the MPE on 1/16/18, so its been 24 months, barely.  I still have that account open, however, I downgraded it to the free version of the card a year ago.  Am I good to apply for this one?", "Any ideas on how to generate a referral link for the current 60k SUB with $3k spend?  My referral link points to 40k SUB with $2k spend.", "Did the business version of the Explorer card go away?  All I see now is the New \"Business\" card.", "Wont Honor $250 Statement Credit Promo    1/12/20 Signed up for United Explorer Chase Visa while on the United Airlines site shopping for flights. Link said $250 statement credit within 6-8 wks after 1st purchase. Got the card no Info about $250?? Called Chase Got manager and big RUNAROUND excuse saying yes there is such an offer but you didnt get that one.. I said I have screenshot.. They did not care..just kept telling me about offer i supposedly signed up for. CAN YOU SPELL BAIT N SWITCH!!  Im so angry with Chase being a liar about this ... how could I possibly know about an offer much less have screenshot of it. .I needed to book the flight I had paid for a fair lock while waiting for the card to arrive.. The Manager DANIEL (no name) stated hed have a higher manager call me within 72 hrs..No Calls, No msgs. Chase You Are A Liar!!  Beware People..", "Welcome to FT. I suggest you wait the 6-8 wks after your first purchase before contacting Chase.  It's been 2+ wks since you signed up on 1/12.  Assuming you meet the TC, the credit should appear by the second statement. Also, see this thread: Chase refuses to honor Explorer Mileage Plus offer for $250 statement credit.", "15", "55", "59", "60", "61", "62", "63", "64", "66", "Click here for full rules!", "offer is once every 2 years, so yes, sounds like it. FYI the current offer is 40k for 2k spend during first 3 months + 25k bonus for 10k spend in first 6 months. So $1667/mo for the first 6 months gets you 65k miles.", "Hi, anyone know if you get a free bag on a Lufthansa codeshare flight booked on United.com?", "The T&amp;Cs literally say: Eligible Cardmembers will receive their applicable standard checked bag free on flights operated by United or United Express; codeshare flights are not eligible. Check out this thread for more info: Mileage Plus Branded Credit Card and Checked Baggage Fees", "Bueno, merci.", "Quote: Any other recent experiences to share? My birthday is about 10 days before the annual fee is due (it's been billed, and closing date is bday+10).  If I apply for GE should I expect to see the reimbursement before I close my account (I assume they won't reimburse once account is closed)? If I won't get reimbursement I'll open another card and then apply later . . . I have 364 days.", "charged GE fee on 12/22 credit already there on 12/26   drewguy and TravelinSperry like this.", "What if my first flight is on United but my connection is on Air Canada?", "It will still be free, as soon as your ticket show it is free.", "thanks!", "The question is whether you check in with a United counter or not. At the United counter, the bag fee is waived. At the counter of any other airline, it is not. For a UA-AC connection you'd check in at UA, obviously, so you're covered.   greg0ire likes this.", "GE reimbursement for family member    Has anyone tried reimbursing GE fees for family member instead of primary card holder (two scenarios out there - family member as additional card user and family member with not an additional card holder) ... wondering if they just reimburse based on transaction", "Yes, for a family member who is not an authorized user. The credit was based on the transaction, not the applicant.   IndyHoosier likes this.", "Hi all, I have the Chase United Explorer MileagePlus CC which is up for renewal end of the month. I am not keen on paying for the annual fee as I do not use the card. I was thinking of either downgrading or cancelling the card all together. What I do use the card for is booking rewards flights - when I'm booking a United rewards flights, and I sign in, there sometimes is a foot note that says \" Exclusively available to you as a MileagePlus Chase Cardmember\" Are there any cards I could switch to that offers additional award search results or is it only the MileagePlus CC? Thanks", "All 3 of Chase's United-branded CCs, AFAIK, as well as cards no longer being offered like the Select.", "But not the legacy no-fee card, I assume.", "14", "54", "58", "59", "60", "61", "62", "63", "65", "66"], "Best Credit Card For Large Yearly Spends": ["Click here for full rules!", "large purchase coming up, best way to capitalize?    Hi all, I'm hurting my brain trying to figure out the best way to do this. I have a large cash purchase coming up (vicinity of $47,000), and I'm trying to gain as much out of this as I can...if it's possible. I'm open to getting a new card, but it has to be pretty soon as I'm making the purchase on 10/1.  I currently fly only Delta (platinum medallion), and stay at Marriott family hotels. Current credit cards:  US Bank Altitude Reserve, Delta Reserve Amex (my main card, so I can hit the 30/60K boosts and I've already hit the 60K one this year), Marriott Bonvoy Brilliant and a random Amex card I never use (blue?) I've been looking at services like Plastiq or something as simple as Paypal since Venmo has a cap on purchases. What are you best recommendations for making something like this worth it, rather than just writing a check. Thanks!", "If the recipient only accepts cash and you\u0092re looking to services like Plastiq to pay with a card anyway, there\u0092s almost no way to get it to make sense given the fees involved. The sole exception is if you hit a bonus threshold.", "Best Credit Card For Large Yearly Spends    I started a small business last year and had terrible credit at the time. It has, over the course of the last year, grown into a mid-size business. I paid for everything up front this year using debit cards and spent almost 1 million on advertising, 100-150k on travel expenses (all flights on delta), and another 500k on other items that could have been paid for on credit cards. In total I spent just under 2 mil this year that could have been put on credit cards. My business is in the black and we have no loans or debt of any kind. My credit score has improved drastically, but I am only at 690 with Experian. I expect my business spend to increase by about 20% next year and we will continue to run in the black the entire year. I'd like to actually put the spend to use somehow, but I have no idea how best to do that.", "Welcome to FT, shummer79! And, congratulations on your successful business! The first step in your credit card decision is to articulate your goals. Would you like to save money in order to reinvest back into your young business (that would definately be my recommendation at this point in your business lifecycle)? If so, finding a 2% cash back card would help with that objective. Here is one option:  https://www.fidelity.com/cash-manage...signature-card Good luck to you.", "I spend about 1 million a year on credit cards for business.  Does anyone know of any domestic airline card that gives \"top tier\" status for spend alone on their branded cards?    DL waives the spend requirement after one spends 250k/year on their card but I believe they still require a certain amount of flights.  United caps spend only at either Gold or Platinum and not 1K.   I was hoping by spending so much on one airline card I could get top elite status with that airline.   Many thanks.", "Well if you split the $1m between Delta cards that earn MQM, you may be able to.  I guess 60K MQM from the Reserve, then another 20K MQM from the Delta Platinum, which brings you to Diamond MQD waived + 80K MQM, so you'd reach Platinum.  Diamond would still be a bit away though... Don't forget about Jetblue Mosaic after $50K on their card, also Silver on Virgin Atlantic is attainable after via their card.", "The only card gives you outright status is JetBlue.  But it has a smaller footprint. DL is a possibility.  If you fly it often.", "Best Card for a large purchase - Plat Amex or Chase Sapphire Reserve    Hi.  Making a large purchase ($25k) and not sure which card will net me the best mileage option, Amex Platinum or Chase Sapphire Reserve.  All advice welcome.", "I would say all things being equal pick the one that you find is harder to earn points on. I find it alot harder to earn UR so I would probably pick Chase.", "Whichever one you go with, suggest that you call the applicable card issuer and alert them to your planned large purchase.", "If you typically transfer your points, keep in mind that Amex offers transfer bonuses whereas Chase does not.", "Back looking at my next option(s) Recent Cards- CSR(opened 9/22/19) CIP(opened 12/30/19) minimum spend meet on those(HVAC and Appliances ) Up next is windows and siding- enough to meet one, if not two minimum spends(likely with just Down payment(s) other cards held- all opened well over 5 years ago Amex Gold- Business AAdvantage Aviator-personal Chase Mileage Plus-Personal Chase Presidential Plus-Personal Wife has Amex Delta Plat Was thinking of using her referral link and applying for Delta Plat Amex as well New job has me covering more of the southeast US, so UA and I are more just friends now looks like a 75K bonus is about the best I can do- with 3k spend Not sure the reserve would work that well for me with it's AF and overlap other options/suggestions welcome Thanks \\\\//\\\\// ETA: Shoulda waited to apply(got approved)- offer is now 100K miles, granted fee is higher-now $250 say AMEX notice about offer I got was expiring 1/29. Figured they's drop back to standard 30K stuff for a while- guess it's time to call and see if maybe bump me up", "Need Advice for Extremely High Credit Card Spender    Looking for advice: My friend is a ticket broker. He spends upwards of 250K per month on credit cards. He has about 150K in credit. 770 Fico. and is over 5/24. His utilization is extremely high and he pays down cards multiple x per week because he maxes out on his total credit limit. He wants to expand his business and needs more credit. Looking for your help on a strategy for him. He's been rejected from all CapOne. Rejected for limit increases on current cards. He also has a day job where his comp is 100K+ He currently has: AX Plat Citi AA Citi Premier Chase Freedom Chase Sapphire Chase IHG - all of these are personal cards BofA Premium Rewards Alliant Signature WF Biz Plat and a few others.... He does have an LLC but no business cards.", "If the lower FICO is due to the high closing balances on his personal cards he should try opening business cards issued by American Express or Citi and shift spending away from personal to business cards because the balances are not reported. However, he needs to understand that Business cards are opened in the name of the individual, not the company, and when he applies for a business card his personal credit report will be the major consideration.  American Express charge cards do not have formal credit limits, but it practice there will be a cap on the transactions American Express will approve, based on what they know about his financial resources. A Platinum card will not have any higher spending capacity than a Green card.", "21", "25", "26", "27", "28", "29", "30"], "large purchase coming up, best way to capitalize?": ["Click here for full rules!", "large purchase coming up, best way to capitalize?    Hi all, I'm hurting my brain trying to figure out the best way to do this. I have a large cash purchase coming up (vicinity of $47,000), and I'm trying to gain as much out of this as I can...if it's possible. I'm open to getting a new card, but it has to be pretty soon as I'm making the purchase on 10/1.  I currently fly only Delta (platinum medallion), and stay at Marriott family hotels. Current credit cards:  US Bank Altitude Reserve, Delta Reserve Amex (my main card, so I can hit the 30/60K boosts and I've already hit the 60K one this year), Marriott Bonvoy Brilliant and a random Amex card I never use (blue?) I've been looking at services like Plastiq or something as simple as Paypal since Venmo has a cap on purchases. What are you best recommendations for making something like this worth it, rather than just writing a check. Thanks!", "If the recipient only accepts cash and you\u0092re looking to services like Plastiq to pay with a card anyway, there\u0092s almost no way to get it to make sense given the fees involved. The sole exception is if you hit a bonus threshold.", "Best Credit Card For Large Yearly Spends    I started a small business last year and had terrible credit at the time. It has, over the course of the last year, grown into a mid-size business. I paid for everything up front this year using debit cards and spent almost 1 million on advertising, 100-150k on travel expenses (all flights on delta), and another 500k on other items that could have been paid for on credit cards. In total I spent just under 2 mil this year that could have been put on credit cards. My business is in the black and we have no loans or debt of any kind. My credit score has improved drastically, but I am only at 690 with Experian. I expect my business spend to increase by about 20% next year and we will continue to run in the black the entire year. I'd like to actually put the spend to use somehow, but I have no idea how best to do that.", "Welcome to FT, shummer79! And, congratulations on your successful business! The first step in your credit card decision is to articulate your goals. Would you like to save money in order to reinvest back into your young business (that would definately be my recommendation at this point in your business lifecycle)? If so, finding a 2% cash back card would help with that objective. Here is one option:  https://www.fidelity.com/cash-manage...signature-card Good luck to you.", "I spend about 1 million a year on credit cards for business.  Does anyone know of any domestic airline card that gives \"top tier\" status for spend alone on their branded cards?    DL waives the spend requirement after one spends 250k/year on their card but I believe they still require a certain amount of flights.  United caps spend only at either Gold or Platinum and not 1K.   I was hoping by spending so much on one airline card I could get top elite status with that airline.   Many thanks.", "Well if you split the $1m between Delta cards that earn MQM, you may be able to.  I guess 60K MQM from the Reserve, then another 20K MQM from the Delta Platinum, which brings you to Diamond MQD waived + 80K MQM, so you'd reach Platinum.  Diamond would still be a bit away though... Don't forget about Jetblue Mosaic after $50K on their card, also Silver on Virgin Atlantic is attainable after via their card.", "The only card gives you outright status is JetBlue.  But it has a smaller footprint. DL is a possibility.  If you fly it often.", "Best Card for a large purchase - Plat Amex or Chase Sapphire Reserve    Hi.  Making a large purchase ($25k) and not sure which card will net me the best mileage option, Amex Platinum or Chase Sapphire Reserve.  All advice welcome.", "I would say all things being equal pick the one that you find is harder to earn points on. I find it alot harder to earn UR so I would probably pick Chase.", "Whichever one you go with, suggest that you call the applicable card issuer and alert them to your planned large purchase.", "If you typically transfer your points, keep in mind that Amex offers transfer bonuses whereas Chase does not.", "Back looking at my next option(s) Recent Cards- CSR(opened 9/22/19) CIP(opened 12/30/19) minimum spend meet on those(HVAC and Appliances ) Up next is windows and siding- enough to meet one, if not two minimum spends(likely with just Down payment(s) other cards held- all opened well over 5 years ago Amex Gold- Business AAdvantage Aviator-personal Chase Mileage Plus-Personal Chase Presidential Plus-Personal Wife has Amex Delta Plat Was thinking of using her referral link and applying for Delta Plat Amex as well New job has me covering more of the southeast US, so UA and I are more just friends now looks like a 75K bonus is about the best I can do- with 3k spend Not sure the reserve would work that well for me with it's AF and overlap other options/suggestions welcome Thanks \\\\//\\\\// ETA: Shoulda waited to apply(got approved)- offer is now 100K miles, granted fee is higher-now $250 say AMEX notice about offer I got was expiring 1/29. Figured they's drop back to standard 30K stuff for a while- guess it's time to call and see if maybe bump me up", "Need Advice for Extremely High Credit Card Spender    Looking for advice: My friend is a ticket broker. He spends upwards of 250K per month on credit cards. He has about 150K in credit. 770 Fico. and is over 5/24. His utilization is extremely high and he pays down cards multiple x per week because he maxes out on his total credit limit. He wants to expand his business and needs more credit. Looking for your help on a strategy for him. He's been rejected from all CapOne. Rejected for limit increases on current cards. He also has a day job where his comp is 100K+ He currently has: AX Plat Citi AA Citi Premier Chase Freedom Chase Sapphire Chase IHG - all of these are personal cards BofA Premium Rewards Alliant Signature WF Biz Plat and a few others.... He does have an LLC but no business cards.", "If the lower FICO is due to the high closing balances on his personal cards he should try opening business cards issued by American Express or Citi and shift spending away from personal to business cards because the balances are not reported. However, he needs to understand that Business cards are opened in the name of the individual, not the company, and when he applies for a business card his personal credit report will be the major consideration.  American Express charge cards do not have formal credit limits, but it practice there will be a cap on the transactions American Express will approve, based on what they know about his financial resources. A Platinum card will not have any higher spending capacity than a Green card.", "21", "25", "26", "27", "28", "29", "30"], "AAdvantage Red Aviator": ["Click here for full rules!", "Finally got approved again! Had to move some credit over from an existing Jetblue card though but no biggie. I don't remember exactly when but here's a rough timeline. I applied for the US Airways card a couple months before the switch to aviator red (don't even remember the month and year I applied). The switch happened to a world mastercard. Then barclaycard sent me a letter saying it would be switched to a world elite mastercard. I think 6 months after, I applied for another aviator red while the US Airways/Aviator Red was still active. The credit analyst I spoke to said that since the product name of the first one was different from the one I applied for, it would be approved.  Both of those aviator reds were closed last year. I've been trying to get approved for at least a year. Applied this morning with an AA offer (offer was the same as the public one) and got that 10 day message. Checked app status and it showed declined. Called a credit analyst at barclaycard and somewhere in his talk, he said that he could pull my credit and see what he could do. One of the things he asked me was if I was willing to move some credit from my Jetblue card to open the new one. That was the quickest yes I've ever said in my life lol.", "If anyone knows if there are any special promos for opening this card for January 2020 please post. Curious whats advertised in the on board magazine this month. To answer my own question looks like ad is the same deal as December Page 39 has ad http://americanway.ink-live.com/html...d-a945e5687ccc", "New (first time) cardholder application denial question    Hoping I put this in the right place? Helping a friend who has never had a credit card or a mortgage - but has plenty of resources - owns 6 houses, manages then as rentals, makes ~96K/year. Has tax returns current all that jazz. I tried to help him get started on a mileage program as he has been using his debit card only for decades. His credit score according to Karma is 750. He has plenty in a couple bank accounts and investments with Schwab of 300K or more. He's 72, but not very computer or credit savvy cuz he's always used cash or his debit. He did get a Nissan Auto Loan (first in his lifetime) for $34K about 4-5 months ago. Because I have 2 Barclays - I helped him fill out the Barclay 60K bonus card app (personal). In about a week he got a denial cuz he has zero credit history. (Including nothing negative) - only 1 hard pull from this application showing. Is this one where we should call in and plead his case with a human? Or is there a better solution? There's still Citi - because we're shooting for AA miles for OneWorld Travel.. Thank you in advance.....", "What your friend could do is try calling Barclaycard's backdoor number. The call essentially goes straight to a credit analyst. They're the ones that can potentially change the denial to an approval. I called them a month ago after applying for the Aviator Red and seeing a denial not too soon after. After a bit of talking, the credit analyst allowed me to move credit over from an existing account to open this one. So you never know. Check your messages..   bloomz likes this.", "I still have an Aviator Red with the 10k annual miles bonus. At one point I had three Reds, but slimmed down to just one.  I've had it at least five years but hardly put spend on it.  What are my odds of getting the 60k bonus on a new app ?  I could use a refresh of my AA balances after some recent redemptions.  Not many avenues open to me at this point. I have months to wait before I can apply for anymore Citi AA cards.  I'm thinking of trying to pick up one each of the Aviator personal and biz in the meantime. Recent data points seem inconclusive, and not seeing many where people applied while still holding an active personal card.  Any perspectives ?", "I've had the US Airways card later converted to the Aviator Red (applied not too soon before new applications were shut off) and another Aviator Red a couple months after that. I closed the first and second one some time before the second acct's 1st anniversary (I don't even remember the rough dates). Ever since then, I've been trying to get another approved with no luck. I applied last month and got that \"we need more time\" message. Went to status check and said declined. Called them and the guy on the phone mentioned why so many apps and other things. After I said Yes to moving credit around, he finally approved me. By my rough estimates, it took two years to get approved again. But then again maybe it's because I kept applying every few months. At least the denial letters I got stated that no credit report was pulled.", "Congrats. Even back in the day when Barclays was not so sensitive to number of apps with other banks ( as today); they were sensitive to  how fast you reapply after a denial, it was around 6-12 months depended on the person's profile.", "It's still possible, I also opened a new one less than 12 months after closing the prior. I also had to call in and chat them up. I think it helped that I had a different Barclays product on which I charged over $25K during the prior 12 month period.  Was also above the 6 or 7/24 threshold.", "I previously had a Citi Platinum Select World Elite MC and converted it three years ago to a Bronze World MC to avoid the AF. Am I eligible for this offer. If so, will bonus miles be applied to my existing AA account?", "Neither Barclay nor Citi care whether/when you have/had an AA card from the other, per se. That other card just gets considered along with all the others you have for total credit, number of applications, and the like. And, yes, points earned on both will go into the same AA account if you give the same one to both of them.", "Has anyone tried to add an authorized user on the website lately?  The online form seems to be missing the place to enter the authorized user's SSN (I haven't done this in a couple years but it was definitely there like 1.5 year ago).  Without attaching SSN info, the AU can't really build credit history by being my AU, right?", "I added a friend as an authorized user on my Aviator business acct to get the 10k bonus miles and it didn't ask for ssn. Not sure about personal version though.", "6", "56", "96", "100", "101", "102", "103", "104", "105"], "AA aviator card... how much time needed before I reapply?": ["Click here for full rules!", "Finally got approved again! Had to move some credit over from an existing Jetblue card though but no biggie. I don't remember exactly when but here's a rough timeline. I applied for the US Airways card a couple months before the switch to aviator red (don't even remember the month and year I applied). The switch happened to a world mastercard. Then barclaycard sent me a letter saying it would be switched to a world elite mastercard. I think 6 months after, I applied for another aviator red while the US Airways/Aviator Red was still active. The credit analyst I spoke to said that since the product name of the first one was different from the one I applied for, it would be approved.  Both of those aviator reds were closed last year. I've been trying to get approved for at least a year. Applied this morning with an AA offer (offer was the same as the public one) and got that 10 day message. Checked app status and it showed declined. Called a credit analyst at barclaycard and somewhere in his talk, he said that he could pull my credit and see what he could do. One of the things he asked me was if I was willing to move some credit from my Jetblue card to open the new one. That was the quickest yes I've ever said in my life lol.", "If anyone knows if there are any special promos for opening this card for January 2020 please post. Curious whats advertised in the on board magazine this month. To answer my own question looks like ad is the same deal as December Page 39 has ad http://americanway.ink-live.com/html...d-a945e5687ccc", "New (first time) cardholder application denial question    Hoping I put this in the right place? Helping a friend who has never had a credit card or a mortgage - but has plenty of resources - owns 6 houses, manages then as rentals, makes ~96K/year. Has tax returns current all that jazz. I tried to help him get started on a mileage program as he has been using his debit card only for decades. His credit score according to Karma is 750. He has plenty in a couple bank accounts and investments with Schwab of 300K or more. He's 72, but not very computer or credit savvy cuz he's always used cash or his debit. He did get a Nissan Auto Loan (first in his lifetime) for $34K about 4-5 months ago. Because I have 2 Barclays - I helped him fill out the Barclay 60K bonus card app (personal). In about a week he got a denial cuz he has zero credit history. (Including nothing negative) - only 1 hard pull from this application showing. Is this one where we should call in and plead his case with a human? Or is there a better solution? There's still Citi - because we're shooting for AA miles for OneWorld Travel.. Thank you in advance.....", "What your friend could do is try calling Barclaycard's backdoor number. The call essentially goes straight to a credit analyst. They're the ones that can potentially change the denial to an approval. I called them a month ago after applying for the Aviator Red and seeing a denial not too soon after. After a bit of talking, the credit analyst allowed me to move credit over from an existing account to open this one. So you never know. Check your messages..   bloomz likes this.", "I still have an Aviator Red with the 10k annual miles bonus. At one point I had three Reds, but slimmed down to just one.  I've had it at least five years but hardly put spend on it.  What are my odds of getting the 60k bonus on a new app ?  I could use a refresh of my AA balances after some recent redemptions.  Not many avenues open to me at this point. I have months to wait before I can apply for anymore Citi AA cards.  I'm thinking of trying to pick up one each of the Aviator personal and biz in the meantime. Recent data points seem inconclusive, and not seeing many where people applied while still holding an active personal card.  Any perspectives ?", "I've had the US Airways card later converted to the Aviator Red (applied not too soon before new applications were shut off) and another Aviator Red a couple months after that. I closed the first and second one some time before the second acct's 1st anniversary (I don't even remember the rough dates). Ever since then, I've been trying to get another approved with no luck. I applied last month and got that \"we need more time\" message. Went to status check and said declined. Called them and the guy on the phone mentioned why so many apps and other things. After I said Yes to moving credit around, he finally approved me. By my rough estimates, it took two years to get approved again. But then again maybe it's because I kept applying every few months. At least the denial letters I got stated that no credit report was pulled.", "Congrats. Even back in the day when Barclays was not so sensitive to number of apps with other banks ( as today); they were sensitive to  how fast you reapply after a denial, it was around 6-12 months depended on the person's profile.", "It's still possible, I also opened a new one less than 12 months after closing the prior. I also had to call in and chat them up. I think it helped that I had a different Barclays product on which I charged over $25K during the prior 12 month period.  Was also above the 6 or 7/24 threshold.", "I previously had a Citi Platinum Select World Elite MC and converted it three years ago to a Bronze World MC to avoid the AF. Am I eligible for this offer. If so, will bonus miles be applied to my existing AA account?", "Neither Barclay nor Citi care whether/when you have/had an AA card from the other, per se. That other card just gets considered along with all the others you have for total credit, number of applications, and the like. And, yes, points earned on both will go into the same AA account if you give the same one to both of them.", "Has anyone tried to add an authorized user on the website lately?  The online form seems to be missing the place to enter the authorized user's SSN (I haven't done this in a couple years but it was definitely there like 1.5 year ago).  Without attaching SSN info, the AU can't really build credit history by being my AU, right?", "I added a friend as an authorized user on my Aviator business acct to get the 10k bonus miles and it didn't ask for ssn. Not sure about personal version though.", "6", "56", "96", "100", "101", "102", "103", "104", "105"], "Worried about BoA Alaska Airlines Credit Card Denial": ["Click here for full rules!", "just following up: I called BOFA and you can manually add the referral (2k for card holder and referral for employee) up to 30 days after application approval...Cheers.", "More of a question regarding BOFA rules. But if I applied under 30 days ago for a Alaska Business Card am I still able to apply for say the Asiana personal Card (BoFA) ASAP?", "Its been a long time since I applied for a credit card.  I am good with the 2/3/4 rule. Just read there is now a 24 month rule. I am thinking about applying for the Personal Alaska Airlines credit card.  Under the T and C I not not see the 24 month restriction \"This card will not be available to you if you currently have or have had the card in the preceding 24 month period. This does not apply to the business credit card product.\" I read the T and C very carefully and I only see the language of new account only for bonus. My last personal card with Alaska Airlines was about 1 1/2 years ago.  Should I be okay with the 24 month restriction as I don't see it on the T and C? Also, will Alaska Airlines approve the application if it doesn't meet the 2/3/4 and 24 month restriction rule?", "If you mean that it's been a long time since you applied for any credit card (from any bank), then yes. But otherwise, BofA is also implementing something very roughly similar to Chase 5/24, but with variations. But the simple way to put it is:  If you're LOL/24, chances are you'll have problems now at BofA too. As you can see, the original 2/3/4 thread has been expanded to cover other anti-churning rules and its title has been altered in the process; BofA's anti-churning policies: 2/3/4 (BofA cards), 3/12 or 7/12 (all banks)", "So should I have received some sort of email acknowledgement that I applied for the business card? BoA's website hung on the click to submit application page; however, a HP did show up on my credit report. Other than that, no indication of anything. *edit* Guess it worked, as I received an approval email today.", "I got denied for the Alaska Biz, and got an email asking for tax documents and proof.  have no relationship with them.  maybe like 18 years ago I did.  so my question is what are the next steps to get a better chance of approval? i signed up for a checking, any other tips?", "You could send them the tax documents and proof.", "Received a targeted e-mail from Alaska for the card. SUB: $100 statement credit + 40,000 bonus miles + companion fare w/ $2K spend in 90 days. App\u0092ed and approved.", "nah, I've read many DPs of how useless it is to do that. Considering I applied as a sole prop. There isnt anything for me to give except my personal tax returns. Does anyone else know the relationship situation with BoA for the Biz card?", "Then only send the tax returns. That's why I was told when I called in asking about that letter, as a sole prop applicant. Still, I was denied (again) last month, and one of the reasons given was lack of BofA relationship. When I asked what relationships count, they implied any sort of non-card account at BofA, so I opened up a BofA savings account and may try again in another half year or so. (I thought about a CD, but that seemed too much work to worry about renewing at the right time and all that.)", "5", "55", "95", "99", "100", "101", "102", "103", "104", "Click here for full rules!", "Every person's credit situation (and application, even) is different, and I was just speculating as to the reason for mflyer1's success, in comparison to their previous lack thereof. All other things being equal, I think everyone would agree that less HPs are better than more, which would seem to be what mflyer1 freshly brought to the table the last time around. In addition, I think a lot of us would agree that BoA is more sensitive now to various churner characteristics, HPs definitely included, than they used to be.", "Which credit bureau does BoA pull for business credit cards?  Mostly TransUnion?", "Depends. They've pulled TU and EXP on ours. Shouldn't matter though should it?   Dream of Flying likes this.", "They don't pull business credit reports. You are responsible for the account. That's why they want your SS #.", "They may pull business credit reports, but that would be in addition to pulling a personal credit report. When they denied me earlier this year, it was on the basis of saying that my business credit history was too thin. Of course, that's because they used a business credit report which didn't show all banks that I had had business cards with (it couldn't have shown any Amex business cards, for example). But obviously they had to pull some business credit report to be able to make this (faulty) determination. My personal credit history has one card that goes back 30ish years, another that goes back 20ish years, and I have a credit score well above 800 per CK. So the only thing they thought was thin was my business credit report (they claimed only 2 business cards and only in the past 2 years or so, and 1 of those was a previous BofA Alaska business card). By that time'd I'd had several Amex business cards over several years, a Citi business cards about 3 years ago, a couple Chase business cards in the past year or two, and a US Bank business card. I would guess that it was the US Bank card that was the other business card they saw, since that was the only bank other than BofA with which I'd had only one business card and only in the last 2 years or so.", "Well I hope they don’t pull EX since it already has 6 inquiries while TU only has 2.  I am looking at BoA Biz and US Bank Biz cards, both are said to likely pull TU.", "Hate BoA but love Alaska. Low on miles so called up Alaska reservations, told the agent I was going to apply for business card, did he want me to add his employee # b/c application had spot for it, he gladly gave me his #, approved but with only 11.5k. Lent a friend 202k miles and she'll pay be back by charging 202K to my cards. Still hate BoA.", "Recently applied for Biz class with legit business history of 10yrs. No history with BOFA. Application went pending. Received an email asking to open $1K CD for recon. All done &amp; was finally approved on 12/18. Recently denied AA Citi Biz card. Am thinking of applying for personal one too, CS 785..what are the chances of it getting approved. Have not opened any new personal credit card in many years cause mostly all has been under business.", "Feeling emboldened. Plan on opening a business Alaska cc for my husband this morn, after I call Alaska and get an employee # for the extra 2k. He's way under 5/24, but this month was approved for personal &amp; business Chase SWA (it's his time to get the SWA CP as I'm finishing up my 2 yr SWA CP). I'd forgotten we used to rinse and repeat Alaska Air cards for years, but then stopped using them altogether (together we have about 30 cards). BoA cancelled the whole bunch (the nerve of them). If I remember correctly, they always waivse the AF too. My shame: I never used the companion ticket, but will this go round. We still use the expired cards to get into museums for free. Love that benefit.", "Any idea if BOFA will match the 40k offer i signed up for for the 42k offer i have been seeing? (i was approved a week ago...)? Thanks!", "Anyone has experience applying two business cards - one legit business name using FEIN and other one for part time business using personal name as business using SSN?", "I have two Alaska business cards from BOA with SSN only.", "Can you tell me how far apart did you apply your business cards? Did you have to prove anything for the 2nd business? Thx!", "42,000 offer is one offered onboard AS flight or Alaska BEYOND magazine. Application must be turned in to FA or add their employee name /number on application. You could tell them you intended to apply at Alaskaoffer.com. This is the 42,000 site. For AS Signature card. that said, calling in and asking might be worth a try. BofA is not as customer service friendly- as Alaska airlines is.", "applied 3 months apart and both approved instantly. been BOA customer more than 15 years.   jiaogulan likes this.", "4", "54", "94", "98", "99", "100", "101", "102", "103", "105"], "Making large purchase but which c card?": ["Click here for full rules!", "large purchase coming up, best way to capitalize?    Hi all, I'm hurting my brain trying to figure out the best way to do this. I have a large cash purchase coming up (vicinity of $47,000), and I'm trying to gain as much out of this as I can...if it's possible. I'm open to getting a new card, but it has to be pretty soon as I'm making the purchase on 10/1.  I currently fly only Delta (platinum medallion), and stay at Marriott family hotels. Current credit cards:  US Bank Altitude Reserve, Delta Reserve Amex (my main card, so I can hit the 30/60K boosts and I've already hit the 60K one this year), Marriott Bonvoy Brilliant and a random Amex card I never use (blue?) I've been looking at services like Plastiq or something as simple as Paypal since Venmo has a cap on purchases. What are you best recommendations for making something like this worth it, rather than just writing a check. Thanks!", "If the recipient only accepts cash and you\u0092re looking to services like Plastiq to pay with a card anyway, there\u0092s almost no way to get it to make sense given the fees involved. The sole exception is if you hit a bonus threshold.", "Best Credit Card For Large Yearly Spends    I started a small business last year and had terrible credit at the time. It has, over the course of the last year, grown into a mid-size business. I paid for everything up front this year using debit cards and spent almost 1 million on advertising, 100-150k on travel expenses (all flights on delta), and another 500k on other items that could have been paid for on credit cards. In total I spent just under 2 mil this year that could have been put on credit cards. My business is in the black and we have no loans or debt of any kind. My credit score has improved drastically, but I am only at 690 with Experian. I expect my business spend to increase by about 20% next year and we will continue to run in the black the entire year. I'd like to actually put the spend to use somehow, but I have no idea how best to do that.", "Welcome to FT, shummer79! And, congratulations on your successful business! The first step in your credit card decision is to articulate your goals. Would you like to save money in order to reinvest back into your young business (that would definately be my recommendation at this point in your business lifecycle)? If so, finding a 2% cash back card would help with that objective. Here is one option:  https://www.fidelity.com/cash-manage...signature-card Good luck to you.", "I spend about 1 million a year on credit cards for business.  Does anyone know of any domestic airline card that gives \"top tier\" status for spend alone on their branded cards?    DL waives the spend requirement after one spends 250k/year on their card but I believe they still require a certain amount of flights.  United caps spend only at either Gold or Platinum and not 1K.   I was hoping by spending so much on one airline card I could get top elite status with that airline.   Many thanks.", "Well if you split the $1m between Delta cards that earn MQM, you may be able to.  I guess 60K MQM from the Reserve, then another 20K MQM from the Delta Platinum, which brings you to Diamond MQD waived + 80K MQM, so you'd reach Platinum.  Diamond would still be a bit away though... Don't forget about Jetblue Mosaic after $50K on their card, also Silver on Virgin Atlantic is attainable after via their card.", "The only card gives you outright status is JetBlue.  But it has a smaller footprint. DL is a possibility.  If you fly it often.", "Best Card for a large purchase - Plat Amex or Chase Sapphire Reserve    Hi.  Making a large purchase ($25k) and not sure which card will net me the best mileage option, Amex Platinum or Chase Sapphire Reserve.  All advice welcome.", "I would say all things being equal pick the one that you find is harder to earn points on. I find it alot harder to earn UR so I would probably pick Chase.", "Whichever one you go with, suggest that you call the applicable card issuer and alert them to your planned large purchase.", "If you typically transfer your points, keep in mind that Amex offers transfer bonuses whereas Chase does not.", "Back looking at my next option(s) Recent Cards- CSR(opened 9/22/19) CIP(opened 12/30/19) minimum spend meet on those(HVAC and Appliances ) Up next is windows and siding- enough to meet one, if not two minimum spends(likely with just Down payment(s) other cards held- all opened well over 5 years ago Amex Gold- Business AAdvantage Aviator-personal Chase Mileage Plus-Personal Chase Presidential Plus-Personal Wife has Amex Delta Plat Was thinking of using her referral link and applying for Delta Plat Amex as well New job has me covering more of the southeast US, so UA and I are more just friends now looks like a 75K bonus is about the best I can do- with 3k spend Not sure the reserve would work that well for me with it's AF and overlap other options/suggestions welcome Thanks \\\\//\\\\// ETA: Shoulda waited to apply(got approved)- offer is now 100K miles, granted fee is higher-now $250 say AMEX notice about offer I got was expiring 1/29. Figured they's drop back to standard 30K stuff for a while- guess it's time to call and see if maybe bump me up", "Need Advice for Extremely High Credit Card Spender    Looking for advice: My friend is a ticket broker. He spends upwards of 250K per month on credit cards. He has about 150K in credit. 770 Fico. and is over 5/24. His utilization is extremely high and he pays down cards multiple x per week because he maxes out on his total credit limit. He wants to expand his business and needs more credit. Looking for your help on a strategy for him. He's been rejected from all CapOne. Rejected for limit increases on current cards. He also has a day job where his comp is 100K+ He currently has: AX Plat Citi AA Citi Premier Chase Freedom Chase Sapphire Chase IHG - all of these are personal cards BofA Premium Rewards Alliant Signature WF Biz Plat and a few others.... He does have an LLC but no business cards.", "If the lower FICO is due to the high closing balances on his personal cards he should try opening business cards issued by American Express or Citi and shift spending away from personal to business cards because the balances are not reported. However, he needs to understand that Business cards are opened in the name of the individual, not the company, and when he applies for a business card his personal credit report will be the major consideration.  American Express charge cards do not have formal credit limits, but it practice there will be a cap on the transactions American Express will approve, based on what they know about his financial resources. A Platinum card will not have any higher spending capacity than a Green card.", "21", "25", "26", "27", "28", "29", "30"], "Best credit card to furnish house": ["Click here for full rules!", "large purchase coming up, best way to capitalize?    Hi all, I'm hurting my brain trying to figure out the best way to do this. I have a large cash purchase coming up (vicinity of $47,000), and I'm trying to gain as much out of this as I can...if it's possible. I'm open to getting a new card, but it has to be pretty soon as I'm making the purchase on 10/1.  I currently fly only Delta (platinum medallion), and stay at Marriott family hotels. Current credit cards:  US Bank Altitude Reserve, Delta Reserve Amex (my main card, so I can hit the 30/60K boosts and I've already hit the 60K one this year), Marriott Bonvoy Brilliant and a random Amex card I never use (blue?) I've been looking at services like Plastiq or something as simple as Paypal since Venmo has a cap on purchases. What are you best recommendations for making something like this worth it, rather than just writing a check. Thanks!", "If the recipient only accepts cash and you\u0092re looking to services like Plastiq to pay with a card anyway, there\u0092s almost no way to get it to make sense given the fees involved. The sole exception is if you hit a bonus threshold.", "Best Credit Card For Large Yearly Spends    I started a small business last year and had terrible credit at the time. It has, over the course of the last year, grown into a mid-size business. I paid for everything up front this year using debit cards and spent almost 1 million on advertising, 100-150k on travel expenses (all flights on delta), and another 500k on other items that could have been paid for on credit cards. In total I spent just under 2 mil this year that could have been put on credit cards. My business is in the black and we have no loans or debt of any kind. My credit score has improved drastically, but I am only at 690 with Experian. I expect my business spend to increase by about 20% next year and we will continue to run in the black the entire year. I'd like to actually put the spend to use somehow, but I have no idea how best to do that.", "Welcome to FT, shummer79! And, congratulations on your successful business! The first step in your credit card decision is to articulate your goals. Would you like to save money in order to reinvest back into your young business (that would definately be my recommendation at this point in your business lifecycle)? If so, finding a 2% cash back card would help with that objective. Here is one option:  https://www.fidelity.com/cash-manage...signature-card Good luck to you.", "I spend about 1 million a year on credit cards for business.  Does anyone know of any domestic airline card that gives \"top tier\" status for spend alone on their branded cards?    DL waives the spend requirement after one spends 250k/year on their card but I believe they still require a certain amount of flights.  United caps spend only at either Gold or Platinum and not 1K.   I was hoping by spending so much on one airline card I could get top elite status with that airline.   Many thanks.", "Well if you split the $1m between Delta cards that earn MQM, you may be able to.  I guess 60K MQM from the Reserve, then another 20K MQM from the Delta Platinum, which brings you to Diamond MQD waived + 80K MQM, so you'd reach Platinum.  Diamond would still be a bit away though... Don't forget about Jetblue Mosaic after $50K on their card, also Silver on Virgin Atlantic is attainable after via their card.", "The only card gives you outright status is JetBlue.  But it has a smaller footprint. DL is a possibility.  If you fly it often.", "Best Card for a large purchase - Plat Amex or Chase Sapphire Reserve    Hi.  Making a large purchase ($25k) and not sure which card will net me the best mileage option, Amex Platinum or Chase Sapphire Reserve.  All advice welcome.", "I would say all things being equal pick the one that you find is harder to earn points on. I find it alot harder to earn UR so I would probably pick Chase.", "Whichever one you go with, suggest that you call the applicable card issuer and alert them to your planned large purchase.", "If you typically transfer your points, keep in mind that Amex offers transfer bonuses whereas Chase does not.", "Back looking at my next option(s) Recent Cards- CSR(opened 9/22/19) CIP(opened 12/30/19) minimum spend meet on those(HVAC and Appliances ) Up next is windows and siding- enough to meet one, if not two minimum spends(likely with just Down payment(s) other cards held- all opened well over 5 years ago Amex Gold- Business AAdvantage Aviator-personal Chase Mileage Plus-Personal Chase Presidential Plus-Personal Wife has Amex Delta Plat Was thinking of using her referral link and applying for Delta Plat Amex as well New job has me covering more of the southeast US, so UA and I are more just friends now looks like a 75K bonus is about the best I can do- with 3k spend Not sure the reserve would work that well for me with it's AF and overlap other options/suggestions welcome Thanks \\\\//\\\\// ETA: Shoulda waited to apply(got approved)- offer is now 100K miles, granted fee is higher-now $250 say AMEX notice about offer I got was expiring 1/29. Figured they's drop back to standard 30K stuff for a while- guess it's time to call and see if maybe bump me up", "Need Advice for Extremely High Credit Card Spender    Looking for advice: My friend is a ticket broker. He spends upwards of 250K per month on credit cards. He has about 150K in credit. 770 Fico. and is over 5/24. His utilization is extremely high and he pays down cards multiple x per week because he maxes out on his total credit limit. He wants to expand his business and needs more credit. Looking for your help on a strategy for him. He's been rejected from all CapOne. Rejected for limit increases on current cards. He also has a day job where his comp is 100K+ He currently has: AX Plat Citi AA Citi Premier Chase Freedom Chase Sapphire Chase IHG - all of these are personal cards BofA Premium Rewards Alliant Signature WF Biz Plat and a few others.... He does have an LLC but no business cards.", "If the lower FICO is due to the high closing balances on his personal cards he should try opening business cards issued by American Express or Citi and shift spending away from personal to business cards because the balances are not reported. However, he needs to understand that Business cards are opened in the name of the individual, not the company, and when he applies for a business card his personal credit report will be the major consideration.  American Express charge cards do not have formal credit limits, but it practice there will be a cap on the transactions American Express will approve, based on what they know about his financial resources. A Platinum card will not have any higher spending capacity than a Green card.", "21", "25", "26", "27", "28", "29", "30"], "Is Capital One always this slow?": ["Click here for full rules!", "Later on, if you decide you don't want to pay the annual fee, you can downgrade to the VentureOne (which is what we did).  What's cool about that (for us anyway) is that it still gives us access to the Cap One/Hotels.com deal.  You still get 10 points per dollar with that, so really more points from the deal if you have the Venture One card.   tstauck likes this.", "I have the Venture Rewards card. How hard is it to get the Spark for Business card ? I have a small (&lt; $5K) side business, excellent credit, but a lot of recent cards.", "DP: Successfully used Capital One miles to purchase erase Undercover Tourist charge (for Universal Orlando tickets)", "Anyone have experience using purchase erase for VRBO charges? I've read that Chase now considers VRBO to be travel (at least most of the time), but I can't find any hard evidence on Capital One.", "My wife just got a targeted offer of the Cap One Venture card with a 60k signup bonus. I am leary of Cap One, having personally been denied recently and the Cap One three bureau credit pull. Also, my wife's credit score dropped from 810 to 720 five months ago, and she has five other CCs open. Normally, I wouldn't even consider having her apply for this card, but are her chances approved with the targeted offer?? Clearly, the offer was generated well after the credit score drop, so presumably Cap One is not unhappy about the 720 score.  Any experiences with targeted offers would be appreciated.", "To update this with a DP now that I've made the booking, in my case the rental company who posted the property on VRBO was the merchant on the CC charge, with VRBO showing up for the \"service fee\" portion, which was about 10% of the total booking charge. The actual VRBO charge showed up as \"other services\" so I couldn't use purchase eraser for that portion but fortunately the rental company charge coded as \"lodging\" so I was able to use purchase eraser for 90% of the total booking fee. I did ask them what their MCC was just to see what Cap One considers travel, but the rental company wouldn't tell me other than to say they were listed as \"vacation rentals.\" In any event I've read that sometimes these merchants show up as Real Estate or Other Services, so YMMV. I also don't know if VRBO ever takes the full booking fee themselves or if the majority portion is always passed on to the property manager or owner directly. I'd be interested to hear if anyone else has experience with this for future reference, as well as how airbnb works. I typically use the Chase Ultimate Reward portal to book hotels at 1.5c per point with my CSR (or transfer to Hyatt, etc directly), but started accruing Capital One Rewards Miles specifically for vacation rentals as there aren't many other ways to use points for those properties.", "I applied for the Cap One Venture card, not as a targeted offer, with about a 720 score and got an instant $10k+ credit line approval.  That was my 4th card for 2019 and no issues (Discover, Marriott AMEX, Barclays about every 3 months before that). Hope that helps.", "My wife applied this morning and was rejected, even though she has apparently had less recent credit card activity than you.   So we officially hate Capital One.  Why do they bother to send targeted offers if they are going to do this??  Not to mention the multiple hard pulls.  Uggh.", "Both my friend and I were targeted for the same offer.  She has 820 credit score and 4 credit cards open in the last year with the last one back in November.  She was denied.  I have not tired yet.  Debating.", "38", "42", "43", "44", "45", "46", "47"], "Denied Hyatt - when to try again": ["Click here for full rules!", "I assume you mean 12/6/19.  If that is the correct date there's no need to wait.  I'd also suggest you look at the wikipost at the top of the page for more good info.", "Oops yeah I meant 12-6-19.  Application date was stuck in my head when typing that.  I read the wiki and other bloggers who mentioned that it might be \"safer\" to apply the next month?", "I'm surprised you even asked the question considering that \"next month\" is &lt; 4 days away.", "Would like some advice on the next best cards to open next. Already have a CSP, and am likely at 4 or 5/24 (how can I tell for sure). I do have a real business with an EIN number if that helps.  P2 has a CS (downgraded CSP) and IHG, but is likely only at 2 or 3/24.  Thanks in advance.", "Look at your current credit report and count the credit cards (both currently open and since closed) that were opened in the last 24 months. It's the only reliably accurate method.", "Thats what I thought but was hoping I could see it in one of the free services like CK or even the credit card programs.", "The data is available on Credit Karma. Click on Dashboard and then click on TU or EQ. Scroll down and you'll see \"Credit Report\"  The opening date is found after clicking on each card.", "Thank you.  Very Helpful! So it looks like I'm 4/24 and my wife is 1/24.  So CIP for both of us? (Can we each open an biz card?) That would put me at 5/24, so what's next for my wife?", "Obtaining a Chase business card does not add to the numerator of your x/24 count. If you are at 4/24 and are subsequently approved for a CIP, you would remain at 4/24.", "Those are fine, just make sure it's a current (recent) report.", "Thats good to hear. So what\u0092s the best order to apply? CIP, CIC, UMP?", "Get CIP first; after approval, refer CIP to spouse.   If you feel adventurous, in about 3 months, have spouse refer you for another CIP (this time, apply with EIN).  I can't guarantee how Chase will feel about this but there have been many (past) data points of folks getting multiple CIPs.", "What should he apply with the first time if not  using an  EIN?", "SS# Quote: Why the 3 month wait? Also, should I look into the United Explorer or MileagePlus cards? Planing on converting UR to United likely anyway.", "Moderator action    Discussion continues here: Applying for Chase Credit Cards", "102", "152", "192", "196", "197", "198", "199", "200", "201"], "Barclays Arrival Plus Card: Possible to pay for Airline Lounge Membership Fees?": ["Click here for full rules!", "Perfect, good looking out.", "Well, my AF just posted.  I guess I will apply my remaining points to some travel charges I had directed to this card and will then call to request a fee waiver.  I won\u0092t keep the card without some sort of retention offer.", "Well, I called and after the usual rigmarole about all the great benefits I'm going to miss, I was offered the option to downgrade to a no-AF card, presumably Arrival (without the plus). Since I redeemed most of the \"miles\" by now, I declined and closed the card.", "I'm in a similar boat and have yet to make the call. Without an AF, why not downgrade and sock drawer it to preserve the CL?", "I am not the person you asked, but I am sharing the same boat. I want to simplify my life. A credit card that doesn’t do anything for me, especially if relatively new (got the A+ a year ago), isn’t worth keeping even if it doesn’t cost an annual fee. The loss of a $12k credit line doesn’t bother me. The one feature I am considering as a plus of the A+/A cards is the PIN capability for international travel. I mostly have no issues with my preferred card (CSR), but did use the A+ a couple of times for unattended ticket vending machines last year. I was curious to see if it would accept my PIN (it did); I did not compare with the CSR at the time. I still have the Aviator Red card (with the same PIN behavior, I believe). Also on the chopping block, though, once the final 10k AA RDMs post. My ultimate fallback PIN card is a European bank issued MasterCard. Earns me nothing, but good to have for that occasional unattended gas pump. In short, if they offer me the downgrade, I might take it. Have some more European trips coming up, so I can experiment some more with other cards. But it would likely be canceled soon as part of my “simplification” project. Note to self: review USA EMV cards: Availability, Q&amp;A (Chip &amp; PIN or Signature) [2017&gt;] https://www.spotterswiki.com/emv/index.php EkekoBWI likes this.", "Likewise, only reason I app'ed for this is, of course, the bonus. $89 fee for a 2% travel credit only restricted to increments minimum 10K points threshold? No thanks.   notquiteaff likes this.", "Is it increments of 10k? I thought it was the minimum (for travel). I was actually looking for what the increment was the other day since I have some 11800 points to burn.", "You're right, it's minimum 10K.  I just didn't imagine anyone would have that much remaining after nearly a year!  By the way, not that you would want to, but you could use that to offset the annual fee.", "I'm getting deep in the weeds, but the one exception to the 10k threshold ($100 credit) correctly noted above is AF: every 2,500 miles for each $25, as I understand it. Even that doesn't answer the larger question, \"But, why keep it?\" Is it 60 days from AF hitting to be reimbursed in full when canceling or does Barclays operate by different rules?", "Only reason I can envision is unlike nqtaff one has less than 10K and didn't want it to go entirely to waste?  Far as I know, they're subjected to the consumer card act for personal cards, but I'm unsure if it's 30 or 60 days.   notquiteaff likes this.", "No interest in paying the AF in any way.  There are several NAF 2% cash back cards I could use instead if I wanted a flat rebate card.   I still have nearly 12k points because I put some estimated taxes on it, to get my remaining balance beyond the redeemable threshold.  Made some 5 bucks on it, I think (1.87% fee for tax processor) .  Silly games  Visconti likes this.", "I get it, completely. Generally, I never use Paypal but did so with my Freedom on WN flights originating from SFO (assuming it's hard to claim travel insurance from my home airport for \"reasonable expenses\" - you know, don't think that HMB Ritz idea of mine would pass the smell test) because of the rotating 5% thing. Post 2008 (even before), we've been in the golden age of sign up bonuses here in the States that will unlikely be seen again for a long time once this is over. People outside the US are now beginning to understand how great we've had it in this game for a very long time. Here's the thing. Even if we could pay for everything, why in the world would we subsidize the cheesers? Are we chumps? While I'm not willing to break any laws or Amex/Chase T&amp;Cs (the rest I couldn't care less and don't need them, ever), I have no compunction pillaging them until this golden freebie era is behind us.", "Has anyone tried getting a passport renewal fee reimbursed, probably as a manual request?  I doubt it but read one case here of success with a visa fee. Thanks.", "188", "238", "278", "282", "283", "284", "285", "286", "287", "Click here for full rules!", "I bought Universal Studios Hollywood tickets this summer -- through UndercoverTourist.com -- and it worked. A theme park itself may not code as travel, but if you go through a third-party travel agency (or possibly even through Universal's own vacation line if they allow ticket purchases without lodging through that division) it should work next time.", "I've been having an issue getting my 500 miles for completing a profile in the Barclays Travel Community. It's been over a month, and my profile there still shows 0 Community Miles, and no miles have been posted to my linked Barclays Travel+ account. I read there was a longstanding bug preventing miles from being displayed in the Community page, but they still should have been posted to my linked account after the 1st of September. When I messaged Barclays customer service, they replied:  Quote:  ...and asked for documentation that I was offered this \"promotion\". But AFAIK this is procedure is just outlined on the respective sites (barclaycardus.com and barclaycardtravel.com) shown to all users, not a targeted promotion. Anyone else have trouble getting 500 miles? Any pointers?", "No luck, but I'm having the same issue. I've had the card since 2013 and never bothered to sign up for the travel community. Now, I'm hoping to receive the 500 bonus miles in order to hit the minimum redemption threshold more quickly (only use the card for my spotify subscription). I find it strange the CSR says it is a targeted offer; the terms read as if the opportunity to earn bonus points via the travel community is a feature of the card. Hope you can get them to grant you those points.", "Here's what I got today: Quote:", "Awesome, I'll try that route. Thanks!", "Barclays Arrival cards - gone for good?    With AF coming up in the next billing cycle, I thought I'd downgrade my Arrival+ to no AF Arrival. But that card is nowhere to be found on the Barclays web site, nor do I see any recent mention of a similar downgrade here. Can someone confirm if Barclays Arrival cards are now history? If so, any other options for keeping the points w/o the AF?", "What did they say when you called the number on the back of the card and asked about this?", "My A+ card is about to post the annual fee, and I\u0092ll be calling about an AF waiver.  But if they don\u0092t offer one, I will simply apply my accumulated points to some travel expenses I have built up and call it a day, i.e., cancel the card. It\u0092s not one I am emotionally attached to,  There will be a few leftover points, but it doesn\u0092t seem worth worrying about those.", "I haven't called yet, will do after the holidays. I fully expect to be offered no options and will apply the remaining points to some travel expenses I had in the last 120 days, and then close the card.", "Rumor has it that they're only going to do cobranded cards from here on out. The fact that those appear to be all of the ones on their website seems to bear that out, but it's possible you can still downgrade to the no-AF version. Guess one will need to call in to confirm either way.", "My no-AF Arrival still works. I got an Aviator Red around August 2018 and was unable to PC after the second year's AF hit (admittedly, I only called once to inquire). So PCs are not guaranteed even for card families with more life in them.", "With my AF hitting in Jan, looks like canceling is best option now that's there's no AF-free Barclays option. Anyone get the AF waived / credited?", "I hope not. I believe in April 2018 they anticipated all products to feature the new Barclays branding by 2020. Perhaps they will relaunch all of the Barclaycard products as Barclays next year. In March of last year someone spotted new card art for Arrival @ https://www.doctorofcredit.com/new-b...-arrival-card/", "So I just called A+ number on the back of the card and was told that this card is now invitation only. Also, there are no downgrades, upgrades, or product changes. If you have this card, you either pay the AF, or cancel. I only talked to one CSR. Would be interested to see if anyone else has other input.  I did ask if I could product change to the Premier, and was told no.", "Or use the travel credit against the AF.", "187", "237", "277", "281", "282", "283", "284", "285", "286", "288"], "American Express Business Platinum $200 airline credit issue": ["Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Too late I already did it. This actually was for my gf and I only could convince her to try again now.", "If keeping the same Airline, I shouldnt have to re-select right?", "For those with $200 in credit, there are mid-week one-ways from OAK to LAX going for $69 in late January. That's just about perfect ($69 x 3 = $207). I'm going to grab 9 of those tomorrow on our 3 Plat accounts.   Soccerjoshj07 likes this.", "For those with several $ credit left and want to book a flight with lowest price. the lowest one I can find is SAN to SJC, $49.", "Please report back. Wanting to do similar.", "12/29: Bought 4 one way tickets under $100  12/30: Transactions posted 12/31: Under Benefits section, it says \"You have used all of your $250 Airline Fee Credit for this year.It will renew again starting Jan 2020\" Waiting for credits to actually post. Which I'm assuming will be the next business day.. Was able to use the remaining credits for 2019 and will get a new set of credits for 2020...", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/amer...west-only.html I am not a WN flyer. I did not copy the Wikipost to the new thread. If the existing Wikipost still contains relevant information please send a PM, and I will copy it. Otherwise, please create a new Wikipost in the 2020 thread.", "82", "132", "172", "176", "177", "178", "179", "180", "181", "183", "184", "185", "186", "187", "188", "Click here for full rules!", "Planning to buy SW tickets today, hopefull the charge posts as 2019. Does anyone think it would be risky?", "of course its risky but people have had success and you dont have a choice now. YMMV. obviously youre cutting it too close, but during the GC method, 12/31 worked even when post date was in the next year. just keep an eye on it.", "I bought 2 flights less than $100 each on Dec. 30. Meter hasn't moved and charges are still showing pending. Will update what happens next year. Try checking the Dec. 2018 DP's in this thread (at that time it was still possible to get e-GC's). I think I saw it did work for purchases on 12/31 but it is still a risk. For me I'm trying to do a triple dip so the risk is worth it because if it doesn't work and I only get credit for 2020, then it will be just a double dip.", "im concerned WN will definitely notice and say something in 2020. im sure of it. having amex reject GC for credit is one thing, but having a huge community buying WN flights then canceling may trigger some type of alarm. especially when they notice a large uptick in 2020 for short sub-$100 flights being canceled. this is how TCs always get changed to curb exploits and reduce admin burden. WN may introduce fees of some type. anyone here going to buy thousands of $ for WN flights in 2020?", "I'm guessing WN is fine with the quick cancellation of flights and having the refund as a Travel Fund. They get paid the full amount, minus credit card fees. Sure, there's a very minor burden on their reservation systems, but worth the extra revenue. It's Amex that might decide to clamp down. Amex is better off if the airline statement credit goes unused. They might demand that WN code all ticket purchases -- even those under $100 -- as such, so that Amex doesn't credit any of them. It's hard to know on the outside how burdensome this would be on WN, and whether there's enough money involved to justify the effort. As many have observed on FlyerTalk, we are far from the norm among the traveling public. Only a tiny portion would ever go to the trouble of learning this end-around and exploiting it. Amex might figure that it's not worth it to play another cat-and-mouse game with the likes of us. Pretty good chance we'll just find another loophole. Besides, a lot of us are actually very profitable cardholders for Amex.   krazykanuck and IndyHoosier like this.", "nobody should think amex will just sit back and ignore this obvious loophole. they patched the GC method for a reason. they didnt like it and this loophole is even easier to stop. we are buying actual flights with L3 data. it wouldnt be that hard to ID and cut or clawback. and while i agree this community is a minority vs the entire cardmember base, we cost companies money. hence the war on churners the past few years to close loopholes and shut accounts down. its a very deliberate effort by amex/chase etc. im not so sure i want to begin 2020 with thousands of dollars worth of cancelled WN flights. im hesitant. not to mention i have 12 months to use the TF. i really need to figure some other long term option.", "On balance, Amex makes money on my business. Yes, I've exploited several bonus point offers, and I've always maxed out the airline statement credit. Still, the merchant fees it gets from my business are greater than the cost of the benefits Amex gives me. I'm not one of the most profitable customers for Amex, but they make money on me. I suspect there are more of me in this forum than there are the true churners who are unprofitable for Amex.", "Making WN purchases on the 1st or should atleast wait until Jan. 2nd? Ant difference?", "I agree it's AmEx that may do the clamping down. I don't see any downside for WN. They will not only get a windfall from breakage (expired TTFs), but will also benefit from pax who accidentally contaminate fresh money with old TTFs.", "AMEX will keep driving themselves toward extinction if they continue to close \"loopholes\" that benefit their customers.  The only reason I even bother with them is for the airline credits and Hilton Aspire resort credit (which I use entirely for advanced purchases which apparently AMEX doesn't like either).  Everything that is good for me is something AMEX doesn't like.", "When I looked at Jan. 2019 DP's in this thread (times were different as those were e-GC's) some said their purchases on Jan. 1st took longer than usual to post like 6 days.", "I would just select airlines on the 1st and then make transactions on the 2nd.  No need to risk it right?", "Well I went for it so lets see, fingers crossed", "Who has bought a SW ticket for less than $100 and then canceled within 24 hours effectively getting refunded back to you credit card rather than refunding back to southwest? If so does it matter if I cancel the ticket right after booking or should I wait until tomorrow January 2020 before the 24-hour window expires. I already tried buying a $97 SW on Dec 12 and never got refunded so I cancelled that and got the SW credit in my account but I don't want to another credit. I'm down to the last 3.5 hours...", "I wouldn't bother at this point.  Not sure why you waited until the last 3.5 hours.", "81", "131", "171", "175", "176", "177", "178", "179", "180", "182", "183", "184", "185", "186", "187", "Click here for full rules!", "Thank you. Looks like I got this wrong then. I was under the impression that award flight taxes are valid and will be reimbursed. I lost $250 credit for 2019 with Amex Honors card. Bummer!!", "I didn't see the credit yet for the tickets purchased in November. If I do see the credits then that will be counted in 2020, isn't it?", "We need more information, you haven't provided enough data. 1) When did you select WN as your airline? 2) When did you make the award purchases? 3) How much were the taxes on the flight?", "2 award tickets, $113 each. Is there anything I can do before Dec 31st?", "Ah well that's it.  $113 is over the limit of $100.", "Yes, I saw that in wiki...just didn't get it in time! Tough luck!  So buying a revenue ticket or an award ticket but taxes, both &lt; $100 is what will work. Will check it out in 2020 then....", "Well still no credit. Fwiw, I did select my airline then purchase on the same day, but after receiving the confirmation email. Did the same thing earlier in the year with BizPlat with no issues. PSA: wait a day before making a purchase I guess.", "Don't know if it's too late, but you could cancel and rebook those tickets as one ways on separate reservations if they are still available for the same amount of points.  (When you cancel a reward booking, the fees can go back to the card) Or you could just book random tickets now with $, cancel and rebook within a year for tickets you really need. Caveat, have no idea if either will work on the last day of the year (ie since purchase will post on 1/1).", "Yeah, I'm always afraid to give advice once you get to this point in the year as I'm not sure of the exact mechanics behind it.", "12/26 purchased one ticket + one tax of point ticket, total 85 12/27 posted 12/29 Meter moved 12/30 credit", "website or app    Does it matter if flight purchase less than $100 made on website or the southwest app? Guidance on this would be appreciated as I have purchased a flight using the southwest app and only realized now to check if it matters or not... ?", "Update: Looks like the first EBCI purchase did not trigger the reimbursement.   I made that about 15 minutes after selecting WN as my airline and the others about 30 minutes later.  Guess I could call but probably not worth it since they might see the ticket purchases which were reimbursed.", "Hi All - just wanted to provide a quick data point. 12/27 - Applied for and received approval for AMEX Hilton Aspire and saved my instant card number. 12/27, 5 minutes after approval - Chatted with an AMEX rep to make Southwest my airline choice. 12/27, 15 minutes after chatting - Received e-mail confirming Southwest as my airline choice. 12/27, 15 minutes after receiving e-mail - Booked 3 separate one-way 'dummy' flights for $93.98 on Southwest's website, logged into my rapid rewards account..  I planned on waiting until after the 24 hour period to cancel the flights since we'll use Southwest credit sometime in 2020 anyway. 12/30 - AMEX credits post for $93.98, $93.98 and $62.04.  No 'meter' movement prior to credits posting.  Card is showing $31.94 balance.   IndyHoosier likes this.", "Thanks! Here's the timeline: 12/26: Called in and asked to switch airlines. Initially told that I had to wait until January, but with a little cajoling they went ahead with it. Change was reflected online that day. 12/27: Bought 3 SW flights ~$92, $92, $66 12/28: Flights posted 12/30: Meter reflected total usage of airline credit 12/31: Credits refunded back on the statement ^", "I plan to change my plat airline to WN in January. To use the $200 credit, does it have to be 2x &lt;$100 or can it be, say, $198 or $210?   Also, if using for Anytime fares and canceling for WN credit rather than cc credit, are funds restricted to original ticket holder or is that only the case with Wanna Get Away fares?", "80", "130", "170", "174", "175", "176", "177", "178", "179", "181", "182", "183", "184", "185", "186", "190"], "Questions - United Explorer card": ["Click here for full rules!", "I just checked an upcoming award reservation and I was wondering why only 1 of the 2 1Ks on the ticket are request for a CPU.", "I would assume because there's only one primary Chase cardholder.", "Oh! Thanks, I guess it's her as I don't carry any Chase cards", "Did the PlusPoints migration screw up the award ticket CPU-eligibility? All my award tickets used to say CPU requested but now there's nothing there, not even the \"Waitlist\" text.", "question: does award upgrade eligibility apply to a GM companion cardholder? Basically  If I book domestic award for me+1 as 1k and get upgraded, would companion on same tix be eligible for upgrade if they are a cardholder themselves?", "Companions are not eligible and to be eligible for the award upgrade benefit you need to be an elite Quote: k_den likes this.", "United System / Award Travel / CPU    Had a very interesting experience this last week on a couple of UA flights, and curious to know if this is normal, or others have experienced it. For some background I am MP Platinum and have a united CC.  Heres the situation: booked a coupled of award tickets, one for me, one for my companion.  This is on the way out: Usually when I check in it gives me the option to split the itinerary in order for me to get put on the upgrade list, this option was not given to me when I checked in. The flight was on Christmas and had 12 empty first class seats (also an overnighter), I did not show up on the upgrade list. I asked the gate agent if I could get put on, I was denied, because the itinerary was not split, GA could not split it. Called customer service, she split the itinerary, but alas, I was never put on the upgrade list, but at least I had a whole row to myself! But, considering I am Plat and have a CC, I should be eligible for a CPU on an award ticket... Contacted customer service, they said there is a system issue, they compensated me On the way back: Customer service suggested I speak to someone to get put on the list, so I went to customer service in SFO, and I was on the list for my flight. Another situation where there were 6 open FC seats, I was #1  on the list. But even though number one on the list I was cleared last, I know award ticket CPU is probably low on the upgrade priority list, but everyone upgraded ahead of me were employees/employee family members on standby. I am all for appreciating your employees, but seems a bit strange for standby non-rev to get cleared ahead of status customers that are non-rev, considering they had to spend money to get status in the first place... Anyway, just thought I would share my experience, felt a bit like the twilight zone, I can tell you one thing, I certainly didnt feel like an appreciated customer on this trip.", "24", "28", "29", "30", "31", "32", "33"], "Spending $4500 in 1 week.": ["Click here for full rules!", "large purchase coming up, best way to capitalize?    Hi all, I'm hurting my brain trying to figure out the best way to do this. I have a large cash purchase coming up (vicinity of $47,000), and I'm trying to gain as much out of this as I can...if it's possible. I'm open to getting a new card, but it has to be pretty soon as I'm making the purchase on 10/1.  I currently fly only Delta (platinum medallion), and stay at Marriott family hotels. Current credit cards:  US Bank Altitude Reserve, Delta Reserve Amex (my main card, so I can hit the 30/60K boosts and I've already hit the 60K one this year), Marriott Bonvoy Brilliant and a random Amex card I never use (blue?) I've been looking at services like Plastiq or something as simple as Paypal since Venmo has a cap on purchases. What are you best recommendations for making something like this worth it, rather than just writing a check. Thanks!", "If the recipient only accepts cash and you\u0092re looking to services like Plastiq to pay with a card anyway, there\u0092s almost no way to get it to make sense given the fees involved. The sole exception is if you hit a bonus threshold.", "Best Credit Card For Large Yearly Spends    I started a small business last year and had terrible credit at the time. It has, over the course of the last year, grown into a mid-size business. I paid for everything up front this year using debit cards and spent almost 1 million on advertising, 100-150k on travel expenses (all flights on delta), and another 500k on other items that could have been paid for on credit cards. In total I spent just under 2 mil this year that could have been put on credit cards. My business is in the black and we have no loans or debt of any kind. My credit score has improved drastically, but I am only at 690 with Experian. I expect my business spend to increase by about 20% next year and we will continue to run in the black the entire year. I'd like to actually put the spend to use somehow, but I have no idea how best to do that.", "Welcome to FT, shummer79! And, congratulations on your successful business! The first step in your credit card decision is to articulate your goals. Would you like to save money in order to reinvest back into your young business (that would definately be my recommendation at this point in your business lifecycle)? If so, finding a 2% cash back card would help with that objective. Here is one option:  https://www.fidelity.com/cash-manage...signature-card Good luck to you.", "I spend about 1 million a year on credit cards for business.  Does anyone know of any domestic airline card that gives \"top tier\" status for spend alone on their branded cards?    DL waives the spend requirement after one spends 250k/year on their card but I believe they still require a certain amount of flights.  United caps spend only at either Gold or Platinum and not 1K.   I was hoping by spending so much on one airline card I could get top elite status with that airline.   Many thanks.", "Well if you split the $1m between Delta cards that earn MQM, you may be able to.  I guess 60K MQM from the Reserve, then another 20K MQM from the Delta Platinum, which brings you to Diamond MQD waived + 80K MQM, so you'd reach Platinum.  Diamond would still be a bit away though... Don't forget about Jetblue Mosaic after $50K on their card, also Silver on Virgin Atlantic is attainable after via their card.", "The only card gives you outright status is JetBlue.  But it has a smaller footprint. DL is a possibility.  If you fly it often.", "Best Card for a large purchase - Plat Amex or Chase Sapphire Reserve    Hi.  Making a large purchase ($25k) and not sure which card will net me the best mileage option, Amex Platinum or Chase Sapphire Reserve.  All advice welcome.", "I would say all things being equal pick the one that you find is harder to earn points on. I find it alot harder to earn UR so I would probably pick Chase.", "Whichever one you go with, suggest that you call the applicable card issuer and alert them to your planned large purchase.", "If you typically transfer your points, keep in mind that Amex offers transfer bonuses whereas Chase does not.", "Back looking at my next option(s) Recent Cards- CSR(opened 9/22/19) CIP(opened 12/30/19) minimum spend meet on those(HVAC and Appliances ) Up next is windows and siding- enough to meet one, if not two minimum spends(likely with just Down payment(s) other cards held- all opened well over 5 years ago Amex Gold- Business AAdvantage Aviator-personal Chase Mileage Plus-Personal Chase Presidential Plus-Personal Wife has Amex Delta Plat Was thinking of using her referral link and applying for Delta Plat Amex as well New job has me covering more of the southeast US, so UA and I are more just friends now looks like a 75K bonus is about the best I can do- with 3k spend Not sure the reserve would work that well for me with it's AF and overlap other options/suggestions welcome Thanks \\\\//\\\\// ETA: Shoulda waited to apply(got approved)- offer is now 100K miles, granted fee is higher-now $250 say AMEX notice about offer I got was expiring 1/29. Figured they's drop back to standard 30K stuff for a while- guess it's time to call and see if maybe bump me up", "Need Advice for Extremely High Credit Card Spender    Looking for advice: My friend is a ticket broker. He spends upwards of 250K per month on credit cards. He has about 150K in credit. 770 Fico. and is over 5/24. His utilization is extremely high and he pays down cards multiple x per week because he maxes out on his total credit limit. He wants to expand his business and needs more credit. Looking for your help on a strategy for him. He's been rejected from all CapOne. Rejected for limit increases on current cards. He also has a day job where his comp is 100K+ He currently has: AX Plat Citi AA Citi Premier Chase Freedom Chase Sapphire Chase IHG - all of these are personal cards BofA Premium Rewards Alliant Signature WF Biz Plat and a few others.... He does have an LLC but no business cards.", "If the lower FICO is due to the high closing balances on his personal cards he should try opening business cards issued by American Express or Citi and shift spending away from personal to business cards because the balances are not reported. However, he needs to understand that Business cards are opened in the name of the individual, not the company, and when he applies for a business card his personal credit report will be the major consideration.  American Express charge cards do not have formal credit limits, but it practice there will be a cap on the transactions American Express will approve, based on what they know about his financial resources. A Platinum card will not have any higher spending capacity than a Green card.", "21", "25", "26", "27", "28", "29", "30"], "AA Barclays Aviator Sign-up Bonus Question": ["Click here for full rules!", "Finally got approved again! Had to move some credit over from an existing Jetblue card though but no biggie. I don't remember exactly when but here's a rough timeline. I applied for the US Airways card a couple months before the switch to aviator red (don't even remember the month and year I applied). The switch happened to a world mastercard. Then barclaycard sent me a letter saying it would be switched to a world elite mastercard. I think 6 months after, I applied for another aviator red while the US Airways/Aviator Red was still active. The credit analyst I spoke to said that since the product name of the first one was different from the one I applied for, it would be approved.  Both of those aviator reds were closed last year. I've been trying to get approved for at least a year. Applied this morning with an AA offer (offer was the same as the public one) and got that 10 day message. Checked app status and it showed declined. Called a credit analyst at barclaycard and somewhere in his talk, he said that he could pull my credit and see what he could do. One of the things he asked me was if I was willing to move some credit from my Jetblue card to open the new one. That was the quickest yes I've ever said in my life lol.", "If anyone knows if there are any special promos for opening this card for January 2020 please post. Curious whats advertised in the on board magazine this month. To answer my own question looks like ad is the same deal as December Page 39 has ad http://americanway.ink-live.com/html...d-a945e5687ccc", "New (first time) cardholder application denial question    Hoping I put this in the right place? Helping a friend who has never had a credit card or a mortgage - but has plenty of resources - owns 6 houses, manages then as rentals, makes ~96K/year. Has tax returns current all that jazz. I tried to help him get started on a mileage program as he has been using his debit card only for decades. His credit score according to Karma is 750. He has plenty in a couple bank accounts and investments with Schwab of 300K or more. He's 72, but not very computer or credit savvy cuz he's always used cash or his debit. He did get a Nissan Auto Loan (first in his lifetime) for $34K about 4-5 months ago. Because I have 2 Barclays - I helped him fill out the Barclay 60K bonus card app (personal). In about a week he got a denial cuz he has zero credit history. (Including nothing negative) - only 1 hard pull from this application showing. Is this one where we should call in and plead his case with a human? Or is there a better solution? There's still Citi - because we're shooting for AA miles for OneWorld Travel.. Thank you in advance.....", "What your friend could do is try calling Barclaycard's backdoor number. The call essentially goes straight to a credit analyst. They're the ones that can potentially change the denial to an approval. I called them a month ago after applying for the Aviator Red and seeing a denial not too soon after. After a bit of talking, the credit analyst allowed me to move credit over from an existing account to open this one. So you never know. Check your messages..   bloomz likes this.", "I still have an Aviator Red with the 10k annual miles bonus. At one point I had three Reds, but slimmed down to just one.  I've had it at least five years but hardly put spend on it.  What are my odds of getting the 60k bonus on a new app ?  I could use a refresh of my AA balances after some recent redemptions.  Not many avenues open to me at this point. I have months to wait before I can apply for anymore Citi AA cards.  I'm thinking of trying to pick up one each of the Aviator personal and biz in the meantime. Recent data points seem inconclusive, and not seeing many where people applied while still holding an active personal card.  Any perspectives ?", "I've had the US Airways card later converted to the Aviator Red (applied not too soon before new applications were shut off) and another Aviator Red a couple months after that. I closed the first and second one some time before the second acct's 1st anniversary (I don't even remember the rough dates). Ever since then, I've been trying to get another approved with no luck. I applied last month and got that \"we need more time\" message. Went to status check and said declined. Called them and the guy on the phone mentioned why so many apps and other things. After I said Yes to moving credit around, he finally approved me. By my rough estimates, it took two years to get approved again. But then again maybe it's because I kept applying every few months. At least the denial letters I got stated that no credit report was pulled.", "Congrats. Even back in the day when Barclays was not so sensitive to number of apps with other banks ( as today); they were sensitive to  how fast you reapply after a denial, it was around 6-12 months depended on the person's profile.", "It's still possible, I also opened a new one less than 12 months after closing the prior. I also had to call in and chat them up. I think it helped that I had a different Barclays product on which I charged over $25K during the prior 12 month period.  Was also above the 6 or 7/24 threshold.", "I previously had a Citi Platinum Select World Elite MC and converted it three years ago to a Bronze World MC to avoid the AF. Am I eligible for this offer. If so, will bonus miles be applied to my existing AA account?", "Neither Barclay nor Citi care whether/when you have/had an AA card from the other, per se. That other card just gets considered along with all the others you have for total credit, number of applications, and the like. And, yes, points earned on both will go into the same AA account if you give the same one to both of them.", "Has anyone tried to add an authorized user on the website lately?  The online form seems to be missing the place to enter the authorized user's SSN (I haven't done this in a couple years but it was definitely there like 1.5 year ago).  Without attaching SSN info, the AU can't really build credit history by being my AU, right?", "I added a friend as an authorized user on my Aviator business acct to get the 10k bonus miles and it didn't ask for ssn. Not sure about personal version though.", "6", "56", "96", "100", "101", "102", "103", "104", "105"], "When should I open my second and third Chase (trifecta) card?": ["Click here for full rules!", "I assume you mean 12/6/19.  If that is the correct date there's no need to wait.  I'd also suggest you look at the wikipost at the top of the page for more good info.", "Oops yeah I meant 12-6-19.  Application date was stuck in my head when typing that.  I read the wiki and other bloggers who mentioned that it might be \"safer\" to apply the next month?", "I'm surprised you even asked the question considering that \"next month\" is &lt; 4 days away.", "Would like some advice on the next best cards to open next. Already have a CSP, and am likely at 4 or 5/24 (how can I tell for sure). I do have a real business with an EIN number if that helps.  P2 has a CS (downgraded CSP) and IHG, but is likely only at 2 or 3/24.  Thanks in advance.", "Look at your current credit report and count the credit cards (both currently open and since closed) that were opened in the last 24 months. It's the only reliably accurate method.", "Thats what I thought but was hoping I could see it in one of the free services like CK or even the credit card programs.", "The data is available on Credit Karma. Click on Dashboard and then click on TU or EQ. Scroll down and you'll see \"Credit Report\"  The opening date is found after clicking on each card.", "Thank you.  Very Helpful! So it looks like I'm 4/24 and my wife is 1/24.  So CIP for both of us? (Can we each open an biz card?) That would put me at 5/24, so what's next for my wife?", "Obtaining a Chase business card does not add to the numerator of your x/24 count. If you are at 4/24 and are subsequently approved for a CIP, you would remain at 4/24.", "Those are fine, just make sure it's a current (recent) report.", "Thats good to hear. So what\u0092s the best order to apply? CIP, CIC, UMP?", "Get CIP first; after approval, refer CIP to spouse.   If you feel adventurous, in about 3 months, have spouse refer you for another CIP (this time, apply with EIN).  I can't guarantee how Chase will feel about this but there have been many (past) data points of folks getting multiple CIPs.", "What should he apply with the first time if not  using an  EIN?", "SS# Quote: Why the 3 month wait? Also, should I look into the United Explorer or MileagePlus cards? Planing on converting UR to United likely anyway.", "Moderator action    Discussion continues here: Applying for Chase Credit Cards", "102", "152", "192", "196", "197", "198", "199", "200", "201"], "New card advice for a big purchase": ["Click here for full rules!", "large purchase coming up, best way to capitalize?    Hi all, I'm hurting my brain trying to figure out the best way to do this. I have a large cash purchase coming up (vicinity of $47,000), and I'm trying to gain as much out of this as I can...if it's possible. I'm open to getting a new card, but it has to be pretty soon as I'm making the purchase on 10/1.  I currently fly only Delta (platinum medallion), and stay at Marriott family hotels. Current credit cards:  US Bank Altitude Reserve, Delta Reserve Amex (my main card, so I can hit the 30/60K boosts and I've already hit the 60K one this year), Marriott Bonvoy Brilliant and a random Amex card I never use (blue?) I've been looking at services like Plastiq or something as simple as Paypal since Venmo has a cap on purchases. What are you best recommendations for making something like this worth it, rather than just writing a check. Thanks!", "If the recipient only accepts cash and you\u0092re looking to services like Plastiq to pay with a card anyway, there\u0092s almost no way to get it to make sense given the fees involved. The sole exception is if you hit a bonus threshold.", "Best Credit Card For Large Yearly Spends    I started a small business last year and had terrible credit at the time. It has, over the course of the last year, grown into a mid-size business. I paid for everything up front this year using debit cards and spent almost 1 million on advertising, 100-150k on travel expenses (all flights on delta), and another 500k on other items that could have been paid for on credit cards. In total I spent just under 2 mil this year that could have been put on credit cards. My business is in the black and we have no loans or debt of any kind. My credit score has improved drastically, but I am only at 690 with Experian. I expect my business spend to increase by about 20% next year and we will continue to run in the black the entire year. I'd like to actually put the spend to use somehow, but I have no idea how best to do that.", "Welcome to FT, shummer79! And, congratulations on your successful business! The first step in your credit card decision is to articulate your goals. Would you like to save money in order to reinvest back into your young business (that would definately be my recommendation at this point in your business lifecycle)? If so, finding a 2% cash back card would help with that objective. Here is one option:  https://www.fidelity.com/cash-manage...signature-card Good luck to you.", "I spend about 1 million a year on credit cards for business.  Does anyone know of any domestic airline card that gives \"top tier\" status for spend alone on their branded cards?    DL waives the spend requirement after one spends 250k/year on their card but I believe they still require a certain amount of flights.  United caps spend only at either Gold or Platinum and not 1K.   I was hoping by spending so much on one airline card I could get top elite status with that airline.   Many thanks.", "Well if you split the $1m between Delta cards that earn MQM, you may be able to.  I guess 60K MQM from the Reserve, then another 20K MQM from the Delta Platinum, which brings you to Diamond MQD waived + 80K MQM, so you'd reach Platinum.  Diamond would still be a bit away though... Don't forget about Jetblue Mosaic after $50K on their card, also Silver on Virgin Atlantic is attainable after via their card.", "The only card gives you outright status is JetBlue.  But it has a smaller footprint. DL is a possibility.  If you fly it often.", "Best Card for a large purchase - Plat Amex or Chase Sapphire Reserve    Hi.  Making a large purchase ($25k) and not sure which card will net me the best mileage option, Amex Platinum or Chase Sapphire Reserve.  All advice welcome.", "I would say all things being equal pick the one that you find is harder to earn points on. I find it alot harder to earn UR so I would probably pick Chase.", "Whichever one you go with, suggest that you call the applicable card issuer and alert them to your planned large purchase.", "If you typically transfer your points, keep in mind that Amex offers transfer bonuses whereas Chase does not.", "Back looking at my next option(s) Recent Cards- CSR(opened 9/22/19) CIP(opened 12/30/19) minimum spend meet on those(HVAC and Appliances ) Up next is windows and siding- enough to meet one, if not two minimum spends(likely with just Down payment(s) other cards held- all opened well over 5 years ago Amex Gold- Business AAdvantage Aviator-personal Chase Mileage Plus-Personal Chase Presidential Plus-Personal Wife has Amex Delta Plat Was thinking of using her referral link and applying for Delta Plat Amex as well New job has me covering more of the southeast US, so UA and I are more just friends now looks like a 75K bonus is about the best I can do- with 3k spend Not sure the reserve would work that well for me with it's AF and overlap other options/suggestions welcome Thanks \\\\//\\\\// ETA: Shoulda waited to apply(got approved)- offer is now 100K miles, granted fee is higher-now $250 say AMEX notice about offer I got was expiring 1/29. Figured they's drop back to standard 30K stuff for a while- guess it's time to call and see if maybe bump me up", "Need Advice for Extremely High Credit Card Spender    Looking for advice: My friend is a ticket broker. He spends upwards of 250K per month on credit cards. He has about 150K in credit. 770 Fico. and is over 5/24. His utilization is extremely high and he pays down cards multiple x per week because he maxes out on his total credit limit. He wants to expand his business and needs more credit. Looking for your help on a strategy for him. He's been rejected from all CapOne. Rejected for limit increases on current cards. He also has a day job where his comp is 100K+ He currently has: AX Plat Citi AA Citi Premier Chase Freedom Chase Sapphire Chase IHG - all of these are personal cards BofA Premium Rewards Alliant Signature WF Biz Plat and a few others.... He does have an LLC but no business cards.", "If the lower FICO is due to the high closing balances on his personal cards he should try opening business cards issued by American Express or Citi and shift spending away from personal to business cards because the balances are not reported. However, he needs to understand that Business cards are opened in the name of the individual, not the company, and when he applies for a business card his personal credit report will be the major consideration.  American Express charge cards do not have formal credit limits, but it practice there will be a cap on the transactions American Express will approve, based on what they know about his financial resources. A Platinum card will not have any higher spending capacity than a Green card.", "21", "25", "26", "27", "28", "29", "30"], "Chase United Explorer Public 50K Live again!": ["Click here for full rules!", "*** Above i noted..that Chase Explorer Support Manager disputed the fact that I signed up for the $250 statement promo credit at all.. he said i signed up for a differnt promo.one that does Not include statement credits..only miles for purchases. so.. \"waiting 6 to 8 weeks\" is immaterial to the issue of the BAIT N SWITCH trick to get people to click a false offer. CHASE IS DECEPTIVE advertising on United Website. I hold both accountable for FRAUD", "Customer service agents and managers at all mass market companies often invent explanations when they do not know what's happening. Have you looked at the thread linked in Troopers reply?", "Interesting offer from Chase today for my Explorer Card: Offer period Feb 1-Mar 31 Spend $600 during the offer period and get an additional 2,200 miles, then an additional 1 bonus mile per dollar up to $9k in spend.  Going to do the first $600 as  that comes to 4.66 or 5.66 miles per dollar spent after factoring 1 or 2 miles per dollar normal earning rate.  Then I will switch back to my CSR and Freedom Unlimited Combo, as I would rather have UR points instead of UA miles. I will note I only use my UA card for UA purchases (tickets and on board), so not sure how targeted this offer is", "I got a slightly different one (though yours is better) 6100 bonus miles for $3500 in spend; 1 bonus mile / $ after that up to 12k total bonus miles. So assuming I spend $3500 or more, that's 2.74 total miles / $ in the first $3500 2 total miles / $ on the next $5900 I'll probably throw some otherwise unbonused spend on it to hit the $3500 threshhold. 2 miles/$ after that doesn't really excite me... UA miles just aren't all that valuable.", "where are you finding these offers, on the web, app or elsewhere??  Thanks.", "Email.  Targeted (since everyone has different offers) The landing page is here:  https://promotions.united.com/offers...tionmilesoffer", "Nice. Thanks for the link. I got the following: Quote: Haven't used the card since October...", "My offer: Tier 1 Spend at least $6,700 on purchases and earn 3,300 additional miles. (or) Tier 2 Spend at least $7,200 on purchases and earn 4,200 additional miles. (or) Tier 3 Spend at least $8,100 on purchases and earn 6,300 additional miles. Not enough to lure me in.", "thanks, no offer here", "\"Here's your personalized opportunity to maximize your bonus miles between February 1 and March 31, 20201.Your offer goal: Spend at least $600 on purchases and earn 2,000 bonus miles.After you spend $600 in total (your offer goal), you'll continue to earn 1 additional mile per $1 spent (up to 9,000 bonus miles).\" For those looking to game this, the footnote says \"Register in the month of February and your purchases will count toward your total spending from February 1 to March 31, 2020. Register in the month of March and your purchases will count toward your total spending from March 1 to March 31, 2020. All registration and spending deadlines are 11:59 p.m. CT on the last day of the month.\"", "Same here: Quote: On the other hand, I received this promotion several days ago: Quote:", "My offer: Quote: Yeaaaaaah, no.   beltway likes this.", "16", "56", "60", "61", "62", "63", "64", "65", "Click here for full rules!", "which card is this and can I product switch to this from a Chase MileagePlan CC?", "It's the old Chase MileagePlus (non-Explorer) card, with no AF and weak earning (1 mile/$2 in spend).  They certainly still exist; my DW has one, which she downgraded to from an Explorer card a few years back, even after the no-fee card had stopped being something you could sign up for directly. The wiki for the current Chase downgrade thread and its predecessor  both mention this as a possible downgrade option, although I don't recall seeing any recent data points, so the info may be stale.", "I have downgraded two cards to both the Mileage Plus and Travel Bank no fee versions in mid 2019.   beltway likes this.", "Is the no-fee MileagePlus card just for keeping the credit line open, or does that also have the increased award availability, BG2 boarding, etc.?", "My wife applied for a CIP Biz card and got the \"We have received your request for a Chase credit card. We'll let you know our decision as soon as possible.\" note. With the 65K offer ending on Wednesday, is it OK for her to apply for this card now or do I need to wait on a decision on the CIP card?  I'd apply myself, but I'm at 6/24.  She's at 3 or 4/24.", "I sill have increased award availability. I downgraded to this card in case I ever need to upgrade back to the Explorer card while being over 5/24. Quote: Applying for another Chase card prior to the CIP being approved could put that application at risk.   beltway likes this.", "OK.    Thanks.  Wish I had seen the end date for the offer before going for the CIP.  Oh well, guess I'll have to wait and maybe go for the CIU in a month or so.", "Can anyone else confirm this?  That's half the reason I keep the MPE card.", "Theres a no fee UA card?", "Yes: https://www.chase.com/personal/credi...k/earn-rewards There is also a free card that is not open for applications, but might still be open for downgrades.", "I want to apply for the new United MPE offer that came out today 60K for $3K spend.  I just looked and received my last bonus on the MPE on 1/16/18, so its been 24 months, barely.  I still have that account open, however, I downgraded it to the free version of the card a year ago.  Am I good to apply for this one?", "Any ideas on how to generate a referral link for the current 60k SUB with $3k spend?  My referral link points to 40k SUB with $2k spend.", "Did the business version of the Explorer card go away?  All I see now is the New \"Business\" card.", "Wont Honor $250 Statement Credit Promo    1/12/20 Signed up for United Explorer Chase Visa while on the United Airlines site shopping for flights. Link said $250 statement credit within 6-8 wks after 1st purchase. Got the card no Info about $250?? Called Chase Got manager and big RUNAROUND excuse saying yes there is such an offer but you didnt get that one.. I said I have screenshot.. They did not care..just kept telling me about offer i supposedly signed up for. CAN YOU SPELL BAIT N SWITCH!!  Im so angry with Chase being a liar about this ... how could I possibly know about an offer much less have screenshot of it. .I needed to book the flight I had paid for a fair lock while waiting for the card to arrive.. The Manager DANIEL (no name) stated hed have a higher manager call me within 72 hrs..No Calls, No msgs. Chase You Are A Liar!!  Beware People..", "Welcome to FT. I suggest you wait the 6-8 wks after your first purchase before contacting Chase.  It's been 2+ wks since you signed up on 1/12.  Assuming you meet the TC, the credit should appear by the second statement. Also, see this thread: Chase refuses to honor Explorer Mileage Plus offer for $250 statement credit.", "15", "55", "59", "60", "61", "62", "63", "64", "66", "Click here for full rules!", "offer is once every 2 years, so yes, sounds like it. FYI the current offer is 40k for 2k spend during first 3 months + 25k bonus for 10k spend in first 6 months. So $1667/mo for the first 6 months gets you 65k miles.", "Hi, anyone know if you get a free bag on a Lufthansa codeshare flight booked on United.com?", "The T&amp;Cs literally say: Eligible Cardmembers will receive their applicable standard checked bag free on flights operated by United or United Express; codeshare flights are not eligible. Check out this thread for more info: Mileage Plus Branded Credit Card and Checked Baggage Fees", "Bueno, merci.", "Quote: Any other recent experiences to share? My birthday is about 10 days before the annual fee is due (it's been billed, and closing date is bday+10).  If I apply for GE should I expect to see the reimbursement before I close my account (I assume they won't reimburse once account is closed)? If I won't get reimbursement I'll open another card and then apply later . . . I have 364 days.", "charged GE fee on 12/22 credit already there on 12/26   drewguy and TravelinSperry like this.", "What if my first flight is on United but my connection is on Air Canada?", "It will still be free, as soon as your ticket show it is free.", "thanks!", "The question is whether you check in with a United counter or not. At the United counter, the bag fee is waived. At the counter of any other airline, it is not. For a UA-AC connection you'd check in at UA, obviously, so you're covered.   greg0ire likes this.", "GE reimbursement for family member    Has anyone tried reimbursing GE fees for family member instead of primary card holder (two scenarios out there - family member as additional card user and family member with not an additional card holder) ... wondering if they just reimburse based on transaction", "Yes, for a family member who is not an authorized user. The credit was based on the transaction, not the applicant.   IndyHoosier likes this.", "Hi all, I have the Chase United Explorer MileagePlus CC which is up for renewal end of the month. I am not keen on paying for the annual fee as I do not use the card. I was thinking of either downgrading or cancelling the card all together. What I do use the card for is booking rewards flights - when I'm booking a United rewards flights, and I sign in, there sometimes is a foot note that says \" Exclusively available to you as a MileagePlus Chase Cardmember\" Are there any cards I could switch to that offers additional award search results or is it only the MileagePlus CC? Thanks", "All 3 of Chase's United-branded CCs, AFAIK, as well as cards no longer being offered like the Select.", "But not the legacy no-fee card, I assume.", "14", "54", "58", "59", "60", "61", "62", "63", "65", "66"], "Mileage Plus Explorer card": ["Click here for full rules!", "*** Above i noted..that Chase Explorer Support Manager disputed the fact that I signed up for the $250 statement promo credit at all.. he said i signed up for a differnt promo.one that does Not include statement credits..only miles for purchases. so.. \"waiting 6 to 8 weeks\" is immaterial to the issue of the BAIT N SWITCH trick to get people to click a false offer. CHASE IS DECEPTIVE advertising on United Website. I hold both accountable for FRAUD", "Customer service agents and managers at all mass market companies often invent explanations when they do not know what's happening. Have you looked at the thread linked in Troopers reply?", "Interesting offer from Chase today for my Explorer Card: Offer period Feb 1-Mar 31 Spend $600 during the offer period and get an additional 2,200 miles, then an additional 1 bonus mile per dollar up to $9k in spend.  Going to do the first $600 as  that comes to 4.66 or 5.66 miles per dollar spent after factoring 1 or 2 miles per dollar normal earning rate.  Then I will switch back to my CSR and Freedom Unlimited Combo, as I would rather have UR points instead of UA miles. I will note I only use my UA card for UA purchases (tickets and on board), so not sure how targeted this offer is", "I got a slightly different one (though yours is better) 6100 bonus miles for $3500 in spend; 1 bonus mile / $ after that up to 12k total bonus miles. So assuming I spend $3500 or more, that's 2.74 total miles / $ in the first $3500 2 total miles / $ on the next $5900 I'll probably throw some otherwise unbonused spend on it to hit the $3500 threshhold. 2 miles/$ after that doesn't really excite me... UA miles just aren't all that valuable.", "where are you finding these offers, on the web, app or elsewhere??  Thanks.", "Email.  Targeted (since everyone has different offers) The landing page is here:  https://promotions.united.com/offers...tionmilesoffer", "Nice. Thanks for the link. I got the following: Quote: Haven't used the card since October...", "My offer: Tier 1 Spend at least $6,700 on purchases and earn 3,300 additional miles. (or) Tier 2 Spend at least $7,200 on purchases and earn 4,200 additional miles. (or) Tier 3 Spend at least $8,100 on purchases and earn 6,300 additional miles. Not enough to lure me in.", "thanks, no offer here", "\"Here's your personalized opportunity to maximize your bonus miles between February 1 and March 31, 20201.Your offer goal: Spend at least $600 on purchases and earn 2,000 bonus miles.After you spend $600 in total (your offer goal), you'll continue to earn 1 additional mile per $1 spent (up to 9,000 bonus miles).\" For those looking to game this, the footnote says \"Register in the month of February and your purchases will count toward your total spending from February 1 to March 31, 2020. Register in the month of March and your purchases will count toward your total spending from March 1 to March 31, 2020. All registration and spending deadlines are 11:59 p.m. CT on the last day of the month.\"", "Same here: Quote: On the other hand, I received this promotion several days ago: Quote:", "My offer: Quote: Yeaaaaaah, no.   beltway likes this.", "16", "56", "60", "61", "62", "63", "64", "65", "Click here for full rules!", "which card is this and can I product switch to this from a Chase MileagePlan CC?", "It's the old Chase MileagePlus (non-Explorer) card, with no AF and weak earning (1 mile/$2 in spend).  They certainly still exist; my DW has one, which she downgraded to from an Explorer card a few years back, even after the no-fee card had stopped being something you could sign up for directly. The wiki for the current Chase downgrade thread and its predecessor  both mention this as a possible downgrade option, although I don't recall seeing any recent data points, so the info may be stale.", "I have downgraded two cards to both the Mileage Plus and Travel Bank no fee versions in mid 2019.   beltway likes this.", "Is the no-fee MileagePlus card just for keeping the credit line open, or does that also have the increased award availability, BG2 boarding, etc.?", "My wife applied for a CIP Biz card and got the \"We have received your request for a Chase credit card. We'll let you know our decision as soon as possible.\" note. With the 65K offer ending on Wednesday, is it OK for her to apply for this card now or do I need to wait on a decision on the CIP card?  I'd apply myself, but I'm at 6/24.  She's at 3 or 4/24.", "I sill have increased award availability. I downgraded to this card in case I ever need to upgrade back to the Explorer card while being over 5/24. Quote: Applying for another Chase card prior to the CIP being approved could put that application at risk.   beltway likes this.", "OK.    Thanks.  Wish I had seen the end date for the offer before going for the CIP.  Oh well, guess I'll have to wait and maybe go for the CIU in a month or so.", "Can anyone else confirm this?  That's half the reason I keep the MPE card.", "Theres a no fee UA card?", "Yes: https://www.chase.com/personal/credi...k/earn-rewards There is also a free card that is not open for applications, but might still be open for downgrades.", "I want to apply for the new United MPE offer that came out today 60K for $3K spend.  I just looked and received my last bonus on the MPE on 1/16/18, so its been 24 months, barely.  I still have that account open, however, I downgraded it to the free version of the card a year ago.  Am I good to apply for this one?", "Any ideas on how to generate a referral link for the current 60k SUB with $3k spend?  My referral link points to 40k SUB with $2k spend.", "Did the business version of the Explorer card go away?  All I see now is the New \"Business\" card.", "Wont Honor $250 Statement Credit Promo    1/12/20 Signed up for United Explorer Chase Visa while on the United Airlines site shopping for flights. Link said $250 statement credit within 6-8 wks after 1st purchase. Got the card no Info about $250?? Called Chase Got manager and big RUNAROUND excuse saying yes there is such an offer but you didnt get that one.. I said I have screenshot.. They did not care..just kept telling me about offer i supposedly signed up for. CAN YOU SPELL BAIT N SWITCH!!  Im so angry with Chase being a liar about this ... how could I possibly know about an offer much less have screenshot of it. .I needed to book the flight I had paid for a fair lock while waiting for the card to arrive.. The Manager DANIEL (no name) stated hed have a higher manager call me within 72 hrs..No Calls, No msgs. Chase You Are A Liar!!  Beware People..", "Welcome to FT. I suggest you wait the 6-8 wks after your first purchase before contacting Chase.  It's been 2+ wks since you signed up on 1/12.  Assuming you meet the TC, the credit should appear by the second statement. Also, see this thread: Chase refuses to honor Explorer Mileage Plus offer for $250 statement credit.", "15", "55", "59", "60", "61", "62", "63", "64", "66", "Click here for full rules!", "offer is once every 2 years, so yes, sounds like it. FYI the current offer is 40k for 2k spend during first 3 months + 25k bonus for 10k spend in first 6 months. So $1667/mo for the first 6 months gets you 65k miles.", "Hi, anyone know if you get a free bag on a Lufthansa codeshare flight booked on United.com?", "The T&amp;Cs literally say: Eligible Cardmembers will receive their applicable standard checked bag free on flights operated by United or United Express; codeshare flights are not eligible. Check out this thread for more info: Mileage Plus Branded Credit Card and Checked Baggage Fees", "Bueno, merci.", "Quote: Any other recent experiences to share? My birthday is about 10 days before the annual fee is due (it's been billed, and closing date is bday+10).  If I apply for GE should I expect to see the reimbursement before I close my account (I assume they won't reimburse once account is closed)? If I won't get reimbursement I'll open another card and then apply later . . . I have 364 days.", "charged GE fee on 12/22 credit already there on 12/26   drewguy and TravelinSperry like this.", "What if my first flight is on United but my connection is on Air Canada?", "It will still be free, as soon as your ticket show it is free.", "thanks!", "The question is whether you check in with a United counter or not. At the United counter, the bag fee is waived. At the counter of any other airline, it is not. For a UA-AC connection you'd check in at UA, obviously, so you're covered.   greg0ire likes this.", "GE reimbursement for family member    Has anyone tried reimbursing GE fees for family member instead of primary card holder (two scenarios out there - family member as additional card user and family member with not an additional card holder) ... wondering if they just reimburse based on transaction", "Yes, for a family member who is not an authorized user. The credit was based on the transaction, not the applicant.   IndyHoosier likes this.", "Hi all, I have the Chase United Explorer MileagePlus CC which is up for renewal end of the month. I am not keen on paying for the annual fee as I do not use the card. I was thinking of either downgrading or cancelling the card all together. What I do use the card for is booking rewards flights - when I'm booking a United rewards flights, and I sign in, there sometimes is a foot note that says \" Exclusively available to you as a MileagePlus Chase Cardmember\" Are there any cards I could switch to that offers additional award search results or is it only the MileagePlus CC? Thanks", "All 3 of Chase's United-branded CCs, AFAIK, as well as cards no longer being offered like the Select.", "But not the legacy no-fee card, I assume.", "14", "54", "58", "59", "60", "61", "62", "63", "65", "66"]}