{"Chase Sapphire primary car insurance refused?": ["Click here for full rules!", "does chase insurance cover turo?", "My understanding of Turo is that they're not considered a rental car company, hence no CDW from any issuer (that I know of) will apply. It would be nice if it did, though.", "The eclaim form now has a 'car sharing' claim option, so things are (slowly) moving that way... You are mixing up the preconditions for registering a vehicle (ie get a plate) and the insurance add ons. The 25 or 35k is pretty much required by all states otherwise the owner of the car cannot register it. And all rental cars have this insurance in place, covering the basics and if you hit someone/something with the rental the damage to the other party is ALWAYS covered. The limits of the liability insurance are debatable though. What is not/never covered is damage to the rental. That you cover using the add on you pruchase with the rental or the insurance you have with Chase.", "I believe that the state minimum third party liability that comes with any rental car only applies if the driver doesn't have his own insurance.  And the limitations of liability are very low.  In NY, for example, it's only $10k for third party property damage, and it's not uncommon for damage in a moderate crash to exceed $10k.  You would be left holding the bag for any excess.", "I think what she was trying to say is \"ok the credit card will cover damage to the rental vehicle, but what about third party liability insurance?\" As mentioned in this thread CA, TX, NY, and many other states don't require the rental company to provide this (many other states do).   Most personal car insurance policies cover liability while driving a rental.  If you don't have personal car insurance you can also get a temporary or permanent non-owner policy for while you're driving rentals and borrowed cars. So it's not that they \"don't accept\" that insurance but that she was asking about a different kind of insurance.", "I believe that NY provides minimum third-party liability insurance to renters. In fact, if the renter has no other auto insurance, the car-rental company's minimal coverage is primary, meaning that the company cannot sue the renter for any claims it pays to third parties (up to the limits of the minimal coverage). Here's Hertz' policy about this: https://www.hertz.com/rentacar/reser...RAGES&amp;EOAG=LAX", "Whoops, you are right NY is not one of those states. CA is and I think TX is too though I'm not sure now where I found the list (though looks like Hertz offers it anyway). Point is: in some states you must carry your own liability insurance, Chase credit card does not offer this, and the rental company is within its rights to ask.", "But the policy has not changed...And Turo also claims it is not a rental company...", "17", "21", "22", "23", "24", "25", "26", "Click here for full rules!", "You need to personally try this with Chase ---  doesn't work. Chase Benfits Administartor ONLY has a Letter advising coverage is where applicable and that Republic of Ireland, Northern Ireland, Jamaica, and Israel are NOW included.  This is added since teh basic VISA car rental is secondary and excludes those 4 countries. Bottom line --- CHASE will not make  list of additional countries who will force you to purchase extra car rental coverage which not only costs the card hold a higher rental but denies Chase rental primary coverage.  So ----  try and geta  list from Chase......Chubb INC will NOT make a list although they know majority of countries just like AMEX knows and lists.", "I personally have used it successfully twice.   Once in Canada during a ski trip we got a broken windshield.  The second time was in Cabo San Lucas, someone hit the car while parked, no idea who did it.", "That's interesting.  I rented from Hertz in NZ and their basic cover includes NZD 10 million of liability for both injury and property damage, but I don't see something similar from Enterprise.  Normally that kind of cover is only offered if part of the law.", "I mean, Happy in post #375 provided a DP already where Chase covered the excess for a claim in a country with mandatory CDW. Of course, buying additional coverage for the excess is still optional and will preclude you from Chase's coverage if you opt-in. Anyway, it's ultimately going to come down to your risk tolerance. If you don't think that Chase is going to come through for you in the event that you need to file a claim, perhaps buying full cover would be the best thing to do.   Happy likes this.", "That explains why their rentals are so expensive in NZ", "I noticed in the 11/01/2019 (current) benefits guides, language was changed to indicate that pickup trucks are covered. Previously, I interpreted pick ups not be covered as \"vehicles with open cargo beds\" and \"trucks\" were not covered. I called late last year to inquire about several vehicles and was told pickup trucks were.covered but I was skeptical (as was another posted in a Hertz thread where I mentioned it) as the Benefits guide available at the time (the Oct 2018 one) seemed to exclude pickups I noticed the new language specifically mention pickups being covered. The bolded parts are new (including the two new sections concerning pickup beds): The following relevant sections are new: What Vehicles Are Not Covered? Certain vehicles are not covered by this benefit, including: antique cars (cars over twenty (20) years old or that have not been manufactured for ten (10) years or more), cargo vans, vehicles with open cargo beds, trucks, (other than pick-ups), motorcycles, mopeds, motorbikes, limousines, and recreational vehicles and passenger vans with seating for more than nine (9) people, including the driver (passenger vans with seating for nine (9) or less, including the driver, are covered). Damage to the interior bed of a pick-up truck unless such damage is caused by or the result of a covered loss, such as theft or collision \u0095 Damage to a pick-up truck that is a result of loading or unloading objects into the bed", "has anyoone had a tesla model 3 covered under chase's policy?", "Chase Sapphire primary car insurance refused?    Yesterday I rented a car at a neighborhood Enterprise location and used my Sapphire card.  When I refused their insurance and said that my card provides primary insurance, the lady asked if I also have normal car insurance because they 'don't accept credit card insurance'.  Can they actually do that?", "No one's asking Enterprise to \"accept\" your credit-card insurance. If their car is damaged while rented to you, Enterprise can send you a bill, which you would then promptly forward to Chase's insurer. But Enterprise regularly asks for the name of your personal auto-insurance company, and I don't know if there is any law that prohibits them from denying a rental to a customer who fails to divulge it -- unless, of course, the customer does not have personal auto insurance.", "Yes. Financial responsibility law is to protect third-parties in case of an incident. It is not designed to protect your own. On the other hand, credit card benefit only protects your rental vehicle, not any damages you have caused to others. Many states do require drivers to meet financial responsibility law, in addition to the owner. So having someone to pay for the damage is one thing. Meeting the financial responsibility law is another thing.", "I do have personal insurance and can see that it would be applicable if another party were involved.  But if Chase covers the vehicle as primary, I don't see how Enterprise has any right to say 'no, we're contacting your insurance company' for any damage to the car only.  I suppose if they did I could just call my insurance myself and say to ignore Enterprise as I'll take care of it.  I just found it unusual (and unacceptable) to be told that they don't 'accept' credit card insurance since I will figure out how I pay for any damage I cause to their car.", "It is totally acceptable, as you have a fundamental misunderstanding. According to CA DMV: \"Financial responsibility (commonly known as insurance) is required on all vehicles operated or parked on California roadways.\" Interestingly, the CA DMV does not actually require insurance, but instead accept the following: \"- Motor vehicle liability insurance policy. - Cash deposit of $35,000 with DMV. - DMV-issued self-insurance certificate. - Surety bond for $35,000 from a company licensed to do business in California.\" Because of this common misunderstanding, many simply ask for insurance. What they actually mean is proof of financial responsibility. There is actually no law mandating how you need to pay for the damages if you are found to be responsible. Cash, insurance, credit card, etc. No one really cares as soon as it has been paid. Bottom line, when the Enterprise agent really means financial responsibility, you are thinking liability coverage. Hence, the fundamental misunderstanding.", "Did srodr say that he was renting from an Enterprise location in California? California, of course, is a special case, since it requires that rental-car  drivers  have third-party liability insurance, apart from whatever coverage the rental-car company might have. In some cases, California rental-car companies will provide free, but minimal, primary third-party liability insurance to the renter. Example: AARP members renting from Avis/Budget using the AARP discount code.", "I feel like the latter three options don't come up that often, hence why a lot of people equate insurance with proof of financial responsibility. In any case, I highly doubt Enterprise verifies what you tell them most/all of the time since in my experience, they just want the insurance company's name and deductible. Besides, CDW isn't liability insurance, so Enterprise isn't exactly in the wrong here.", "No such assumption has been made. In fact, I am merely using CA as an example why people equate insurance with proof of financial responsibility. Beside - many requirements are actually universal among states, like NY or TX. Even both states do not specifically mention all options and just claim it as insurance, they do accept all 4 methods in satisfying financial responsibility. Quote: Surety bond and cash deposit - yes. But not for self-insurance. In fact, car rental companies have their rental cars self-insured, so that they need not to pay premiums, effectively saving millions. Next time, check the paperwork inside the car, you should be able to see a self-insurance certificate inside the car.", "16", "20", "21", "22", "23", "24", "25", "27", "Click here for full rules!", "They do this all the time.  Just send them what they ask for, even if you've already sent it.  It's much easier than arguing with them about it.", "I normally would use my CSR for car rentals, but the fact that they may not cover any damages as a secondary insurance is making me re-think this for my upcoming plans. I am planning to rent a car in Malaysia and I can't seem to confirm whether car rental insurance is mandatory by government regulations or not. The car rental agency includes \"standard hire &amp; drive insurance\" as part of the base rate, which basically appears to be a plan where I'm on the hook for the excess in the event of a collision. The excess can be further reduced if I buy additional coverage. The agency seems to refer to the basic plan as the \"standard hire &amp; drive insurance\" and CDW interchangeably per the snip I attached. In this case, would CSR not cover the excess even it's included as part of the base rate? From what I'm reading here, it appears that offering the plan as part of the base rate isn't enough and that it has to be mandated by the government for the coverage to kick in as a secondary.  If that's the case, I'm thinking about using my Capital One Quicksilver since that looks like a secondary insurance plan to me and I can't confirm whether Malaysia makes CDW mandatory for car rentals.", "Just a quick datapoint about timing: July 13: car damaged while parked, drove to Hertz and exchanged for new car.  I took pictures of front and back of original rental agreement and also accident report, and of course the damage.  Highly recommend doing this.  I also filed a police report (see below) July 21: end of trip, returned new car.  Charge for the car rental sat as pending for a loooooooong time, then eventually posted as a higher amount.  Checked my bill and I was charged for FRANCHISE REDUITE for EUR 115 and I was also charged for returning my (broken) car without a full tank.  Took picture of front and back of new rental agreement. Jul 23: Started the claim process with eclaimsline to make sure I was within deadline, but didn't upload any documents.  Got an email saying I had to supply all the needed documents with 365 days.  They wanted a Demand Letter, Final Rental Agreement, and cc bill showing the charges. Aug 14: Filed Hertz inquiry asking if there would be any additional charges and asking what EUR 115 for FRANCHISE REDUITE was on my bill. Aug 27: Hertz wrote back saying the EUR 115 was for damage and that Hertz France would be getting back to me soon with more info and to direct further inquires to [email protected] .  I didn't want to finalize my claim because I was worried there would be additional charges coming at me. Oct 22: Hertz France wrote back saying EUR 115 was from their damage matrix and included scans of the accident report, the rental agreement, and their damage matrix.  They didn't explicitly say there would be no more charges but I felt more confident that they had evaluated the damage and chosen to charge me this much. Oct 22: I replied to last eclaimsline email and attached accident report, new and old rental agreements, picture of damage, police report, bill from Hertz, email from Hertz saying that FRANCHISE REDUITE was for damages, and all the scans they had sent me, along with credit card statement showing the charge and last 4 digits. Oct 24: Notified by eclaimsline that my claim for EUR 115 had been approved.  I couldn't get the direct deposit option to work so they will send me a check. Extremely satisfied with Chase here, with only 2-day turnaround on the claim once they had the documents.  Extremely frustrated that the Hertz bill didn't just say what the charge was for and that they took almost 2 months to get back to a simple inquiry. Note on police report: This rental was in France and the car window was smashed overnight and personal belongings stolen.  I called the police and was told to go to the station to make a report.  I went to the police station and they had me fill out the multi-lingual report form, made we wait 2 hours, then told me (in fairly good English) that if I didn't speak French they would have to set me up with an appointment with a translator, for later that day, at a different station.  Since I had spoken 0 words of French to them the whole time I don't know why they waited 2 hours to tell me this. I took the intervening time to return my car to Hertz and get a new one, since there seemed a 0% chance they were going to collect any evidence from the car.  The check-in employee filled out an accident report form and gave me a form to go get a new car from the counter. Then back to the police station to file a report, took over an hour, basically the translator read my form out loud to a police officer who typed it in very slowly.  All in all I spent 4 hours in police stations to get a 3-page report and some good stories from the translator, while we were waiting for the officer. In retrospect I probably wouldn't have wasted half a day making the police report if I'd known it would only be EUR 115 and that it would take 6 hours total plus some hefty parking fees near the police station.  Was thinking at the time that the damage might be more like EUR 500 and that I would also file a homeowner's insurance claim for some of the stolen property (later decided not to, once we had sorted out what was stolen), so for EUR ~1000 seemed worth spending what I thought would be an hour or two getting the police report.  Didn't turn out that way. If I was doing it again for &lt;$200 I would definitely just exchange with Hertz, file the insurance claim without the police report (not even clear they needed it), and if it was denied just pay out of pocket.   TravelinSperry likes this.", "One quick and dirty way to find out if there is mandatory CDW is to go to Avis and do a dummy booking - if the CDW is mandatory by the government, the box to decline CDW would be checked and grayed out.  i.e. there is no option to decline. When it is government mandated CDW coverage, Chase would cover the excess, PROVIDED you do NOT buy it down. The information you quoted, looks like Malaysia has mandatory CDW coverage with high excess, and the rental car company entices you to buy down the excess - once you do that, you LOSE any credit card coverage, be it Chase or Citi or AMEX. Note the key words of Nonwaivable,  (for the coverage), as well as \"buy down\" the excess which does not look buy it down much because you are still responsible for anywhere from 50% to 70% of the original excess! The excess is the maximum you would have to pay when you incur damages.  Usually the rental car company would charge that upfront, then you file claim to get most of it back if the claim is approved.  The excess itself ONLY for the actual repair cost, BEFORE taxes / excise fees / airport surcharges etc.  Those can be additional 30 to 40% of the excess.  Not all the add-on items are covered.  Airport surcharge on repair estimate is specifically NOT covered per the T&amp;Cs of benefits. Quote:", "Thanks.  I looked at Avis and it just says that it is included in the rate (not declinable), so it looks like basic CDW with excess is mandatory - other competitors like EuropCar also describe premium CDW as an excess reducing plan.   Since it looks like it is mandatory/nonwaivable, I guess the CSR CDW should kick in as a secondary.  Will sharing that screenshot with Chase be enough to prove that it is mandatory?", "You do NOT need to do anything.  The insurance provider KNOWS which country has mandatory CDW and process your claim accordingly.  Or if you still feel the need, you can google such as Does Malaysia require mandatory CDW coverage on rental car?  something like that and see what you can find and print.  Personally I would not be bothered. I have posted a very detailed report on a claim from our May 2018 trip at Sicily where we had some bad scratches to the car.  Italy is a mandatory CDW country, and is excluded from AMEX coverage in case you are not aware of this.  Chase covered the 1000 euro excess plus taxes and even paid a portion of the not-covered airport surcharges on the 1000 euro.  Go back to last year correspondent period to find my report - that should give anyone a very good idea on how to file eClaim (Chase's insurance handler) efficiently.  Our claim was settled extremely swiftly - from filing to money ACHed to our bank account, it took only 7 business days.  eClaim did not ask any extra doc nor even communicate to us after filing - the next email we received was to ask how we would like the money be paid.  (direct deposit via ACH or a check sent) One of the Key to have quick settlement is due to Budget at Catania airport being very efficient in processing the return, charge on the damage, and the supporting documents - all done within 10 min, with the docs emailed to us while we were in the return lot.  Then we spent 20 min back at the counter to get the Final Rental Agreement (required to file the claim) as well as to make sure the charges were all billed in Euro, not being DCCed to USD.  eClaim paid the exact amount of Budget's Damage Repair Invoice.", "Trying to figure out if my partner is covered. He's renting a vehicle in the UK and has to have the CDW with an excess of 1500$ due to the fact he is under 30 and vehicle type with Sixt. Would the Chase card cover the £1500 if there was an accident? (it also states on the confirmation that the LDW with £1500 excess is included in rate)", "Does the coverage terminate when the card is cancelled? To be more precise, if I rented a car (billed to Chase MP Explorer), it was damaged, and then cancel the card (because the annual fee is due), can I seek coverage after that?  What if I submit the claim, but then cancel the card after submitting the claim?", "Finally had my claim approved. Here's what happened: Went to Iceland back in August. Everything went fine until my last evening there when the wind was gusting up to 75 mph. At one of my final stops of the trip I happened to park in a way that the wind was blowing directly into the back of the vehicle so when I opened the door the wind caught it and slammed it forward causing damage. After that the door could only about 1/3rd of the way and even then with a bit of difficulty. The next morning I left about an hour earlier than I would have to get to Keflavik with enough time to fill out whatever I would need to fill out. Returning the car was fairly smooth and the agent handling the return made sure to give me email and hard copies of everything. On the layover on the way home I started the claim and submitted everything hoping for a speedy resolution. However, Card Benefit Services kept asking me to resubmit my rental voucher and contract claiming that the voucher I had submitted did not match. OK, I sent it again, and again, and again. I lost count but I think they asked for it a total of about 4 or 5 times. At this point I was getting frustrated and just decided to forget about it for a few weeks then tried again finally getting an approval. I'm not sure but I had made the booking using Auto Europe and I believe that there might have been an issue in that the actual rental contract showed Auto Europe's corporate account number even though I had used my CSR. I normally try to book directly but this time I could only seem to get this particular rate using the Auto Europe site. It ultimately took about 4 months from start to finish but that does include the couple of weeks where I got tired of dealing with it.", "May be you should read the T&amp;Cs in the benefit booklet?  if you dont have the paper pamphlet anymore, it is available on Chase site.", "I'll be going to New Zealand where they require basic insurance on the vehicle. From reading the above comments, it seems like Chase will help me pay for the excess (deductible) if I do get in an accident. Question I have is liability as the chase coverage is only for damages to my vehicle but not other vehicles. In New Zealand, the medical costs will be covered by ACC. But I do want to know if the basic insurance liability will cover the other parties vehicle? In the event that the basic insurance isn't enough, it'll be out of pocket on my end? Also, there seems to be an option for additional CDW and also protection for windshields, tires, and headlights. I plan to decline the additional CDW, but wanted to opt in for protection of windshields, tires, and headlights. Does chase cover protection for the windshields, tires, and headlights in the event they do get damaged? Not sure why Enterprise marks the coverage as not part of CDW?", "BEWARE of Chase car rental insurance as the underwriter CHUBB INc makes minimal attempts to identify where collision coverages NOT applicable. Chubb will list only advise countries like Republic of Ireland, Northern Iran , Israel, and Jamica are covered which basic VISA car insurance is not. However, there are many car agencies like around the world that require you purchase additional insurance which conflicts with CSR to deny all coverage. New Zealand along Italy, Australia, Iraq, Iran, etc etc...........are some of these countries where some card holders have had problems being told to buy additional insurance. Be careful --- I know I don't trust the limited knowledge of Chase Benefits staff on where insurance is applicable.", "Italy is a mandatory CDW country which AMEX has identified. Chase on the other hand the underwriter Chubb Inc refuses to document Italy or any of the other countries making many card holders confused. Suspect there are over 25 countries requiring mandatory additional insurance voiding the Chase insurance but chase won't support in identifying these countries.", "I would think you'd be okay if you can get the Benefits Administrator to send you a letter stating that the CDW is valid in the country you're visiting within a few weeks before leaving. (In fact, Irish car rental companies seem to want this to be willing to waive CDW at all from what I've read.) If you run into problems filing a claim later on, you can always send the letter you received along with the other required documents.", "Chase is very willing to issue a letter regarding the coverage.  Regarding countries where mandatory CDW is required by laws, Chase covers the excess.  We had one such claim at Italy, at Sicily to be exact.  I have posted the details last year - it was 7 calendar days from time to file the claim with eClaims online to the money ACHed to our bank account.  We even got reimbursed a little bit more because in the Repair Cost Estimate there were some airport surcharge added - this item is NOT covered, per the T&amp;Cs. At the time of picking up the car, Budget counter rep asked whether we would buy extra coverage to lower the excess which was $1000 euro before taxes.  We said no because the CC would cover it.  He then said, you understood that you would need to pay this first then you claimed it back from your credit card?  We answered it affirmative.  No more conversation on additional coverage topic. I also dont think in countries where the basic CDW is required by laws you could decline the basic coverage.  You can definitely decline the push to buy down the excess.  What the tactics some rental companies employed were to scare you on how high the excess would be, like up to the value of the car that kind of things, or tens of thousands of $.  This type of practice seems to be more prevailing with the non-worldwide chain, i.e. their names you never know about until you search car rental in that particular country.  Worldwide companies like Avis/Budget/Hertz/National/Enterprise, tend not to use such tactics even at franchisee locations.  Sixt is an exception that one needs to be really careful about due to many of the basic items they do not cover, without paying additional fee.  Read too many bad stories about Sixt we purposely avoid dealing with them.", "15", "19", "20", "21", "22", "23", "24", "26", "27"], "United MileagePlus Explorer Business card: Various offers up to 100K": ["Click here for full rules!", "I can't answer to the first item, but yes, your Evoucher lounge passes will become void if you cancel the credit card associated with them prior to using them.   Chase/United used to send physical lounge passes that had a printed expiration date, but since the change to Evouchers, the lounge passes are tied into being a current cardholder.", "I did a print screen of my vouchers before I cancelled card. After closing card they disappeared. I was hoping that they worked, but with your comment, I am disappointed. I will still try at a Club.", "Let's know after you tried, thank you!", "Apologies if this has been answered already (54-page threads can be a beast to scroll through), but if a company already has an MP Explorer Business card associated with the account of someone who retired/no longer works there, is there a way to change the MP account associated with it to a different employee, or would that have to be a new card application in the new employee's name?", "Business cards are issued to individuals, not to companies. The MP number is the least of your concerns. The person who applied is still guaranteeing the credit for all of the transactions, and is obligated to close the account. This is the relevant portion of Chase's terms: Quote:", "4", "44", "48", "49", "50", "51", "52", "53", "Click here for full rules!", "This:   Quote: It is a great option for the personal card.  And \"slightly better access\"  is an understatement ex-ORD.   beltway likes this.", "While the Wiki states 50K miles with $ 3K spend, all links lead to the 50K/$5K, + 50K/$25K application site. Is there a way to get to the 50K/$3K page? PS: the offer page also does not specify that AF is waived first year; it does show a \"+\" mark behind the $95, but I cannot find any reference to that \"+\" anywhere on that page or in the terms. fyi, from the Wiki: Public offer: Now 50K miles. $3000 spend in 3 months &amp; fee waived 1st yr. Possibly targeted: 50k miles plus $50 statement credit, $3000 spend in 3 months, fee waived first year (thanks, DoctorofCredit)", "Anybody else still has access to the $3K in 3 months, no AF offer?", "ended up having to sent a copy of a utility statement to verify address (less than 2 years). Approved, BUT only with a 5k limit. That's going to make it tough to churn. If I pay the statement off early, would that raise red flags? Or is the best option to max out slowly to 5k a month and wait for the billing cycle to end and repeat for 6 months?", "Authorized user benefits    If I add my wife to my business card as an authorized user will she get the extra access to flights on her UAL account like me?", "Can your refer yourself with Chase United?    For example if your have the united explorer card can you use your own referral link to open up a united explorer business? Thanks!", "Today the Explorer card links all say \"We're sorry, due to system issues the page you're trying to reach is not currently available. Thank you for your patience.\" Anyone else seeing that?  Think they are about to roll out a new AF-Waived offer once the 100K offer expires 10/10?  Or are they pulling that offer early?", "It's happening on my account but not my wife's. She has some (rather lackluster) targeted offers on personal cards once she logs in. Not sure if that has anything to do with it. Maybe I have no offers?", "I still see the Biz 100K offer for $25K active.  I thought it was supposed to expire 10/12 and was hoping they would resurrect a waived AF offer with lower spend requirements.  Anyone seeing any newer offers post 10/12?", "Is it risky for me to apply? Just got approved for a personal card from another bank    I wonder if it is risky for me to apply for this card now. I just got approved for a personal card from Allian Credit union bank. I am 3/24 including the new card. I wonder if I should wait 30 days, but I am afraid the 100k offer will be ended by then. It was supposed to end on October 10th I believe, but I guess it was extended. I still see it available. BTW, the business is small, but I can easily spend and pay off $25k in 6 months.. I have another Chase business card that I used a little bit this year.", "Probably fine.  Depending on what state you're in, Chase will pull a diff. credit bureau.  For us, it's almost always Experian. I've gotten approved at 4/24 with 6/24 inquiries.", "I have an old Chase United business card that\u0092s $75/year and gives 1 mile per dollar spent. I have better cards and it\u0092s time to jettison this one. What\u0092s a decent card to switch from this, where I can just have a zero annual fee? I want to keep the credit limit just in case.  Last year I tried to cancel and they offered a United gift of $100 statement credit, so basically I got a free $25.  also I have a different problem - I had fraud charges on the secondary card and Chase issued a new card number for the secondary before I cancelled the secondary. I later realized that I hadn\u0092t been reimbursed for the fraud charges and their phone operators haven\u0092t been helpful; they just say that it\u0092ll happen but nothing occurs. Any suggestions for this problem?", "It appears there is no downgrade option for this card. Scroll back: United MileagePlus Explorer Business card: Various offers up to 100K", "Thanks - indeed zero downgrade. I ended up cancelling the $75/yr card - no retention offers. I was barely using it so Chase probably didn\u0092t feel there was a point for me to keep it.", "I recently booked and paid for the fees for an award itinerary with my Chase Expl Biz card.  Since that point, my annual fee came due and I wanted to jettison the card and not incur the fee.  Two questions 1) Will I still get the free bag allowance on this itinerary?  I am guessing yes since I paid the fees with the Expl Biz card. 2) Will my 2 free lounge passes get clawed back? Thanks!", "3", "43", "47", "48", "49", "50", "51", "52", "54"], "Does Chase care about customer retention?": ["Click here for full rules!", "It goes both ways.  Chase could raise the AF (with no accompanying benefits) on some cards and i'd still keep them.  For other cards I'm either comfortable with the benefits for the AF paid, or I cancel them when that time comes or if my situation and needs change day to day.  It's purely a mathematical question, not sure why everyone gets so emotional nor do I understand why people choose to ask questions or hurl accusations at companies with 12 figure market caps because they feel their individual situation got worse with bank changes.    By default, FT posters are probably the worst demographic for profits for huge banks and it's almost as if people forget profits are the one and only goal of big banks.  If most of us came on their radar and they dug under the hood the'd realize were mostly loss leaders.  Some people do a good job of telling Chase just that with their activities.", "1", "Click here for full rules!", "Does Chase care about customer retention?    I'm curious about credit card companies' different attitudes toward customer retention:With Capitol One, when I mention canceling my credit cards, they find out the reason and do whatever they can to keep me as a customer. So, it's no surprise that we've never canceled our Capital One cards. With Chase, I've mentioned canceling cards via phone, they say \"We're sorry to hear that,\" and that's it. And when I mention it in writing, they don't respond to it at all. So, it's likely that when we return from our vacation, our Chase cards are history. Maybe it's just me but after going through a lot of trouble to get somebody as a customer, you'd think they'd be eager to try and keep them. What accounts for this difference in customer retention approaches?  Has anyone else experienced such differences between Chase and other credit cards?", "If you don't get any value out of Chase, yes close and move on.   Statman and satman40 like this.", "Chase doesn’t offer retention on their Ultimate Rewards cards because the annual fees are an important part of their profitability equation. With Capital One, the fees are more of a bonus and they also have a lower average credit score so I speculate those on the top end are likely to get kept around for ratings purposes.", "The short answer is NO. Fee revenue is a big part of its business.  They designed the point benefit just to induce you to hold their cards for all your spending, carry a balance even better.  If you use their \"benefit\" so much and they do not make $$ from you, then they would shut you down and move on.", "You don't get to be the biggest bank in the US unless you are doing something right. What bank has a successful business model from giving away retention to people who would otherwise leave? The better plan is putting resources into making a product that people WANT. Capital One is more desperate to keep clients, so they will throw out offers. Meanwhile, people are signing up to Chase cards left and right. Why do they need to cater to people who are either trying to scam them out of the AF or won't use the product? Besides, in today's age, companies should know that the internet will take advantage of anything they can.", "It means exactly what Chase says, \"we're sorry to hear that.\"  If you don't see value in any product or service, why on earth are you spending money on it in the first place? Just cancel the card and move on.   Statman likes this.", "Chase runs a flawed business models and it makes the churners happy. It offers a fat bonus for new card holders with high AFs. Chase then expects cardholders to use the card for all spending or carry a balance. The churners then cancel the cards after getting the bonus. Wait for 2 years and come back and get bonus again.", "capital one likely expects their (lower credit rated) customers to carry balances, so they want to keep you around.", "My feeling as well. There are better cards for daily spending, e.g., BOA premium rewards, Blue business plus, Citi double cash, Altitude reserve", "If you look at bank earning reports, you'll see BofA, Citi and even Wells Fargo have higher interest income to fee incomes from credit card businesses.  They spend more time servicing existing customers and keep their business, particularly the average or lower income customers.  But Chase target more affluent customers who carry premium (travel) credit cards and carry no or lower balances.", "Our Chase cards have actually been fine until our current trip: they mostly stopped working in Malaysia this year, which is detailed in another post. They even worked in Malaysia last year. Not to rehash that post here but Chase has not answered any of my questions as to why it's happening. Unfortunately, they're the only credit cards we have atm, so we need to depend on them for our upcoming stops in Singapore and Japan where, hopefully, they will present no problems. But yes, we will be cancelling them when we return home. And bringing more reliable cards on our next Malaysia trip. Quote:", "The consensus is that chase doesn’t give retention offers, previously I can see why but I think personally they are in for a rude awakening with the increase and the door dash credit.", "Chase does make retention offers, but not for Sapphire Reserve: Chase Retention Offers  (2020)", "Just cancel the card and move on.", "Yes.  I got a $60 bill credit when I called to cancel my CSP last year.  I also got a $100 bill credit when I called several years ago on a Southwest card.", "2"], "Problems Combining UR points between accounts": ["Click here for full rules!", "Chase customer service made very clear that, we/you can transfer UR points within the same household as long as they live in the same permanent address as the \"primary customer\".   The last part needs some further definition. you can only move points to another Chase card with Ultimate Rewards that belongs to you or one member of your household. as long as your parents/children or siblings have the credit card accounts with Ultimate Rewards, you can transfer the reward points (A household member is a family member who has the same permanent address as the primary customer). For details, see your rewards program agreement at chase.com/ultimaterewards.", "I am trying to transfer points to authorized user/cobusiness owner from my  chase ink preferred card but I got a special handling require error. So I sent a SM and I got a reply which make no sense to me. This authorized user is already on my other chase business cards as well but what chase is telling me, AU is a employee and I can’t transfer points to his FF account. What exactly they need when it comes to differentiate authorized user from an employee. Funny thing is when I go to the transfer screen pull up, AU name showed up as business owner but the text field is greyed out and special handling error pops up.", "The requirement is that the second person must be -both- an owner of the business -and- an Authorized User on the Chase account from which you are trying to make the Transfer. Does the person meet both requirements? Have you previously transferred from this Chase account to any airline or hotel partner?", "Thanks mia, The second person meet both requirements and as I mentioned AU (I am trying to transfer to) showed as a business owner but the FF account field is greyed out. Yes, I have done the transfer from another business account to this AU hyatt/united last year. I never recall Chase asking me to send any proof of AU business ownership before and the fact is, they haven't asked it yet.  They just keep telling me that the AU user is an employee and hence no transfer. Should I just tell them that he is also the business owner (though they can see it in a transfer screen)?", "History with other Chase card accounts is probably not relevant. The customer service statements do not necessarily indicate the real reason for the failure. Have you transferred from THIS Chase card account to any airline or hotel account, including your own? Was THIS Chase account opened as a Sole Proprietorship business?", "No, I haven't transferred from this account to ANY (including MINE) and the account was opened as a sole prop. Would this be a problem? doing business as a Sole Prop.", "It could be that Chase's system now excludes the possibility of a co-owner of a Sole Proprietorship, but I do not recall a previous report. I think you will need to work through this by telephone. Be careful not to \"lead\" the agent to a specific explanation, just explain that you need to transfer to the frequent flyer account of another owner of the business and it does not work. I would not mention the previous SM explanations. Listen to what they say.", "Thanks, will do and I will post an update, if there is any positive update. here is the exact reply for more context.  \"He/she should be listed as an Authorizing Officer on another Chase business account, if he/sheis only listed as an employee on an account we cannot transfer the points to the frequent travel program and this scenario has always been there it is not a recent change\" Highlighted key words to make sure, I am reading it correctly. Authorizing officer on another Chase business account OR on the same account? What makes one an Authorizing officer?", "7", "11", "12", "13", "14", "15", "16"], "United MileagePlus Club Card, 1st Year Annual Fee Waived, Tied to United Status?": ["Click here for full rules!", "Thanks", "Does the holder of the Club card have lounge access for all other people traveling on their same United same day itinerary?", "The Club Card is bundled with an annual United Club membership which means the usual entrance and guest rules apply:", "I noticed there's currently a 75,000 mile bonus available for this card.   RNE likes this.", "I logged in and it presented me with a no-AF offer but without the 75k bonus miles.  Take your pick on which is more valuable to you.", "Assuming you can qualify for each of the Explorer, Club, Biz, and Biz Club cards, and given the current bonuses and perks, which would you choose?", "You provide no basis to answer this question. How often do you fly United or Star Alliance airlines? Do you receive free United Club access based on status or fares purchased? If not, do not ever purchase United Club access? If not, do you even care about United Club access?", "i was mainly looking for comparison based on bonus received vs ann fee paid.  For myself, I have no status, so the Club access would be desired plus checked bags which each of those 4 provide.", "Chase has a tool HERE where you can compare two or three cards side-by-side, but it looks as if they will not let us mix personal and business in the same chart.", "34", "74", "78", "79", "80", "81", "82", "83", "Click here for full rules!", "It comes electronically for Explorer card, but would like to know if the Club card comes with additional passes.", "Really hope they add some PQD or PQM earning   milesforhire likes this.", "My wife and I both hold Club cards.   No extra passes come with it.", "After dynamic UA pricing, I see no value for me in keeping this card. I mainly kept it to waive the close in fee as I'm a basic UA member but I fly alot in biz with miles. Or maybe they'll start waiving change fees?   cuthroat and milesforhire like this.", "How do I get into the club? Hi Maybe this isn\u0092t the right thread but was the closest I could find for my question. I signed up for the Club Card in April of this year. My existing paid club membership expired June 30 of this year. Im not exactly sure how I get into a United Club now. Nothing in the app indicates I\u0092m a member. Do i I show the lounge agents the credit card?? Does it appear when they scan my boarding pay? Just wondering as as I get ready for a trip next week. Thanks...Mike", "Yes, it does. 1, Sign into the App 2. In the upper right corner, click on little circular icon (with what kind of looks like the head and torso of a person inside the circle). 3. The displayed page should show \"Memberships and United Club Passes\". Look for \"Club Membership\". 4. Click on it. You should see the image of your card. In any case, your membership should be associated with your MP#. Show your Boarding Pass to the \"gatekeeper\" at any Club, and it should ID you as a member, and get you in.", "Thanks. I looked there and all I see is my UA Frequent flyer gold card and a link to buy a one time pass. I would have expected a UA Club card also displayed. Does what what I see sound correct? If not I\u0092ll just call UA. I really appreciate the reply. (Edit to add I just went to the FlyerTalk UA forum and a post there is having the identical issue).  Mike", "Interestingly, my wife (non UA elite) just got this offer.", "I am a United member with no status - I just clicked the wiki link and logged in and I have a fee waived offer for the personal Club card then $450 after the first year.  However, it doesn't offer any bonus miles unless I'm missing something.   I don't have a fee waived offer on the Business card but it comes with 50K miles for the $450 fee.  However -is it possible to get the first offer on the business card - free year / no miles?  I don't want to increment my Chase 5/24 count on the personal club card if I don't get any miles bonus for it.", "That seems to be the case for some offers. I've gotten offers with fees waived + bonus miles (I'm a UA *G). My wife (no status) got an offer for fee waiver but no bonus miles.", "Mrs. economyplusfan just got an offer in the mail for $0 annual fee for first year, then $450 thereafter, but no bonus miles. She has never had status with UA. Link is MPClubCard.com/smart. Interestingly, the brochure says nothing about the new boarding pass requirements for club access after November 1.", "Haha I just got back home from work, and there was an offer for my wife. Same link, MPClubCard.com/smart. No thanks, we're not flying United much anymore, lol. Not after the announcement last week. And $450 after the first year is overpriced for domestic club access on top of that. I think it's insulting how in order to use the benefits associated with these cards, which you'd be interested in if you are a non elite, you have to actually purchase the tickets with the cards (and therefore get fewer UA miles than the CSR would earn you on top of losing flexibility using them in other loyalty programs). When a bank issues a cobranded card and it's not even in your best interest to purchase the brand on the card with said card, something is wrong with the program.", "My wife received a postal mail offer for the no-AF-first-year Club Card. Application link below. http://www.MPClubCard.com/world RNE, noting that I updated the wiki. EDIT: She applied and was approved. This, despite the wiki's \"anecdotal evidence strongly suggests that the first-year-free offer... is targeted at UA elites and former paid Club members.\" My wife is neither.", "any advantage of being an additional user on this card? I can't get this card but my spouse can (due to 5/24). Would it be possible to access the lounges using AU card?", "I don't believe an AU can use the club unless accompanied by the primary holder.   RNE likes this.", "33", "73", "77", "78", "79", "80", "81", "82", "84"], "Freedom 2020 Q1 bonus categories: Gas, Internet, Cable, Phone, Streaming": ["Click here for full rules!", "My internet and wireless phone bills were on autopay with a different card.  So for the next 3 months, I just have to manually pay the bills with Freedom before autopay took place at the end of the month.  It's about $300 x 3 months = $900.   But I only get 900 x 2 = 1800 UR points extra because my autopay card is Chase Ink Preferred which gave 3x points on internet and phone.   I guess 1800 points is better than nothing.  I won't be getting gas as I only have EV cars.    I used to get Amazon gift cards from 7/11 gas station, but now I have Amazon 5% card on the account, it doesn't really make sense to buy 5 UR points gift card in place of 5% cash.", "I don't SPECTRUM existed 10 years ago under that name, did it?", "Does anybody know which gas stations in Tennessee sell VGC with CC? There is no 7-11 here. I saw $500 VGCs at Pilot gas station, and they allowed me to buy it with CC, but it didn't pass through, I guess it's hardcoded. Need to utilize my 6 Freedom cards this quarter. It was a blast to buy VGCs at 7-11 in CA, but I moved.", "In that case, you may want to update your FT Profile. It still says SJC/SFO, which made me wonder why you were asking about Tennessee until I finished reading your post.", "Why yes; they've used the name since the 80s. You might be thinking of somebody else.  Spectrum Entertainment Carnival", "Of course I'm thinking of somebody else: The company actually called Spectrum (no other words in the name): https://www.spectrum.net/ That company called exactly Spectrum is a merger of Charter Cable and Time Warner Cable, and so that's why I said I doubt it existed 10 years ago as exactly Spectrum. Besides, while the website URL you gave just calls the company you're talking about \"Spectrum Entertianment\", the actual web page that pulls up just uses the name \"Spectrum Carnival\", with no mention of \"Entertainment\" being part of the name. So they can't even seem to make up their minds as to what their own name is!", "1", "2", "Click here for full rules!", "Does using Chase pay at gas station qualify for gas station category? I would assume it would count since it's like using Apple pay at a merchant.", "Don't see why it shouldn't. Chase Pay is just a way to use your Chase card and doesn't impact what a merchant codes as.", "Well buying GC's at gas stations continue to be problem for the Q1 2020 category. In Q3 last year I was able to go to a local 7 Eleven and got the guy to let me buy an Amazon GC with my CF, no problem. The other night I went to the same 7 Eleven and a different guy was working and said he couldnt do it unless it was cash or debit. I asked why and that I had bought a GC there before, he just said that was what he was told. By who and when? No Answer.  I just dont understand this weird rule with Gas stations?! When home improvement is the category I can walk into any Lowes or Home Depot, go straight to the GC section, pick one up and go straight to the register and pay with my CF card and they dont even bat an eyelid. Zero problem! What sort of fraud are they worried about, my name is on the credit card and I can show my I.D. - What is the problem??? Are they operating under some urban myth of a scam that just isn't true?", "Yes, they are operating under an urban myth.  It is called “profit.”", "Profit for who? Gas station or credit card company?", "It doesn\u0092t really matter which one, or both.  Neither wants a sale with no profit.", "Well in the case of the gas station it could be that they dont want to pay the credit card transaction fee on a non-profit sale, but if so, why dont they just say that? They're usually franchises owned by a small business person so I get that. However, none of the workers or managers there can seem to give a reason other than its some vague rule that they were told by someone. Even with cash purchase of GC's are they making a profit? Why do gas stations carry GC's at all then? Do they in fact get a piece of a GC sale? I dont know but it would be interesting to find out. In the case of the credit card company part of the reason I have one of their premium credit cards is for the points transfer perks. It their cost of doing business and competing with other credit card issuers. I didnt create the game I just play it. If its their rule well then I guess some people are getting around it by searching for a gas station that doesnt care about either scenario. The urban myth part of my comment above was that it seems that there is some feeling of it being a scam to buy GC's with a credit card which is false. I suppose someone could steal a credit card and then immediately go make a big GC purchase but just a minimal amount of verification of identity would solve that concern.", "Why would you expect a clerk in a gas station to understand (and be able or willing to explain to you) the owner\u0092s business model? The gas station owner has no reason to modify his/her business practices to facilitate your credit card spending goals. As to your second point, it is extremely unlikely that your credit card issuer is the same company that is selling the gift cards  (and setting the rules) in the 7-11 store that you wandered into.  They are different companies, with different motivations and different rules.  The company selling the gift cards did not, in fact, issue you \u0093one of their premium credit cards\u0094 \u0097\u0097- even if they both say \u0093Visa\u0094 on the front.", "To be fair, buying gift cards is a well known way of cashing out cloned credit cards. Combine that with gas stations being one of the merchant categories with higher fraud rates (especially since most pumps are swipe only, not to mention that many didn't even get chip inside until recently), I'm not surprised a lot of gas stations don't approve.", "Fair enough.", "Heads up: Apple Music doesn't trigger 5x points on Chase Freedom (and it should)    I just activated a Chase Freedom, and was expecting my monthly Apple Music charge to trigger the 5x point reward as Apple Music is listed under the \"select streaming service\" reward category for this quarter. It only triggered the regular 1x point. I'm assuming that's because the charge appears as \"Apple.com/bill\" on the statement, which doesn't suggest anything about Apple Music. I called Chase to alert them -- this effectively removes Apple Music from the 5x reward category for all customers -- and the representative said they'll escalate the issue. No clue how they'll fix this -- all recurring Apple charges appear under \"Apple.com/bill,\" blind to the service provided -- but anyway, figured I'd give folks a heads up if you want your Apple Music bill to be rewarded accordingly this quarter.", "They didn't at least fix yours?   I contacted Chase one time for missing bonus and they gave me the same standard response saying it is the merchant's decision to select their category but they manually issue the points to me.", "Since Apple Music is listed, Chase should be able to give you a manual credit. There is no need to fix it as those manual credits won't count against your $1500 total.", "Quote: Yes, they said they\u0092ll manually adjust the credit for me. What I meant by \u0093fix\u0094 is how they\u0092ll make sure all customers can get 5x rewards for Apple Music if the charge itself doesn\u0092t trigger the reward, since it\u0092s a vague \u0093Apple bill\u0094 on the statement.", "There seems to be some wonky category postings. Payment made on the same portal (two different accounts) posted to different categories; although I believed the Jan 3 transaction initially had coded to \"Bills &amp; Utilities\" before the switch, which is why I see still 5x despite the (updated) \"Entertainment\" category. Jan 7, 2020 SPECTRUM Bills &amp; Utilities Jan 3, 2010 SPECTRUM Entertainment Not on the Freedom card, but Sapphire had coded an obvious transit charge to the \"Shopping\" category.", "1", "3", "Click here for full rules!", "Freedom 2020 Q1 bonus categories: Gas, Internet, Cable, Phone, Streaming    Any speculation on 2020 Q1? I'm thinking drug stores.  RNE, sure it's not going to be gas stations... not after two quarters of that in 2019.", "Based on past years I predict Q1 Gas Stations Q2 Grocery Stores Q3 Gas Stations Q4 Department Stores", "Based on past years, I predict: Q1 Chase Pay Q2 Chase Pay Q3 Chase Pay Q4 Chase Pay", "Like I predicted  The Chase Freedom 2019 Q1bonus categories will be gas stations, select streaming services, and internet, cable, and phone services.", "Any folks know which (name) of gas stations we can find variable VGC?  Thx", "That's not necessarily the right question.  IIRC, many gas stations now don't allow the purchase of gift cards with credit cards. And that's a policy decided by individual staitions. And brands of gas stations are very inconsistent in my experience in what they stock in stores anyway.  I think the stores are run by local people who make decisions on what to stock, not by some national chain. Since your question is about MSing and not specific to Chase, please continue the discussion in the Manufactured Spending forum, where you'll find at least this one thread: Where to find Gas Station List? marksyr likes this.", "Great, I have a Tesla, don't stream, no cable and my company pays for the phone!   RNE and g289t like this.", "Sign up website is up: https://www.chasebonus.com/", "I think you mean 2020 Q1.  RNE likes this.", "Didn't Chase plan to end the Chase Pay app? I heard that the program was going to online, exclusively at sites that support it.", "I was testing you.", "https://creditcards.chase.com/freedo...ards/merchants No Google Fi on the list", "Hmm no Costco gas on that list. It has previously been coded as.gas.", "It is possible that Chase will code the offer to specifically exclude Costco and grocery store fuel pumps, but it is not likely. They will likely count as usual. When the quarter actually starts, I'll use my card at Costco gas and Kroger gas.", "2", "3"], "New combo after the annual fee increase by CSR?": ["Click here for full rules!", "Those cards are all pretty good on their own or in combination with CSR or Ink Preferred or another. Don't need the CSP and if one has to hold it just for the combo, then I think it's quite poor - the earning rate is non-competitive in my opinion too. I have both the CSP &amp; the Citi Premier &amp; find it an easy decision to prefer the latter. Anytime I have had to choose on travel spending, it has gone to the latter.", "CSR and CSP covers personal car rental primary insurance and ink preferred only covers biz trips right? That is the reason why I am thinking about downgrading csr to csp, and downgrade ink preferred to ink cash, cash actually gets more on return too for paying phone bills, cable etc", "Can't speak for others but the net $150 cost for the card made it intriguing enough to explore since I was canceling the UA MP Explorer anyway.  My travel each year varies quite a bit so I just don't know how well this will pan out but as it turns out, I will need to renew my TSA Pre-Check (maybe upgrading to Global Access, maybe not) this year just before my renewal comes up so even that doesn't count as a possible benefit for the next year's AF.  I thought maybe I might use PP but it really hasn't been an option with my short connection times (and I can get PP through my employer for $85 so that's the most it's worth to me).  DoorDash and Lyft are zero value to me so the entire ROI equation rests on the return from travel and dining converting to UR that I might or might use on Expedia compared to cashback from Discover or my other Visa (with no AFs). At net $250/yr, I'm just not feeling it.", "So to the ones that are downgrading the csr and also have ink preferred. are you guys downgrading to freedom unlimited and keeping ink preferred or downgrading to csp and will also downgrade ink preferred to ink cash?", "See also discussion here: Chase Product Change/Card Conversion: Downgrade, Upgrade, Keep or Cancel? 2020", "I did, but haven't really found an answer haha", "I'm also considering cancelling CSR when the $550 renewal comes around. I've been on the fence at the $450 level anyway. Even though using the $300 travel credit has been zero problem (I usually finish it in the first cycle eligible!) I've had trouble penciling out a justification that the other benefits are worth significantly more than the net $150 AF. Now the net AF will be $250... and while there are more benefits offered I still don't see a compelling win vs. the AF. Yes, I can at least break even, but In a world where I can still slowly churn cards a near-break-even proposition on this card-- where I have to pay net $250 cash upfront just to play-- is not worth it.", "1", "2", "3", "Click here for full rules!", "Tested in 2014: CSP AF now $149? Raising the cost of CSP would make it less attractive for cardholders to downgrade from CSR, -but- I think Chase still needs a personal proprietary card in the $95 range.", "It also wouldn't surprise me if they created a new card and did both ($95 and $150).", "I dont think CSP is a competitive card. The earning structure (2/1 pts) is abysmal at best.   cuthroat likes this.", "You might not see how this could ever happen to you, and I don't see how this would ever happen to me. But it apparently does happen to some people: https://www.flyertalk.com/forum/31863691-post1326.html There are apparently some people out there who just don't travel. But if that's really the case, I have to wonder why they're so interested in the CSR to begin with. Sure, taking a fun trip isn't worthless, but I wouldn't put the value of that at 100% of the face value of the credit. I'd value something at 100% if you would have spent the money anyway but you simply shifted it from one merchant to another or you made the purchase in a different way than you usually do (for example, using a Doordash credit to buy something from a restaurant that you would have bought anyway).", "Quote: Ummm...i think the credit we were talking about previous was the annual free nights from hotel cards not the csr $300. If people really do have trouble using the 300 credit then i think they should really downgrade or cancel imo. For me it's just that i have been with chase for so long and have 6 personal + 1 biz card, so if i do switch systems, it will be a big change.", "Hahaha that's the thing! I don't want to downgrade csr to csp, and ink preferred down to ink cash ONLY to find out that csp's annual fee will be increasing too. That would be a big joke.", "The credit can be a burden if you have credit from multiple premium cards, e.g., Altitude Reserve ($325), CSR ($300), Amex Platinum ($200 incidental/card),  Hilton Aspire ($250 air incidental/$250 resort) ...", "The one most important thing I HATE is the amex incidental fee, had a problem using it last year. And i don't like it how I have to choose an airline when most of the airlines I take are asian carriers", "I have the same situation.  I tend to use the AMEX credits for positioning flights that get me to/from the airport from which my international carrier departs or arrives.", "Travel credits for any traveler should be free cash. Every year I use up CSR $300 credit on the first day. If one has hard time charging $300 on travel they shouldn't use this card. Amex airline incidentals are insults. Just aweful to use. I don't want to buy UAs crap in the air and checking bags? Is AMEX just for people living at airports? Because I rather get in and out of airports fast not a second longer.   chrisl137 likes this.", "If you have other UR cards, it can be quite powerful.", "Exactly.  I think it is next to impossible not able to use the $300 travel credit in a year with the CSR.  I don't think I ever had the credit for more than 2 months.  The hardest part is actually to remember to NOT waste it on any incidentals because I need to use the other cards to get the incidental credit!", "CSP? How? Serious, because I am close to jettisoning it &amp; would like to hear if there was something I missed.   cuthroat likes this.", "It still allows all the same transfer parters and you can use Freedom for 5x on bonus categories and Freedom Unlimited for 1.5 on non bonused spend.", "You know how many people check bags, right? Plus you can use it for E+ seats. It really seems like the AmEx works better for people without status or people who have status to fly a different airline.", "1", "2", "4", "Click here for full rules!", "I have Priority Pass for over 5 years with different credit cards and I use it like 2 or 3 times and not once in the last 2 years. Either the airport or terminal does not have PP lounge, or the lounge would be \"closed\" for Priority Pass members when I got there. The other times I would be flying business and have access to the airline or alliance lounge. I do like the CSR other travel benefits but not sure it is enough to keep it over Chase Ink Preferred which I also have (like OP). CIP is an easy kept because I spent a lot on Google Ads which is advertising with 3X points. I do spent about $10k to $20k on travel a year so in theory CSR should be a easy kept too, but I am considering switching to Amex Business Plat as I do have a few $5000+ charge every month and currently I put them on Chase Freedom Unlimited because they are non-category. So it would be 1.5 Amex Points vs 1.5 UR Points. I probably will just stay with CSR/CFU/CIP combo.", "I get all of the talk of not wanting to pay the extra $100. I wouldn't want to if given the choice. However, it makes me really think about some of the backlash. Are travel credit cards right for you if you buy them to \"break even?\" Is $100 the make or break for potentially many more times that in value? Are there legitimate alternatives that might work better for an individual, or are we just mad at the change? To me, it seems like jumping to the Citi ecosystem is a knee-jerk reaction. If the math works out for you, then it works. However, the 4th night free is extremely overrated (even more so if you have a bunch of hotel credit cards) and the effective annual fee is still $245 (same as the CSR). If you spend a lot in air travel and restaurants (which it doesn't sound like you do) then it might be the card for you. I just can't get behind this card. While we all want 5x bonus categories, I feel this card does it to make up for the weak overall value it presents. If I was to move anywhere, it would probably be to the AMEX Gold. For me, while disappointing, one of the main reasons I chose the CSR is because I get many times the value back of what I put into it quite easily. CFU, CIC, and CF all bring some big returns that the CSR can't do on its own and that you aren't getting elsewhere. For example, I almost spend as much a year on cell phone, cable, and streaming services (all 5X) than I do on airfare, and that's even after greatly scaling back on those services.  I am not one who likes all of the effort and choices required to redeem credits and stuff. I get that. It was one of the primary reasons I did not go to the AMEX system. However, I will absolutely offset quite a bit with the Lyft benefits. I hate doordash, but I'm sure I can find something. It isn't end of UR for me just yet.", "I have also been wondering about whether to keep the CSR next year when my renewal comes due.  The card has been good for me-- I spend a significant amount each year on travel and restaurants, and have been able to take advantage of the PP membership since i'm often travelling international economy.   I'm also a great customer for Chase, since I tend to put most of my spend on the card (not just travel and restaurants), so they're making out on the interchange fees on my non bonused spend.  What I'm no longer sure about is the value of the points I'm acquiring-- in general it has been getting harder to find decent valued award redemptions, and I've been hearing that the chase travel portal doesn't offer the full range of choices that one would find on expedia or some similar engine.  That said, my preliminary looking around isn't making me feel like there's another card that would be better-- certainly there are some decent offerings from citi and amex, but then you're locked into their travel portals or their set of transfer partners as well.  The effect of the $100 fee increase has been for me to think more closely about the value I'm getting from the card, and whether I should be looking at alternatives.  As one of the previous posters mentioned, it isn't enough to eliminate the value of the CSR, but does start to make some of the competitors look more competitive...", "Probably just use CSP instead of CSR with my CF, CFU, and Aspire.  If I was going to change to something else, AmEx Everyday Preferred seems like it would fit my spending pretty well.  Would have to do more research.", "Quote: Sorry, was only allowed 5 posts every 24 hours. To respond to the first one, Yes, the Amex is hard to use and doesn't have primary car insurance, but CSP does have it and that is why I am choosing downgrading csr to csp, downgrade ink preferred to ink cash + freedom or downgrade csr to freedom unlimited and use freedom + ink preferred As to the second quote, yes, I love using PP in asia and europe but PP out of LAX sucks, they don't let people into PP lounge after 7 or 8pm for the past 3 times I flew.  I'm not too worried about the lounge access because I also have the amex aspire that provides it, and I used the annual free night + 250 resort credit and the diamond status. Too bad i didn't get to use the 250 airline incidental fee and the 100 on property fee.", "I agree with you, jumping to citi or amex will be my last option. That's why I am considering csr down to csp, ink preferred downgrade to ink cash +freedom or csr to freedom unlimited and keep ink preferred + freedom. Also, I am worrying about the fee for CSP will be going up too to go against the amex gold just like what csr is doing now", "If you're spending money you wouldn't otherwise have spent or taking trips you wouldn't otherwise have taken just to burn credits, you're not really saving anything.   Diplomatico likes this.", "Winner, winner!  Would you like the stuffed pink flamingo or the giant panda teddy bear?", "Loll i do weekend vegas trips with my friends every 3,4 months anyways, and tahoe once in summer and once in winter. So not really spending money that I wouldn't normally spend for just to use the nights. I actually do use them on my trips anyways.   Diplomatico and STS-134 like this.", "So do you guys think there might be a annual fee increase on the CSP soon too?", "I generally agree that if you never travel then the card is probably not worth the fee.  The 3x pts on restaurants are nice but this is first and foremost a travel card.  That's why Lyft is such a great addition.", "While no one knows for sure, if I had to guess, I would say no. They have sure marketed the heck out of this card. So I would assume it is profitable where it is at. Remember, it's really only an effective 2.5% return on travel and dining (I get some of the transfer partner stuff). There's not a whole lot here to make this card unprofitable for Chase. Previously, I couldn't find many instances where a traveler would be well off getting the CSP but not the CSR. With the fee increase, I suppose that differentiates them a little more now.", "I used to figure the break even was around $4k bonus spend.  Now it seems more like $10k.", "You might not be saving anything, but taking a fun trip with your credits isn't worthless (although I have a hard time understanding how anyone who has the CSR would need to \"burn\" the travel credit.  It is about the easiest credit in the world to use).", "I will be surprised if the CSP doesn't go to $150 eventually.  When, I don't know, but I have already started looking around just in case.", "1", "3", "4", "Click here for full rules!", "New combo after the annual fee increase by CSR?    Hi all, due to the new annual fee increase. I am thinking of either downgrading the CSR to freedom unlimited and keep the other freedom card + ink preffered combo, or should I downgrade CSR to CSP, downgrade ink preffered to ink cash + use freedom (ink cash actually gets 5% on cables and phone bills and 2% gas n restaurants, ink only gets 3% on travel and phone bills etc). The other thing I am also worrying about is that I get a feeling the CSP's annual fee might also be going up to go against the AMEX gold. It's either that or I will be moving all my trio to citi. I did have prestige back in the days but have already canceles it. And prestige+premier seems like a pretty good combo too. Amex isn't worth it to me because I travel mostly to Asia ans Europe where amex is not that useful, plus there's no amex centurion lounges there except i think in Hong Kong. The airline incidental fee is also too hard to use. I didn't get to use it on my Hilton Aspire card last year. So any thoughts from you guys? Thanks! Any thoughts from you guys?", "Devil\u0092s advocate question.  If you justified the card at $450-$300, why does it suddenly go sour at $550-$300?", "Because I don't use lyft or doordash at all. I barely used uber like twice in a year for the past few years and I mostly eat at home or straight at the restaurant as I like my food hot and fresh. Not a big fan of food delivery as the food will be mostly just warm by the time it arrives to my door. So the increase of $100 for something that I hardly ever use or have to figure out some ways out of my normal daily routine to use is not worth it for me.   miles4CDG and ExplorerWannabe like this.", "forget Lyft and DoorDash for a moment.  Do you not travel enough to get the value from the net $250 fee?  What would be the break even spend on travel to justify $250/yr v putting travel on another card?  Does Priority Pass factor in? I am really asking this for myself too.  I am on the fence.   Super Mario likes this.", "Not anymore. I used to travel to asia every month from LA and goes to europe every three months. But now I hardly travel twice a year and I have other cards as amex hilton aspire which also gives pp lounge access, ink preferred, both old and new ihg cards, marriott premier and hyatt card. I also feel like that if chase wants to match with amex, at least also give some sort of hotel or airline status, even though most of us already have status through some of the cobrand cards, but it would at least be an easier feeling for me.  So csp literally earns only 1 point less on travel and dining, but the annual fee is much lower and i can still transfer points. Citi prestige's earning structure does sound appealing though tbh", "Not to stray too far from the original topic but do you really need five different hotel co-branded cards when you travel \"hardly twice a year\"?  You may want to look at more than just the CSR during your credit card portfolio review.   TommyD2, mhdena and mctaste like this.", "Those are fine. The annual fees pays off itself easily from the annual free night. I can always go to vegas or sd or sf for a short trip to use it up. I just don't have enough time for big trips anymore. I might also downgrade the aspire after this year too.", "Is there any credit card out there that has comparable protection for travel?", "I too have been grappling with this. Ever since I got an Amex Gold, that's been my go-to for dining expenses (except for the rare occasion a place does not accept Amex).  I can't get the Amex Green card, so I'm thinking of USB AR for travel expenses (and mobile wallet).  Sounds like it offers good travel protections and primary CDW, plus 1.5cpp redemptions (and you can redeem against against most travel charges made to the card). I'll continue to stay invested in the UR ecosystem, but I can probably do that just as well with CSP.  (If I was under 5/24, I might try for a CIP.)", "Amex plat has just added travel peotection this month", "I agree with OP that CSR offering some hotel status would be a good option. And that hotel CC annual free nights are enough to keep them around. I think you\u0092d need ~$10k+ annual travel+dining spend to justify keeping CSR. Used to be ~$5K.  Reduce both by whatever value you put on Priority Pass.   Adelphos likes this.", "Yes but there are two considerations 1. Amex still doesn't include primary rental car protection inside the USA for zero cost.  2. For someone who (like you said above) rarely uses Uber /Lyft / food delivery services, you won't find value in the Amex Platinum credits either and the airline credit is am ongoing game to use in contrast to chase. There are other perks for Amex Platinum I love (the expanded lounge selection and international airline program) but the credit situation isn't any less annoying than chase.", "OP, don't you put any value on the Priority Pass membership?  If you're traveling to Europe, it can come in really handy.  That's been my favorite benefit, along with the 1.5X redemption on the Chase travel website.   Also, Door Dash has a pickup option.  So it's easy over the course of the year to spend $60 ordering food and pick up on your way home.", "I'm not OP, but I put a very high value on Priority Pass. The additional benefits included in the changes to CSR are worth $0 to me, but the additional $100 annual fee doesn't make me flinch, primarily due to Priority Pass. I'm not sure how high the AF would need to go before I would reconsider. I also have somewhat high spending, some of it organic, and some of it reimbursed. I spend a good bit on travel, which multiplies the rewards. I mostly fly economy, and book through the Chase portal (if I have UR points available), so I benefit from the 1.5x UR point value. Because I am an expat and do not live in the US, Amex is worthless to me. I get high value out of my Chase cards.", "If you use the Priority Pass two times in a year with a gues, you've almost paid for it ($227). So, if you use it that much or 4 times a year, CSR is still worth it. Obviously, YMMV.", "2", "3", "4"], "UR to United transfer is not reliably instant.": ["Click here for full rules!", "This is good to know. Perhaps all those transfers were instant after all but there was some IT issue in which we couldn't actually SEE the points but they were there. However, my only caveat is that for me the email from Chase that the transfer was successful didn't come until the exact time when I was actually able to view the miles on my account. I'm wondering if the above 2 posters got that email from Chase or not and if yes, when.", "Update: this morning I booked it, it still shows my original number of points in my account, but I show a pending charge on my Sapphire Reserve for the taxes. When I view the reservation online, it says this still: Your purchase is confirmed and your reservation is processing. We'll email you when your reservation has been ticketed Has me worried! Think it will go through? It uses Ethiopian and Egyptair flights...  --Kyle", "This would be great news if true. Please provide more DPs", "Chase sent two email messages, one saying the transfer was in progress and one saying the transfer was complete. The two messages had the same time stamp in my email client. (I did not examine the headers to see how many seconds, if any, separated them; the client showed the same hour and minute on the time stamps. I can look for the seconds if someone thinks it is important.) I do not recall whether the messages arrived before I tried to make my reservation, but I believe they did. Also, based on the time stamp of the message from United saying that my reservation was \"processing\", I believe I received both Chase messages before starting my United reservation.", "Ok, so then your points were actually in your account instantly but you weren't seeing them for some reason. When I made my first transfer I also got both emails seconds apart and logging in and out allowed me to see the updated mileage count in United. However for the second transfer I didn't get the second email until 13+ hours later so the points in fact had not been transferred until then.", "In my case: 1/17, 5:20 PM - points transfer in progress email from Chase. Balance showed 24,xxx points (transferred 136,000 points). 1/18, 11:17 AM - flight booked with confirmation email saying: \"We are processing your reservation and will send you a confirmation email once this is completed. This process usually takes less than an hour; however, in rare cases it could take longer.\" Credit card was charged for taxes, points still showed pre-transfer balance.  1/19, 8:01 AM - points transfer complete, balance now shows 160,000+ points (flight is 160,000 points).  Now, 1/19, 10:30 AM, United balance still shows 160k points, flight confirmation still says: \"Your purchase is confirmed and your reservation is processing.\"  Really hoping this gets \"processed\" soon!  --Kyle", "That is my assumption. FWIW, that was after logging out, clearing cache and cookies, and logging back in.", "2 Point Transfers - 1 for 7000 points - in progress email received 1/19/20, 11:45 am - points have not posted yet  1 for 67,000 points to my husbands account from his UR, 11:55am in progress email, 11:56 complete and points there Frustrating.  Second Frustration - phantom availability for EVA on United. Ugh!", "This advice was great, thanks! I transferred 260k points on Saturday around noon. This morning (Monday) I called United and had them hold the tickets for the day, and long story short, they took care of me. Long story a little longer.. A United rep saved the tickets for me this morning at the award points I wanted (274k, 1k under my transferred points and what I have in United). She then mentioned she needed to go back and add my middle name so that the passport will match. Well, when she did this, there was then only 1 award flight left. Points finally transferred this evening (Monday around 60 hours later).  So I called United and let them know what happened, and 4 hours later, it's not their fault really... I have my reward tickets for the 274k points.. and then honored my initial saved tickets.  Though I'm typically not a fan of United's customer service.. they are shining over Chase and their slow transfers!", "3", "4", "5", "6", "7", "8", "Click here for full rules!", "I had two friends transfer points from their  Ultimate Rewards accounts to newly created mileage plus accounts. One was instant but the other we're still waiting on. Of course both companies are like ¯\\_(ツ)_/¯. We'll wait another day or two and then start to escalate. Hopefully this will not be too big of a hassle.", "DP: Transferred points about 12 hours ago, and this transfer has still not arrived. Transferred more points about 20 minutes ago, which arrived instantly. Called Chase, they said it's a United problem. Called United, they said wait 48 hours then call us again but we won't open a case before that (but, by the way, would I like to apply for the United Club Card???). Meanwhile, the first award I wanted is gone. Fingers crossed on the second.  Random theory - second transfer happened soon after midnight Eastern. Wondering if something resets at that time to make these more likely to succeed?", "7/25/19 50K Transfer Not Instant Chase No Help    I tried to transfer 50K UR points to UA MP for a flight tomorrow.  I have transfered points from UR to MP before and it has always been instant, and I had never read about a glitch prevening instant transfers from UR to MP. I called Chase and they gave me the BS that it can take 1-7 days, even though it is typically instant.  They had no idea what the issue could be as to why the transfer was not instant.  They did an escallation but said the escallation team might not respond for days. I have another ticket booked for tomorrow on DL but the UA routing has better times. People clearly rely on the instant transfers, and it is maddening that Chase reps have no information as to why the transfer is not working and they don't have a way to interface with the back office teams that handle the transfers. Chase (and any other large company) treats you like garbage whether you have a food stamps card or a Sapphire card; same difference; if you try to step out of their scripted answers, for which they have no explanations or help.  The reps don't have any resources besides the scripted answers they give like bots. What if someone was transferring miles to see someone that was terminally ill, it sounds like there is nothing Chase would do! And they do create the impression (despite what their fine print says) that the transfer will be instant.  I have never read about a problem like this until googling and finding this thread.", "I am now victim to a non-instant UR to UA transfer . I think my mistake was doing 2 separate transfers to the same account on the same day (~1.5 hours apart). First transfer to book outbound tickets went through instantly and I completed my booking. At that time the return was not available at all on UA. About 1.5 hours later I checked again and voila, my desired return popped up. So I went to transfer more points to UA but unfortunately it was NOT instant and now I'm afraid I will lose the return award. And reading this thread I know there is nobody to talk to about it. So infuriating.", "For those of you who have had delayed transfers, I'm wondering about the timing of the emails from Chase. For my first transfer I got 2 emails seconds apart - first one to tell me that its processing and second that its complete. For my second transfer I only got the processing email so far. Did everyone get an email telling them the transfer was completed when it finally was?  I am so nervous that my awards are going to disappear and am at a total loss as to what to do.", "Just to update, I definitely think that the issue happened because it was a second transfer to the same account within a short time span. Those 2 transfers I made were to my spouse's UA account. First one successful and second one still hasn't posted. Not wanting to risk losing the awards I transferred the points to MY United account instead and it was instant. Awards have been successfully booked. I should have done it this way in the first place but I was thinking that in the off chance we need to cancel within 24 hours I'll have all the points in one account. Now they'll be in two... Now I'll see what will happen to that transfer that has still not posted. I'm not happy that I will have extra miles parked in UA but at least now they don't expire.", "I seem to be having a running monologue here . Happy to provide data point though. I tried contacting Chase Support via Twitter PM and telling them 2 transfers were instant and one wasn't but they just repeatedly said I need to wait the 7 days. I got the email stating transfer was complete at 9:02 a.m. this morning, precisely 13 hours and 15 minutes after it was initiated. This has no rhyme and reason. The awards I booked last night are actually still wide open but there was no way for me to have known that. My ideal outbound flights had no longer been available by the time I finalized my plans and I didn't want this ideal return flight to disappear on me too. So now I have miles parked with United with no future plans for them. Oh well, first world problems .", "Yet another victim here. UR points not yet transferred (more than 24 hours)…. (This was not any special situation...just a single transfer of UR to UA) Wrote to Chase....they gave the same BS \"will take 7 days to transfer\". This really sucks. Chase should stop saying on their website that most transfers are instantaneous .", "I recently did two transfers to my UA account within a short timespan (bad math, don\u0092t ask).  Both were processed instantly.", "I guess it's a YMMV situation. Like I said, no rhyme or reason because I ended doing a third transfer which was instant so 2/3 were instant.  Its just frustrating that #1 there's always the possibility that a transfer will NOT be instant so you shouldn't expect it to be and #2 when it's not instant you don't know if it will take 10 hours, 25 hours, 3 days, or more. So if you have your eye on an award and don't want to risk losing it you will need to do another transfer and hope that one will be instant.", "How long chase points transfer to United for AU?    I need to transfer 120k chase pints to my AU\u0092s United account . By rule, it\u0092s possible and I did it last time but the transfer time wasn\u0092t instant. It\u0092s instant if it\u0092s my own United account. Has anything changed or any data points on this? I\u0092m afraid by the time points transferred to my AU, the seats are gone!", "This is likely just a coincidence: UR to United transfer is not reliably instant.", "It happened to me today. It's only been 1.5 hours so far, but I'm afraid it will take awhile. And this is for a big multi-city trip to Africa with only a few seats remaining, so I'm pretty nervous! I transferred 136,000 points! I imagine the size could be part of it, and/or the fact that I didn't have my United account linked with Chase until today. Fingers crossed that it goes through soon! I'm also on hold with United hoping they can hold it for me until the points post (tomorrow?)... --Kyle", "maybe the points are there even though United says they are not    I transferred points and they did not appear at my (brand new) United account. I logged out, cleared cache and cookies, and logged in; still no points. Nonetheless, I proceeded to book the reward flight that had caused me to transfer points in the first place. The booking went through, and a confirmation page said the points were deducted from my United account, which then reported that I (still) had zero points. It was my first time booking at the United web site and I was just looking to see what the reservation web pages would look like while I killed time hoping the points would appear; I was really surprised when the booking went through. My suggestion for someone whose points don't appear is to try to make a reservation anyway. Maybe I got lucky and the points appeared after I last checked and before I made the reservation, or maybe the points are there and the web site's right hand isn't talking to the left hand.   kyamnitz likes this.", "Thanks for sharing. It's now been 17 hours and the transferred points don't show up in my account. I called in and they put the flight on hold for me. I'll try to call and see if they can book it with the points that don't appear to be there! Thanks, --Kyle Update: I tried to pay for the reservation online (despite only showing 24k miles for my 160k mile trip), and it appears to have gone through! I got this email: We are processing your reservation and will send you a confirmation email once this is completed. This process usually takes less than an hour; however, in rare cases it could take longer. So, maybe this works after all! Thanks!", "2", "3", "4", "5", "6", "7", "9"], "JPM Reserve VISA Infinite replaced Palladium": ["Click here for full rules!", "When I asked about getting a NFC version they didn\u0092t offer the plastic card. They mentioned that the current metal card couldn\u0092t offer the NFC version but the would be releasing a JPM Reserve card similar to the CSR with the metal sandwiched in between the thin plastic covers.", "Any issuer can close any credit card account.", "Am interested to see if any CPC member is able to renew the UC membership later this yr", "Can a new CPC accountholder get the JPM Reserve card? If yes, can a Sapphire Reserve product change to this or would one apply for it and then downgrade/cancel the Sapphire Reserve?", "CPC cannot get this card anymore and you can not product change to it.  I had a CSR and had to apply for a new card", "So is there any reason to get CPC over Sapphire banking other than signup bonus (assuming not interested in any investment services)?", "I would say it depends on your needs. CPC is nice as you have a dedicated person and team to assist you with everything and it even carries over to when you call in for cards. I would say look at the benefits that CPC offers and see if they will be of benefit to you.", "I requested the brown plastic version of this card because the rep stated it would be contactless, but turns out it\u0092s not. What\u0092s interesting is that the card artwork on the app changed from silver to brown to show it was in plastic status. When I called back to change to metal status again the artwork immediately went back to silver. Thankfully the expiration and CVV still remain the same.", "Interesting. I didn\u0092t have that happen but when I ordered plastic version they did ask what my preference for renewal would be which might be what drives it.", "Just got my new UC card exp. 1/31/21...Have had JPM Palladium/Reserve with UC membership for about 10 years, although not a Private Banking client (but a CPC).   Boraxo likes this.", "My UC expires in June.  Will see if I'll  get renewed.", "Can anyone  cite one post in which renewal was not given? Can’t fathom why this is up for discussion.   schalliol likes this.", "I don\u0092t think renewal is the issue. The issue is adding it for the first time if you are not Private Bank.", "At this time,  no one is getting the card who is not PB.", "Private Bank is probably cost prohibitive to get a credit card at this point?", "32", "82", "122", "126", "127", "128", "129", "130", "131", "Click here for full rules!", "Did they just change the UC benefit recently?  This is the first time I heard about the change.", "I was told in August that they could not add it to mine until my account reflected being linked to Private Bank. Multiple reps confirmed.", "Even with the UC access, $250 is a stretch considering I don't use DoorDash or won't spend more than $700 on Lyft.  So I'll probably just have to cancel the card after it expires later the year.", "I think there is something else going on here. My UC membership was renewed.", "Could be only new members it applies to.", "Was told the new NFC version when it\u0092s released will be similar to the CSR card with the metal sandwiched between plastic. They didn\u0092t mention switching from the all metal card to a plastic but that in the near future the new version would be replacing all cards. i also asked about the United Club benefit and was also told it is now only available to JPM Private Bank clients. I asked if my friend who is a CPC Client was eligible and the representative said it has to be approved from the Private Bank to receive the benefit. When he asked me if I wanted it added I mentioned I\u0092m already a Lifetime UC member so aí didn\u0092t need it.", "747FC, when did you get your UC renewed?", "My Renew date is 1/1", "Did you ever have the UC membership associated with your JPMR?", "Yes but I have a Private Bank relationship", "Out of curiosity, who here on the forum has the UC benefit that isn\u0092t a JPM Private Bank client? Anyone have the UC benefit without any banking relationship with either JP Morgan Private Bank or Chase Private Client CPC ?", "I am not, I have had a linked UC for the last several years.. My UC expired and can confirm it was renewed into 2020, automatically.", "Also curious if anyone who had the card before the transition that hasn't had the UC and has tried adding without any banking relationship with either JP Morgan Private Bank or Chase Private Client CPC", "+1 as I'm thinking about pulling my assets but would like to keep the JPMR card and of course the UC.", "I don\u0092t think they can cancel a card due to consumer laws regarding personal credit cards but since the UC benefit is unpublished they could most likely cancel that benefit. I believe that is why it\u0092s unpublished.", "31", "81", "121", "125", "126", "127", "128", "129", "130", "132", "Click here for full rules!", "When JPM changed the card from Palladium to the Reserve, I received both the metal and plastic version. I currently only use the plastic version. The metal causes too much attention.", "With the changes to the CSR including $550 annual fee next week and useless hard to use extra benefits, I wonder if they plan to change the JPMR as well? I hope not!", "J.P.Morgan Reserve® gets you access to: Free DashPass for up to 2 years, immediately upon activation. Normally $9.99/month. Hey look, we finally get something more than the regular CSR! 😛 Regular CSR only gets 1 year free. This justifies the entire card! :-P", "According to this link, CSR is 2 years too:   https://www.doctorofcredit.com/chase...onth-for-free/", "Oh well, one of the blogs had said it was 1 year. *shrug*", "Just looked at my JPMR and CSR offers page. Each had Dash Deal, and wording appeared identical.", "Aside from $550 and Door Dash, any other cahanges?", "Pink Lyft membership starting on 01/12.  https://www.doctorofcredit.com/rumor...h-credit-more/ 747FC likes this.", "After removing the price protection and other benefits $100 certainly doesn\u0092t cover these locked-in benefits. Same secondary user AF?", "Called into card services today and asked about the NFC card for the JPM Reserve and was told that it will be available in the near future but the card will be like the Sapphire Reserve plastic with the thin metal sandwiched in the middle. Representative said they couldn\u0092t do it with the solid metal card currently used.", "Did they suggest that essentially if you request plastic you can have it or they\u0092ll replace metal with plastic with NFC?", "Is the AF increase confirmed yet? I was not able to find it on Chase website.  The only CONFIRMED change is the DoorDash benefit.  Anything else is just a rumor.", "Just called. Same changes and fee change as CSR. United Club remains for those that are eligible still.", "Too bad. Without the UC I would probably cancel due to the increased AF. I am a big fan of Lyft (almost always a better experience than Uber) but I don't need my bank telling me I need to spend $100 a year with a specific merchant (and even worse if they copy Amex with the monthly use-it-or-lost-it credits). A pitiful effort to mask a price increase with a rather dubious perk. Now to be fair it could be worse, just check out the recent bloodbath with the CNB crystal card.  I probably average $200/yr on lyft so I value that at $30. My kids use door dash so perhaps that's worth another $50. So maybe it's close to a wash on the AF increase.  Also don't all JPMR customers have the hidden UC membership or am i missing something?", "credits are all up front. No monthly like American Express. UC is only for private bank customers now.", "30", "80", "120", "124", "125", "126", "127", "128", "129", "131", "132", "Click here for full rules!", "Not necessarily. Now, with the loss of the trading fees, private banking has been come hot. I get calls all the time to switch.", "I'd personally love to see a more premium Chase card. I have the CSR and use it all the time but with the rumored Optio it's gotten me thinking. I would probably be the market for the $1000-$1500k annual fee card which would entirely depend on what it offers. I love the redemptions Ive gotten with Hyatt and in my opinion is one of their goto transfer partners. In addition, I wasn't happy when they got rid of Korean Air for Jetblue. I think they should be marketing these premium cards to people who will travel internationally, I look at JetBlue as a budget US airline. Don't get me wrong, I fly Spirit, Southwest and Frontier if I can or need to but I don't need a card that collects points for these airlines. In closing, a premium card, perhaps one that requires CPC membership and gives some great hotel status and private airline lounges like the UA clubs and Id probably be all in at $1-1500k depending on the details. I think it's just a matter of time anyway, as the CSR is basically the same as the JPMR and now with AMEX raising the annual fee for the Centurion card it's all but assured they will come out at some point with something in between the Platinum and the Centurion.", "True - Schwab, Fidelity, Vanguard do not offer true private banking relationship. But for a much lower fee they offer live advisors that pretty much replicate the CPC advisor experience (and investing strategy) for a fraction of the cost. CPC is not a true private bank either compared to the services offered to high net worth clients at First Republic, Mellon, not to mention JPM clients with $10MM+  And of course not even close to Swiss private banking. CPC is the poor man's version of a private bank designed to lure clients below JPM requirements but who have $250K to invest.  Here's what I value as a CPC customer (in order of value): Manage IRA accounts (cookie cutter generic index funds decided by some team in NYC) including periodic rebalancing (Schwab,Fidelity,Vanguard all have tools that do the same thing) Financial planning (i.e. projecting retirement income and expenses) No ATM, forex or checking overdraft fees (also free @schwab) Free safe deposit box No HELOC fees  Culture Access card (mostly gutted since original rollout)  What I don't get - and need - is a turnkey advisor that will manage every single one of my accounts including 401k, trust accounts, insurance, stock options, etc. Also have yet to find a reputable advisor that understands global diversification, i.e. investing in overseas real estate, offshore accounts. Quote:   Bingo! I'm sure that's true for most of us in this hobby. We are happy to pay AFs but only for TANGIBLE benefits that provide real quantifiable value.$300 in travel credits (that I receive every year on my first statement) = tangible value. Free admission to United Clubs that I probably use 10-20x per year = some tangible value (I value it but I would never pay to enter a UC). Monthly Uber credits = some tangible value but I use Uber sporadically so would never max out. Marriott Gold or Hyatt Explorist status = zero tangible value, no real perks of value. If AF is not &lt; tangible benefits then card is cancelled a year after signup bonus received.  Quote: No, what I said was CPC customers like me (who don't have millions under management) will flee if they are relegated to an inferior product like CSR. It has nothing to do with the \"shiny card\" (as I noted) and everything to do with UC and PP membership (which unlike Amex includes restaurants and 2 guests). If you want to see what happens when a card is gutted just check out the City National Bank Crystal Card discussion. Everyone is severing their relationship with CNB, not just cancelling the card. Chase is not so stupid as to blow up relationships with thousands of CPC clients by downgrading them, though I would not be surprised to see an AF increase.   Nevsky and Nick92 like this.", "There has to be a way to get a palladium without JPMPB", "New applications for Palladium were discontinued in Aug/Sept 2016, over three years ago. If you really meant JPM Reserve, then I\u0092m not aware of any substantiated loopholes that exist, except those that were short lived during the changeover in 2016.", "The term \u0093loophole\u0094 has long-been used to describe non-PB access to the Palladium and JPMR. Does anyone out there have any evidence that a mistake was made and subsequently corrected? Or, did Chase affirmatively decide to offer JPMR to their legacy Select  cardholders, but only until a set number of cards were issued? and a big Thank You, Magic Pickles, for alerting us about the opportunity back in 2016.", "JPM Select accounts were auto-converted to Sapphire Reserve in December 2016 unless the account holder called and asked to PC\u0092d to the JPMR, which was permitted regardless of banking relationship. This was not a \u0093loophole.\u0094 An obscure blog leaked the JPMR app at the beginning of September 2016 and a few may have been approved before that loophole was promptly shut down and the fax number disconnected. What made it obvious was the large volume of apps faxed in with \u0093For Bank Use Only\u0094 section at the bottom blank. A couple of trolls then falsely claimed all their accounts were shut down just for applying and being caught submitting via the leaked app. All that actually happened when the loophole was closed was receipt of a letter politely denying their app due to it being submitted through an unapproved channel.  I am not aware of any JPMR accounts being approved and then closed by the bank.", "Actually, the default auto-conversion was not to the CSR, but to the CSP  ( see  J.P. Morgan Select Visa Signature ). IIRC, PC to the CSR was not even allowed. As you noted, PC to the JPMR was.", "You\u0092re correct, it was the Preferred, with the same $95 AF.", "Plastic version    Would anyone who has the plastic version of the JPM Reserve be willing to share a photo of it? Along the same lines, are you allowed to keep the metal + plastic version simultaneously?", "You can have both. The cards are identical with the exact same number, expiration date and CVV2 codes. If you google images of JPMORGAN Select card it is the same as the plastic version except it says visa infinite", "Thanks!", "Here is the image from google of the plastic version. Keep in mind that the current version will say visa infinite", "Can confirm, can use and operate both cards at once Also the concierge and travel platform feel extremely sub par in relation to what you can achieve yourself and online.  Not a black card holder, but  in comparison(perhaps ignorant to think otherwise) the JPMR concierge cannot arrange anything spectacular and always comes back with a default response for me. Keep the card for the UC and the 300 travel rewards, among a few other travel benefits.  Cardholder since 2013-2015 era and not a single other Chase or JPM relationship. Can also confirm that as of now, no contact, peep, discussion, cancellation notice for not having these. Would be interested to see higher fees and better perks.   Boraxo likes this.", "I was told a couple years ago (by JPM) that they made it so you have to now convert to plastic from metal vs just get a plastic set as they used to offer when the card came out. As such, if you go to plastic, the renewal will come as plastic (you can switch back). I like the durability of metal but sometimes like the lower profile of plastic. is this still the case?", "29", "79", "119", "123", "124", "125", "126", "127", "128", "130", "131", "132"], "Chase Priority Pass memberships (Sapphire Reserve, JPM Reserve, Ritz)": ["Click here for full rules!", "A+ Thanks!   CorgiMom likes this.", "If I downgrade/cancel my CSR, will my PP membership cancel also? TIA.", "Yes, or even worse, it will still be active and Chase will pass through each $27 entrance fee to your downgraded card.", "That's not necessarily a horrible deal.  There are definitely some PP lounges that I would gladly pay $27 to access. Consider that one-time passes to airline club lounges usually go for $50 or $60, have no hot food (except maybe soup), and charge for decent drinks.", "is there a limit to how many guests we can bring with ritz carlton priority pass? someone mentioned its unlimited, but I just called JPM executive desk and they said we can only bring two guests....", "I don't know about the Ritz Carlton card but the Sapphire Reserve started unlimited and quite quickly changed to a limit of two free. You can bring more but will be charged for them. The lounge will not know this.", "Chase announced changes for Sapphire Reserve and JPM Reserve, but not for the Ritz Carlton Priority Pass. I think sleepy3192 is asking if Chase has actually changed the policy for Ritz memberships without bothering to notify the cardholders.", "was it always unlimited though? it seems like always a hit/miss for questions related to ritz carlton card when calling JP Morgan....", "Ritz was always unlimited. I have even got it in writing several years ago. I don't think there was any change, and phone agents are probably not that versed in the intricacies of the Ritz card. As opposed to the clear disclosure on the Reserve side, there is no limitation pointed on the Ritz benefits site (though it miight mean nothing).", "I asked another poster in a different thread, but perhaps you might know the answer. How does the lounge bill you when you're with immediate family (spouse + 2 kids) compared to you're with \"guests\"? Do they have a different way of billing for immediate family so that you don't end up paying for the second child (if they bill as 3 guests)?", "This is a GREAT question, and one that I asked as well. The lounge bills you the same way as usual, and you sign for yourself and the number of guests.... They seem to have nothing to do with who those guests actually are and the lounges have always given me a disclaimer that they don't know how any individual's PP works, and I may be charged for the visit and for the guests depending on my provider. So how does it work? In my experience they have usually also scanned each boarding pass so my guess is that Citi gets this info and perhaps bases it on last names... However... my wife doesn't share my last name so I was still worried, so I did call Citi to check, and they indicated that if I was ever charged for a guest that was actually a family member, I could just call them and they would clear it up. Fortunately I haven't had an issue in the 2 years since that call even when checking in 4 people (wife and 2 kids) on the card. I just have to make sure I use my Citi PP and not my Chase by accident!   nort likes this.", "This is very informative. Thank you!", "35", "75", "79", "80", "81", "82", "83", "84", "Click here for full rules!", "I've yet to run into a lounge that didn't take the digital card, so while the PP physical card comes with me it usually stays buried in my suitcase for my whole trip.", "Good idea.  How did you get the digital card?", "See the wiki at the top of this thread: Quote: I think that's been there a while but assume it still works, please report back if not...", "I honestly don't remember, though @eng3 's post above mine demonstrates one way to get a digital card while still waiting to receive the physical card.", "I just called and they gave me my membership number and expiry date over the phone.", "Yes, that is how I got the digital card.  That website would not take my number until the day after I called them to get my number.", "Once one is approved for the CSR can one request the PP cards immediately without receiving the physical CSR?", "My recollection is that I could enable it on the web immediately but it takes a while to come.", "I upgraded my Marriott to the Ritz card last week, and sent a SM requesting the PP number. Chase wrote back quickly that it was requested, but said I would have to wait for the card to show up in the mail. As per the above posts, this is not true. You can get the digital card before the physical shows up, however have to be transferred to \u0093Chase Benefits Administration\u0094. Chase customer service can transfer you, or you can call the direct number: +1-866-263-4292 You don\u0092t need to provide a credit card number, just name and billing address, and they\u0092ll give you your card number and expy date.", "I'm pretty sure PP can also give it to you over the phone.", "Moderator action    Discussion of using Priority Pass at LAX has been moved to the Airport Lounge forum: Priority Pass at LAX", "I just cancelled my Amex Plat which I was actively using my Priority Pass card. I've had the Chase Sapphire Reserve for sometime now but never activated the PP membership. Any idea what I need to do from here to activate the Chase PP? TIA", "Wikipost lists these steps: To sign up for Priority Pass Select, as soon as the account shows up online: 1. Click on Go To Ultimate Rewards. 2. Scroll down to the very bottom left and click on \"Card Benefits\" 3. Activate Membership to request card. 4. Card can't be expedited. Some members have reported success in charging the lounge access to their CSR account and requesting a refund from Customer Service. However, others have reported that the lounge access was refunded via the travel credit.", "Thanks just activated, and Ouch! I fly Jan 11th, 10 airports to go to.  So I can't merge my old Amex Plat PP to my CSR PP? Totally new PP member #? Thanks for the help!", "Completely new membership, and you will need to create a new Username for prioritypass.com . You may be able to get the virtual card activated before you receive the physical card.   SuperKirby likes this.", "34", "74", "78", "79", "80", "81", "82", "83", "85"], "Chase Avios Earning Credit Cards: BA, Aer Lingus, Iberia- Up to 100K Avios &amp;  more": ["Click here for full rules!", "Not quite. You need to use the Travel Together voucher at the outset of the initial booking, not at the end (the \u0093merger\u0094). As a result of that, you only get one $200 rebate on the booking, not two.  The rebate is paid once per booking, not per person.", "love the bos-mad in business for just 68K off peak. Loading up on avios. Both wife and I got the Aer Lingus, BA and IB cards.   StartinSanDiego likes this.", "As I read the T&amp;C, it states that for the rebate the travel must originate from the USA. (USA-EUROPE) So doing a one-way from EUROPE-&gt;USA would not qualify for the reimbursement", "Yes that is correct. But two one ways on BA create lower surcharges than one round trip. That is why I had EU-US as separate booking.", "Anyone know if Chase also offers no-fee downgrade options for the Iberia or Aer Lingus cards?", "1", "2"], "\"Chase Offers\" (Shopping/bonus incentives for various Cards)": ["Click here for full rules!", "20% off Samsung    I got 20% off a Samsung Tablet today. Sweet. Plus it was discounted by $70.", "Just received a good one. $500 back off $2000 from Torneau. Perfect timing for Christmas.", "Tourneau's offer through American Express is: Spend $500+, get 12,500 Membership Rewards® Points ...so if one had both offers and could do a split tender it might be possible to redeem both. (American Express offers are frequently published in both \"points\" and \"cash\" variants. I do not have a cash version, but it may exist.)", "Tried to use an Enterprise 15% offer. Reserved the car on the official Enterprise.com and swiped Chase card at the rental office.  All emails and physical receipts state perfectly clearly Enterprise and nothing else.  However the card transaction says “Island Rental” and makes no mention of the word Enterprise at all anywhere.  It’s been over a week and the statement posted yesterday and nothing yet.  Will it make any difference if I call?", "Yes, you can open a case with Chase about it. Be prepared to provide the Enterprise branded receipt. It is possible you will not get the credit, but you can try.   Dream of Flying likes this.", "I have a Xfinity Home offer.  I have Xfinity internet.  Has anyone had experience paying their internet bill and getting the credit back for Xfinity Home?", "Would be helpful to know which cards you're getting these offers on? My cards are lucky to get 10% off at Starbucks.", "10%!?  I should be so lucky, I only get 5% at SBUX", "I may have confused Chase with Amex there, but in checking just now, one card is 5% and the other 10% there.  Still, I never get hotels and such on my Chase Marriott and IHG cards, just stuff like Panera Bread, Chuck E Cheese, etc.", "This is on my Freedom.", "Same here - internet and an upgraded TV (from the Condo bulk rate). The offer is on ALL Inks we have. The conditions said offer expires on 12/31.  Yet it also says you must made 2 payments before 02/20/20 to earn the $25 credit. The language simply does not make any sense to me.", "We dont even get those offers on Marriott or the old IHG.  Nada, ever. The Premier IHG starts getting some useless (to us) offers. Freedom though, is getting some useful offers at Walgreens and Rite Aid which is not in our area but Walgreens is. Lucky's 10% expired but a new 10% pops up.  Seems to me the chain is struggling because the 10% offer has shown up every other months if not every month.", "The offer is from Comcast, not from Chase. You must sign up for the service by 12.31.2019, -and- make two payments by 2.20.2020.", "I had a fraudulent charge on my CSR, so customer service sent me a new one. It looks like the Chase Offers were tied to the card number, because the 20-some offers that were open on the old card disappeared and now I only see two offers. Something to keep in mind if you see a good deal pop up but are holding off on exercising the offer until later.", "I got 10% on my IHG at Dennys.  And 10% on my business at Dunkin Donuts", "3", "7", "8", "9", "10", "11", "12"], "Chase refuses to honor Explorer Mileage Plus offer for $250 statement credit.": ["Click here for full rules!", "Have you actually made a purchase and not received a credit after statement close?  Have you received a signup bonus for a Chase United card in the last 24 months?  If you ask the same question of different agents enough times, you will eventually get different answers.  Most of us manipulate this to our advantage (HUCA) but if you keep hunting for the answer you don't want...", "Offer URL - https://www.theexplorercard.com/25k2...ate=2019-06-19 Offer Details that I see: $250 Statement Credit This product is not available to either (i) current Cardmembers of this credit card, or (ii) previous Cardmembers of this credit card who received a new Cardmember bonus for this credit card within the last 24 months. With this bonus offer, you will qualify and receive a $250 statement credit, after your First Purchase. (\"First Purchase\" does not include balance transfers, cash advances, travelers checks, foreign currency, money orders, wire transfers or similar cash-like transactions, lottery tickets, casino gaming chips, race track wagers or similar betting transactions, any checks that access your account, interest, unauthorized or fraudulent charges, and fees of any kind, including an annual fee, if applicable.) After qualifying, please allow 6 to 8 weeks for statement credit to post to your account.   PTahCha likes this.", "I propose this post be moved from the UA forum since it has nothing to do with UA.  Its a consumer credit card misunderstanding issue, not a UA operations issue or question.   TerryK, jsloan, Often1 and 3 others like this.", "Hello, Your story is my story. My question is did you ever file a complaint and if so with whom? next, did you ever get a screen shot of the offer on the UA website, because like a dope, i failed to do that from the get go. next: have you had any resolution since this forum began. thank you my friend.", "If it was an FT branded card, I would expect them to at least look into it.", "I wouldn't expect any resolution until perhaps September or possibly October.  As noted by IADFlyer123, statement credit will take 6-8 weeks to post.  Also, according to the offer details, the first purchase doesn't have to even be for a UA flight.  For some reason, the OP was led to believe this was the case, but it does not appear to be a requirement. As to why the OP was apparently informed that their particular credit card was not eligible for a statement credit, I can't figure that one out, but agree that this is something to take up with Chase, not UA.  UA has absolutely nothing to do with this.", "Same! I am living a very similar experience as the OP unfortunately. A few months ago I was booking tix with Southwest Air and they had the promo of a $200 statement credit. So I was like cool- my $800 plane tix will only be $600. I would not have opened a credit card if there hadn\u0092t been this promo and that\u0092s why I\u0092m so pissed. Before I apply I read all the terms and see that I meet all the qualifications for the credit. So I apply and get it, find that I can\u0092t book the tix until I get my physical card. I called Chase to see if I could get the info to book it that day but no. I wait a week, get it, and go to book my tix and see the promo is still on the page and I\u0092m like awesome. Buy the tickets and wait the 6-8 weeks to see the credit. Never see one. Now I\u0092ve been going back and forth with Chase supervisor being told that that card isn\u0092t eligible for the promo even though I have a screen shot of it on the Southwest page when I was booking. I don\u0092t know what to do. I feel like they\u0092re false advertising and I just want the $200. 😞", "As  Chase is the common denominator, will move this to the Chase Forum WineCountryUA UA coModerator", "hello, i opened a consumer complaint against them on line with the consumer protection agency. so now we wait.", "Good Morning,  I have been monitoring this because I applied for this Chase United card ($250 statement credit + 25,000 mi. etc.) while logged into my United Mileage Plus account when seeing the pop up from Chase on 1-2-20.  I was approved for the card immediately (have had twice before over the last 10 years, but I watch my 5/24 religiously and have appropriately spaced the apps).  Did not complete the reservation and logged off.  Received the card 7 days later, completed $2,260. spend which included a $400 United flight for cash, which I don't  believe is not necessary for statement credit.  Received $250 statement credit on 1-15-20 (don't know when actual statement will close yet.)  Now waiting to see if get 25,000 miles.  But letting you all know \"so far so good.\"  YMMV", "1"], "How long chase points transfer to United for AU?": ["Click here for full rules!", "This is good to know. Perhaps all those transfers were instant after all but there was some IT issue in which we couldn't actually SEE the points but they were there. However, my only caveat is that for me the email from Chase that the transfer was successful didn't come until the exact time when I was actually able to view the miles on my account. I'm wondering if the above 2 posters got that email from Chase or not and if yes, when.", "Update: this morning I booked it, it still shows my original number of points in my account, but I show a pending charge on my Sapphire Reserve for the taxes. When I view the reservation online, it says this still: Your purchase is confirmed and your reservation is processing. We'll email you when your reservation has been ticketed Has me worried! Think it will go through? It uses Ethiopian and Egyptair flights...  --Kyle", "This would be great news if true. Please provide more DPs", "Chase sent two email messages, one saying the transfer was in progress and one saying the transfer was complete. The two messages had the same time stamp in my email client. (I did not examine the headers to see how many seconds, if any, separated them; the client showed the same hour and minute on the time stamps. I can look for the seconds if someone thinks it is important.) I do not recall whether the messages arrived before I tried to make my reservation, but I believe they did. Also, based on the time stamp of the message from United saying that my reservation was \"processing\", I believe I received both Chase messages before starting my United reservation.", "Ok, so then your points were actually in your account instantly but you weren't seeing them for some reason. When I made my first transfer I also got both emails seconds apart and logging in and out allowed me to see the updated mileage count in United. However for the second transfer I didn't get the second email until 13+ hours later so the points in fact had not been transferred until then.", "In my case: 1/17, 5:20 PM - points transfer in progress email from Chase. Balance showed 24,xxx points (transferred 136,000 points). 1/18, 11:17 AM - flight booked with confirmation email saying: \"We are processing your reservation and will send you a confirmation email once this is completed. This process usually takes less than an hour; however, in rare cases it could take longer.\" Credit card was charged for taxes, points still showed pre-transfer balance.  1/19, 8:01 AM - points transfer complete, balance now shows 160,000+ points (flight is 160,000 points).  Now, 1/19, 10:30 AM, United balance still shows 160k points, flight confirmation still says: \"Your purchase is confirmed and your reservation is processing.\"  Really hoping this gets \"processed\" soon!  --Kyle", "That is my assumption. FWIW, that was after logging out, clearing cache and cookies, and logging back in.", "2 Point Transfers - 1 for 7000 points - in progress email received 1/19/20, 11:45 am - points have not posted yet  1 for 67,000 points to my husbands account from his UR, 11:55am in progress email, 11:56 complete and points there Frustrating.  Second Frustration - phantom availability for EVA on United. Ugh!", "This advice was great, thanks! I transferred 260k points on Saturday around noon. This morning (Monday) I called United and had them hold the tickets for the day, and long story short, they took care of me. Long story a little longer.. A United rep saved the tickets for me this morning at the award points I wanted (274k, 1k under my transferred points and what I have in United). She then mentioned she needed to go back and add my middle name so that the passport will match. Well, when she did this, there was then only 1 award flight left. Points finally transferred this evening (Monday around 60 hours later).  So I called United and let them know what happened, and 4 hours later, it's not their fault really... I have my reward tickets for the 274k points.. and then honored my initial saved tickets.  Though I'm typically not a fan of United's customer service.. they are shining over Chase and their slow transfers!", "3", "4", "5", "6", "7", "8", "Click here for full rules!", "I had two friends transfer points from their  Ultimate Rewards accounts to newly created mileage plus accounts. One was instant but the other we're still waiting on. Of course both companies are like ¯\\_(ツ)_/¯. We'll wait another day or two and then start to escalate. Hopefully this will not be too big of a hassle.", "DP: Transferred points about 12 hours ago, and this transfer has still not arrived. Transferred more points about 20 minutes ago, which arrived instantly. Called Chase, they said it's a United problem. Called United, they said wait 48 hours then call us again but we won't open a case before that (but, by the way, would I like to apply for the United Club Card???). Meanwhile, the first award I wanted is gone. Fingers crossed on the second.  Random theory - second transfer happened soon after midnight Eastern. Wondering if something resets at that time to make these more likely to succeed?", "7/25/19 50K Transfer Not Instant Chase No Help    I tried to transfer 50K UR points to UA MP for a flight tomorrow.  I have transfered points from UR to MP before and it has always been instant, and I had never read about a glitch prevening instant transfers from UR to MP. I called Chase and they gave me the BS that it can take 1-7 days, even though it is typically instant.  They had no idea what the issue could be as to why the transfer was not instant.  They did an escallation but said the escallation team might not respond for days. I have another ticket booked for tomorrow on DL but the UA routing has better times. People clearly rely on the instant transfers, and it is maddening that Chase reps have no information as to why the transfer is not working and they don't have a way to interface with the back office teams that handle the transfers. Chase (and any other large company) treats you like garbage whether you have a food stamps card or a Sapphire card; same difference; if you try to step out of their scripted answers, for which they have no explanations or help.  The reps don't have any resources besides the scripted answers they give like bots. What if someone was transferring miles to see someone that was terminally ill, it sounds like there is nothing Chase would do! And they do create the impression (despite what their fine print says) that the transfer will be instant.  I have never read about a problem like this until googling and finding this thread.", "I am now victim to a non-instant UR to UA transfer . I think my mistake was doing 2 separate transfers to the same account on the same day (~1.5 hours apart). First transfer to book outbound tickets went through instantly and I completed my booking. At that time the return was not available at all on UA. About 1.5 hours later I checked again and voila, my desired return popped up. So I went to transfer more points to UA but unfortunately it was NOT instant and now I'm afraid I will lose the return award. And reading this thread I know there is nobody to talk to about it. So infuriating.", "For those of you who have had delayed transfers, I'm wondering about the timing of the emails from Chase. For my first transfer I got 2 emails seconds apart - first one to tell me that its processing and second that its complete. For my second transfer I only got the processing email so far. Did everyone get an email telling them the transfer was completed when it finally was?  I am so nervous that my awards are going to disappear and am at a total loss as to what to do.", "Just to update, I definitely think that the issue happened because it was a second transfer to the same account within a short time span. Those 2 transfers I made were to my spouse's UA account. First one successful and second one still hasn't posted. Not wanting to risk losing the awards I transferred the points to MY United account instead and it was instant. Awards have been successfully booked. I should have done it this way in the first place but I was thinking that in the off chance we need to cancel within 24 hours I'll have all the points in one account. Now they'll be in two... Now I'll see what will happen to that transfer that has still not posted. I'm not happy that I will have extra miles parked in UA but at least now they don't expire.", "I seem to be having a running monologue here . Happy to provide data point though. I tried contacting Chase Support via Twitter PM and telling them 2 transfers were instant and one wasn't but they just repeatedly said I need to wait the 7 days. I got the email stating transfer was complete at 9:02 a.m. this morning, precisely 13 hours and 15 minutes after it was initiated. This has no rhyme and reason. The awards I booked last night are actually still wide open but there was no way for me to have known that. My ideal outbound flights had no longer been available by the time I finalized my plans and I didn't want this ideal return flight to disappear on me too. So now I have miles parked with United with no future plans for them. Oh well, first world problems .", "Yet another victim here. UR points not yet transferred (more than 24 hours)…. (This was not any special situation...just a single transfer of UR to UA) Wrote to Chase....they gave the same BS \"will take 7 days to transfer\". This really sucks. Chase should stop saying on their website that most transfers are instantaneous .", "I recently did two transfers to my UA account within a short timespan (bad math, don\u0092t ask).  Both were processed instantly.", "I guess it's a YMMV situation. Like I said, no rhyme or reason because I ended doing a third transfer which was instant so 2/3 were instant.  Its just frustrating that #1 there's always the possibility that a transfer will NOT be instant so you shouldn't expect it to be and #2 when it's not instant you don't know if it will take 10 hours, 25 hours, 3 days, or more. So if you have your eye on an award and don't want to risk losing it you will need to do another transfer and hope that one will be instant.", "How long chase points transfer to United for AU?    I need to transfer 120k chase pints to my AU\u0092s United account . By rule, it\u0092s possible and I did it last time but the transfer time wasn\u0092t instant. It\u0092s instant if it\u0092s my own United account. Has anything changed or any data points on this? I\u0092m afraid by the time points transferred to my AU, the seats are gone!", "This is likely just a coincidence: UR to United transfer is not reliably instant.", "It happened to me today. It's only been 1.5 hours so far, but I'm afraid it will take awhile. And this is for a big multi-city trip to Africa with only a few seats remaining, so I'm pretty nervous! I transferred 136,000 points! I imagine the size could be part of it, and/or the fact that I didn't have my United account linked with Chase until today. Fingers crossed that it goes through soon! I'm also on hold with United hoping they can hold it for me until the points post (tomorrow?)... --Kyle", "maybe the points are there even though United says they are not    I transferred points and they did not appear at my (brand new) United account. I logged out, cleared cache and cookies, and logged in; still no points. Nonetheless, I proceeded to book the reward flight that had caused me to transfer points in the first place. The booking went through, and a confirmation page said the points were deducted from my United account, which then reported that I (still) had zero points. It was my first time booking at the United web site and I was just looking to see what the reservation web pages would look like while I killed time hoping the points would appear; I was really surprised when the booking went through. My suggestion for someone whose points don't appear is to try to make a reservation anyway. Maybe I got lucky and the points appeared after I last checked and before I made the reservation, or maybe the points are there and the web site's right hand isn't talking to the left hand.   kyamnitz likes this.", "Thanks for sharing. It's now been 17 hours and the transferred points don't show up in my account. I called in and they put the flight on hold for me. I'll try to call and see if they can book it with the points that don't appear to be there! Thanks, --Kyle Update: I tried to pay for the reservation online (despite only showing 24k miles for my 160k mile trip), and it appears to have gone through! I got this email: We are processing your reservation and will send you a confirmation email once this is completed. This process usually takes less than an hour; however, in rare cases it could take longer. So, maybe this works after all! Thanks!", "2", "3", "4", "5", "6", "7", "9"], "Chase United Airlines credit card: keep or cancel in 2020?": ["Click here for full rules!", "Thank you! Yes, I looked there as well but did not find an answer. I did try to consult with Chase but they have no clue. Will try to speak to MileagePlus people now. It is strange that there is no info on this situation, I didn't think it was that rare!", "I agree, the PQD waiver was the main reason to put spend on a Chase UA MP or UA Biz card. The points earning is a joke.  2x miles for UA purchases? I'd rather charge them to the CSR for 3x UR points, which is an easy 4.5% in the travel portal.", "Is there any reason that I should have a United MileagePlus Select Card?", "this thread might help you: Reconsidering Chase MP Card due to 2020 FF Changes", "Moderator Note:  This thread is now archived and the discussion has been consolidated.  Please continue the discussion here: Chase Product Change/Card Conversion: Downgrade, Upgrade, Keep or Cancel? 2020", "1", "2"], "Chase Sapphire Reserve (CSR) 2017-2019, archived": ["Click here for full rules!", "I would apply for Global Entry ($100 app fee) vs TSA pre-check ($85) because GE comes with TSA Pre.  And that would be the first thing I do as it will take time for the process. Actually, enrolling in Priority Pass is pretty simple and quick so you can do that just to get it out of the way. Then you can sign-up for National Executive membership if you don't have one already. You have 3 months for the $4K.", "FWIW, I just applied and was approved instantly for the CSR and received a 34k limit. I have an existing United Club (47k) and Amazon Prime (5k) card, and have opened 1 new card in the past two years (non-Chase).", "Finally decided to get this card for the SUB yesterday.  even with an 831 FICO I Had to call Recon and move $10k in credit from other Personal cards (I have like 8 total biz/personal).", "Credit score has nothing to do with the total amount of credit that Chase will extend to you. Credit score determines if you are eligible for the card.  Your income and monthly house payment determine how much credit Chase will extend, if you are eligible.  This makes sense.  Someone with a $50k/year income could have an excellent credit score; that doesn't mean that a responsible lender will extend them $500k of credit on a credit card. I had to move some limit around for the last Chase CC I got.  If I remember correctly, the total limit for all Chase cards capped out at half of (income minus 12 * rent) -- basically, half of the money I'd have left in a year after paying rent if I had no other expenses and didn't pay any taxes.   RNE and IndyHoosier like this.", "Congrats. But the need to call had little to do with FICO and everything to do with total credit line.", "Applied for the card. DELAYED Got the 2 week message. Will it be approved at the 450 or 550 annual fee since today is the 11th and a 2 week usually means approved but delayed? Any experience or data points on this?", "Applied today and got the 2 weeks message. Should we call for reconsideration line or wait? Should we worry about getting the $450 AF instead of tomorrows AF?", "You should only call reconsideration if you get rejected. Let it work its way through the system. I got a 1-2 weeks message for the CFU and was approved in around 3-5 days. Didn't it tell you that there would be a $450 AF for the first year when you signed up? They can't just change the terms unilaterally on you.", "Yes she got that offer and I had her print it out.", "I disagree with this advice. I suggest calling recon if it is not automatically approved. It will speed the process up dramatically. When I applied for my Hyatt card, it went to the \"pending\" state. I called recon, and the agent said that we would have to reduce CL on some other Chase cards (I had 3 already; Hyatt was my 4th). So we reduced 2 cards by 10k each and she approved it with a 20k credit line. The whole call took, maybe, 5 min. Why wait 2 weeks to get a letter in the mail when you can just take care of this right now? Just call and say something like \"I was surprised that my application was not automatically approved; is there any additional information that I can provide?\"", "Because if recon will ultimately approve you, they will do so whether it's now or later. But if your application is one that the system would automatically approve but a more extensive human review might reject, then you're not doing yourself any favors by calling. You may get yourself rejected when you would have ultimately been accepted had you just waited. And thinking ahead to the future, if you ultimately decided against keeping the card after the $550 AF hits next year, the delay gives you a few additional days to burn the 2021 Doordash credit.", "Thanks.", "Moderator Note:  This thread is now archived.  Please continue the 2020 discussion here: Sapphire Reserve higher annual fee ($550) with Lyft &amp; Doordash benefits.", "22", "62", "66", "67", "68", "69", "70", "71"], "Ink Business Cash, now $500 cash back (50K UR),  public offer": ["Click here for full rules!", "Has this tactic been discussed anywhere else? I was under the possible misunderstanding that you could only get one sign up spending bonus every 24 months for Chase biz cards.", "Currently there are three INK cards: Preferred, Unlimited and Cash. Earning a bonus for one does not block earning a bonus on the others. To earn another bonus for the same card you would need to wait 24 months (under current terms.)", "There are rules for different cards. For the sapphire bonus you have a rule limiting you to one bonus over a period of time. SW cards too. For the CIP there are data points of people getting multiple. Chase cares about total credit limit and velocity of applications more than the number of cards you hold. I'm sure there are multiple places it's discussed here, reddit, etc.", "YouTubeTV coded 5x on the Freedom for me this month. So you can give it a try for the CIC and report back. _K", "YouTube TV earns 5x on the CIC, always has. majorkirkus likes this.", "Nice!  It didn't code for me on CIC the first time I tried it.  Thanks, Troopers!   Troopers likes this.", "4", "5", "6", "7", "8", "9", "Click here for full rules!", "Ink Business Plus AND Ink Business Cash?    I currently have the Ink Business Plus.  Assuming I'm under Chase's 5/24 and I have a qualifying business, can I get the Ink Cash card as well or can I only have one or the other? Thanks", "Yes", "One other semi related question... I don't know if I have this right but to get a Chase Business card you have to be under the 5/24 rule but once you have it, business cards don't count towards the 5/24 rule? Thanks", "Correct. So if you are at 4/24 or below, you can continue to get Chase Business cards, and they won't put you over.", "Thanks!", "You must be below 5/24, not \"at 5/24 or below\".", "Ink Business Cash    Quick question, I couldn't locate a thread specifically about the Ink Business Cash exactly. Is it possible to buy gift cards at office supply stores and have the office store bonus apply? Are they likely to crack down on larger amounts? Would be curious if anyone has any feedback about this. Finally, I've read that the points earned can be moved to anny UR card like my personal CSR, Im assuming this is still the case? TIA!", "The answers to your three questions are yes, maybe, and yes.", "Anyone use Dropbox? Is Dropbox coded as 5% on *nk Cash?", "I have an ink plus and an ink cash. I also have an ink unlimited. Can I convert my ink unlimited to a second ink cash?", "Is this still the case for Ink Cash 5x does not?  Freedom has streaming as a 1st quarter category 5x.", "How long should I wait to apply for the CIC card if I just applied for the CIP card?", "It would depend on your history but I have seen 3 months between apps be a very common suggestion. Any reason why you wouldn't go for a 2nd CIP?", "Turns out I\u0092m 6/24 until June.  So all apps will need to be for P2 until then. I\u0092ve tried to read all the CIx threads but am still confused - are you saying to get a CIP, wait 30 days and get another CIP? How does that work?", "You can get more than one CIP. Especially with self refer, totally 100k per card. But CIP,  or whatever other chase card, like CIU or CIC, you're best off waiting 3 months (90 days) between applications to keep your velocity fine and not risking a shutdown", "3", "4", "5", "6", "7", "8", "10"], "Ultimate Rewards - Which airline/hotel should I transfer points to?": ["Click here for full rules!", "If you already have a bunch of Avios in a BAEC account, if you open and fund (with at least one Avios) an Iberia Plus account, you should be able to transfer your Avios from BA to IB once the funded IB Plus account has been open for 90 days.", "Would it be 24 months since you earned the bonus on that particular card or 24 months since you canceled that card? I earned my Ink Preferred bonus in September or October 2017 but had the card through July or August of 2018. Similarly, when does the 48-month clock on the Sapphire cards begin, when you earned the bonus or when you got rid of the cards?", "Quote: This I hadn't considered. The former (downgrade to Freedom xyz &amp; get another Sapphire brand) is not a good option, as I wouldn't qualify for a while (for the bonus, which is the way I'd go about it). Also not very enthralled by the rumored changes coming to CSR. This I will pass on. But the Ink Preferred I hadn't thought about much. Good to note that there may be no restriction - Sapphire to Ink, correct? However, unlike many here, I am not a smooth operator when it comes to business apps. The only business card I have is the BBP, which was easy to get. Methinks Chase is much harder and may not be worth the trouble for me, but please correct me if I'm wrong. I will be unable to show any substantial business income.", "When one redeems Virgin Atlantic miles on Delta or BA Avios (on any carrier), you are charged separately for each flight flown. When redeeming IB Avios for round-trip award travel on AA, you are charged based on the total flown miles, not per segment.   AbyssalLoris likes this.", "Thanks. I had opened an IB account once, but there is nothing in it. If it is still active, it will be well over 90 days. What does fund the IB account with at least one Avios mean? How is it to be funded?", "By earning at least one Avios in the account -- by flying an IB partner and crediting the flight to IB; by certain hotel stays or car rentals; by taking an online survey through IB Plus' survey partner; or by converting Chase UR or Amex MR points to IB Plus Avios. There might also be a shopping portal, but I'm not certain of that.   AbyssalLoris likes this.", "1", "2", "3", "Click here for full rules!", "actually did and it came out cheaper. thanks for the suggestion.   guv1976 likes this.", "One does earn miles on flts purchased with UR pts.", "Speculative transfer recommendation    Commonplace enough question, but let me frame it as narrowly as I can. The only UR card I have is the Sapphire Preferred. I am of a mind to close/downgrade it. The earn rate is poor and I find myself none too happy to reach for it compared to the other options in my wallet (Amex EDP, BBP, Bonvoy, Citi TYPremier, Citi AA Plat, BofA Cash, etc) - one or more of which always offer better or equal earning. I have never found UR to be particularly superior to other currencies - no knocks intended here, but just based on my usage. I am also aware I could change up to Reserve, but I am not an aggressive churner &amp; am quite happy to wait for the 48-mo period to expire and take in a signup bonus on that then. There's plenty of other bonuses to earn in the meanwhile and at my rate I won't exhaust interesting options soon. So, without any specific near term redemptions in mind, which of these 3 would you think I should transfer out my UR to (and close the Preferred), as downgrading to any of the Freedoms is not a good UR-backup strategy for me (it will be a while before I sign up for the Reserve &amp; the points could get locked out for any number of reasons in that time)? -  United, Southwest, or Hyatt? Those are the 3 unique partners and historically considered a good value. The others are to be found on either Citi or Amex or otherwise (which I still retain). Earlier, I would have totally overlooked Southwest, as the value is fixed (albeit decent) &amp; I rarely even use them. But now, with United's program shenanigans &amp; my relative unfamiliarity with value to be gleaned there, I include it. The question is really determined largely by whether there is International Business award value to be found on *A partners any longer with MileagePlus. If so (let's say reasonably consistent @ substantially better than 1.5c), then it's still United. If not, it's a toss-up between Southwest &amp; Hyatt. I will find some use for either sooner or later. Does anyone see strong near term devaluation potential @ Hyatt? By the way, for reference, I also intend to close the Bonvoy Amex (obtained pre-SPG transition) &amp; apply next for the Hyatt card. TIA.", "Appreciate the post move &amp; links to Wikis. Looking at the travel to/from Asia wiki link for example, the last post there is from 2014. Given the changes in those many years, I doubt the content there would be relevant or accurate for questions today, but I am looking over anyway. Thanks.", "Don't forget transfer to BA and redemption in the US for short haul AA. I have benefited from that quite a number of times.", "For those interested in pursuing this option, or just in knowing more about the pros (and some cons), see the wiki at Booking American Airlines awards", "I was in the same position with my Sapphire Reserve and chose to transfer my points to Hyatt. They\u0092re not everywhere I go, but I\u0092ve gotten a couple 5000 to 8000-point Hyatt Place awards on every trip in the last year, and I\u0092ve got enough points left for 3 nights at the Park Hyatt New York next fall. For me this was a no-brainer since I never have a need to fly United or Southwest.", "There's also the option to transfer to IB and redeem on AA. For award travel on AA that requires connecting flights, this could require far fewer Avios than redeeming through BA. But note that IB redemptions for travel in AA are completely non-changeable/non-refundable. And just like BA, IB does not charge a fee for close-in award redemptions.   mia and AbyssalLoris like this.", "How about instead of transferring externally, just keep it tied to Chase Freedom until you get another UR premium card, like maybe double-dip on Ink Preferred if you've had it previously? Does the 48 month rule also apply to Ink Preferred?", "The 48 month restriction currently applies only to Sapphire brand cards. Other Chase cards typically have a 24 month restriction, but read the terms of the offer when applying -including- the linked documents.", "I am aware of this, but feel I already have enough BA Avios for my purposes for now. Besides also doable from Amex (don't remember about Citi) and I will stay in the MR system.", "Same here, pretty much. I could always use Southwest for some short-hauls/intra-state, etc - they will go far to reduce my costs, although I don't foresee a lot of such activity. So, a relatively unattractive option, but can always work. Don't fly much United either (or very much at all, compared to most other folks here) - my only interest there is to use for partner international flights. Luft, Turkish, maybe Avianca who knows... So that is definitely one question I have. Seems difficult to research dynamic pricing - so if people here have a general impression of what value is to be had on this front, I would appreciate inputs. Hyatt still leading contender.   strickerj likes this.", "This is somewhat interesting. As I just mentioned, I wouldn't want to transfer to BA. Given that Amex also transfers to IB &amp; I have some ways of grabbing AA flights with Avios &amp; otherwise, it's still not the most attractive, but thanks for the suggestion.", "Quote: Virgin Atlantic miles can be similarly redeemed for flights operated by Delta.  This works best on nonstop routes, and it is well implemented. After the initial purchase everything can be done on delta.com ,", "A preferred option would be one that diversifies amongst what can be accessed across the different points programs. Virgin is accessible through MR &amp; TYPs as well, so wouldn't be the most interesting option when closing out UR.", "1", "2", "4", "Click here for full rules!", "Transferring Points for Cheapest Flight (intl)    Hi Everyone!  I've been so confused on how to best find award deals. Currently I have the CSR card and every time I try and find an awards flight its never as cheap as going thru the chase portal and booking it with the 50% bonus. I think I must be doing something wrong or just not seeing the right way to transfer points.  I'd be extremely grateful if someone could show me how.  Currently I want to fly RT from GIG to NYC. Any ideas on how to go about it?  Thank you in advance!", "Welcome to Flyertalk Quote: How many passengers? In economy or in a premium cabin? When?", "Since this thread is primarily for transferring Chase points to partners, you might have better luck here: Booking Flights, Rooms, Cars, Cruises, Activities with UR (include Expedia problems). Others there have observed the same issue - with the difference so significant in some cases that some have called the 50% bonus a bait-and-switch. Not only does the Chase portal (powered by Expedia) offer inventory different from the airlines directly, it\u0092s even different from Expedia\u0092s main site. Barring unusually good deals, unfortunately it looks like the way to get the most value out of Chase points is to transfer them to United or Hyatt.", "Shawn is reporting the reverse, that booking through the Chase portal requires fewer points than transferring to a partner. He wants to better understand how to choose a transfer partner for best value.", "Oh sorry, I completely glossed over the first part of the sentence and just saw 50% bonus through Chase portal. In that case, Hyatt for hotels and United for flights (preferably using United miles on a partner, as I\u0092m personally not a fan of flying United, although from South America your partner options are limited). It\u0092s hard to predict when there will be reasonably priced awards though, so obviously don\u0092t do it if booking through the Chase portal is fewer points for the same flights.", "As an admitted novice, I faced a similar challenge and paid an award finder to find flights for me. If this interests you, you might read the thread on Award Booking Services.", "Just 1 and Econ is fine. If first is an additional 10,000 points then sure that\u0092s fine. But Econ for the most part.", "I too have found that it is sometimes more to transfer points to United than to book on the UR portal. As with everything, I recommend comparing your options to find what works best. I am not keen on this \"I need a sky high valuation\" for everything I redeem, especially on flights, considering my travel habits. I always price out all of my options. I flew to New York a bit before New Year's. 2 of us flew RT on Delta for 29,000 points through UR portal. By far and away the cheapest option I found. Yet, to many people on this site, I didn't do \"well enough\" because it was at a 1.5 valuation. I don't need to waste  75,000 points so I can get a \"higher valuation\". Then our next flight, Southwest was by far the cheapest, which isn't on UR. My next flight, is just me, and had the most convenient timing/price, Frontier was my best bet. $180 RT with baggage, paid out of pocket. Being able to fly in and out when I want, and save a bunch of money is far more convenient than some of the other stuff. Unless you're a business traveler, or you travel long distances frequently, sticking to a specific airline or two is counter-productive in many aspects to the normal traveler. I'd use the points for something else if I was you. If you don't have any hotel loyalty programs, Hyatt transfers are a great use of your UR. Someone mentioned IHG transfers. I would stay away from that. I like IHG and stay there, but on my points earned through loyalty from work. I think you're almost better off redeeming your UR for cash and buying a IHG stay at that point (don't do that).   strickerj likes this.", "best airline transfer partner to china    I do a lot flights from dallas/houston to shanghai.  Which transfer partner do you think is the best for economy as well as business.", "do you suppose that Chase pays Hyatt per transferred point about 3 times what it pays IHG and 2 times what it pays Marriott? Chase should align it's transfer ratio to that reality by awarding 3 IHG per 1 UR and 2 Marriott per UR, as i can't imagine hardly anyone redeems UR for IHG/Marriott today.   strickerj likes this.", "This is why I recently transferred my Chase points to Hyatt - there\u0092s no better redemption value for me since I don\u0092t fly any of the StarAlliance airlines. Don\u0092t give them ideas though - more likely than increasing the transfer ratio for Marriott and IHG, they\u0092d probably just decrease it for Hyatt.", "DTW to SAN use UR portal to book travel (AA) vs. transfer points    I am looking at booking a one-way flight, and am flexible on united or american (this is for someone else, i'm otherwise a united guy, unfortunately) I have the option of transferring 35k to united or buying the ticket on UR travel site for 36k.  Does doing the latter provide me any perk? Do I get points back from buying on points? Thanks.", "The traveler will not earn miles on an award ticket, but might earn miles on a ticket purchased with points through Chase. How much is the cash component (taxes) on the Mileage Plus redemption ticket? I don't think that you will earn anything, regardless of the method you use to get the ticket. What route?", "$1251 for two one way tickets from dtw to san on AA; 35000 points on united and 36000 to buy the same AA tickets thru UR mall.", "Have you checked fares on Southwest? Southwest is a UR transfer partner.", "1", "3", "4"], "CSP &amp; CSR Trip Cancellation/Delay Insurance Issues/Comments (2016 - 2019)": ["Click here for full rules!", "Since no one else has commented since my last post and you bumped it, I'll expand (also I'm stuck waiting in a line for ten more minutes). What you wrote above is exactly why I'm almost certain it'll be denied. What are you going to upload for your carrier.statement of delay? The carrier will say that first flight arrived on time or arrived a few minutes late maybe. You missed flight bc you weren't there for second flight. Maybe they'll say you didn't make connection but claims is going to see that you had a short connection. I don't see any language indicating they cover missed connections, especially not bc flight arrived on time and you couldn't get there in time. They didn't even approve my claim initially with only my upload of the form saying my flight was cancelled outright and I showed I was rebooked 24 hours lately. This was because form didn't state the exact reason. Only when I sent my email from them with delay reason did they approve. I don't see them giving an approval based on your statement that you couldn't get off the plane and walk fast enough to second flight in time as reason you were delayed overnight. For the second flight, airline will say you missed flight because you hadn't arrived at gate on time. I'll put it this way, what wording in the Benefits.guides leads you to believe you'd be covered?", "My thoughts are that this benefit doesn't cover schedule changes. But, it's free to submit a claim!", "Based on what you wrote, your options are to: 1.  Get a refund from Norwegian due to the date change for the return flight; or 2.  Take another day off from work.", "Stinks to blame the victim, but such is the risk one takes when patronizing this particular business model. This isn\u0092t a Norwegian issue. It\u0092s the model. Low fares. High risk.   Boraxo likes this.", "It is weird to me that regulators allow air carriers to sell tickets which are basically \"if the passenger changes their plans, tough luck you bought a cheap ticket.  But if the air carrier changes plans, passenger is screwed and no penalty to the air carrier\". Change fees should be symmetric.   meehgz and MADPhil like this.", "How am I blaming the victim?  The rules are clearly spelled out before the ticket is purchased. If you don't like it, take your money elsewhere.  It's not like Norwegian Air has a monopoly of flights from LAX-CDG.", "Sorry, I meant it sound like I was blaming the victim. Because frankly, I was. I\u0092d be very disappointed if Chase covered a claim like this. I personally don\u0092t have any sympathy for anyone that purchases a ticket on an LCC without taking into account the significant risks. What you\u0092re typically saving is more than made up by the risk you are inherently purchasing.   Boraxo and Statman like this.", "Just submitted a claim that I think could go either way, but it's either this or a chargeback via Chase so I figured I'd try this first. Booked a tour (dinner cruise) with a local company in Norway. Fully prepaid around $300 USD. 4 days before the tour, got an email that the tour has been cancelled. I assume due to weather as there was a blizzard and gale warning that day. Tour company did offer alternatives (different days) or a refund. The alternatives didn't work for us so opted for cancellation and refund. Refund never processed. Emailed a couple weeks later and tour company said they can't refund to CC anymore and instead need to do a bank transfer. We provided wire information. Tour company stopped responding. Was a bit weird completing the online form since it basically forces you to put in flight information, which was irrelevant to this claim (and besides, the destination airport involved was not available in the picklist). However I feel like this is indeed a covered event? In the exclusions for Trip Cancellation, this language appears: Quote: Which would seem to imply that travel arrangements cancelled due to severe weather are indeed covered?", "I think you have a Trip Cancellation claim if you have any written evidence that the cancellation was due to weather. However, I would probably go the chargeback route.  The merchant didn't provide the service, agreed in writing to give you a refund, and then didn't.  Sounds like an open and closed case.   Xyzzy, mia and gooselee like this.", "Thanks! I did get a reply from the insurance claims handler today asking for more documentation - specifically confirmation from the provider of the reason of cancellation and that they did not provide a refund. I explained that the provider was no longer responding, which was the entire reason I was going the insurance route. I did mention that I believed the cancellation was due to the blizzard, though the cancellation email itself did not identify any reason. I suppose this should be easy enough to support with a historical weather report. Rep was very friendly and seemed to understand the dilemma. She made some manual notes and forwarded back to the examiner. So another 5-7 business day wait to hear back. Will try to keep this thread updated. If the claim is denied then I'll try the chargeback. I'm kind of kicking myself for not just going to their office while I was there to take care of it all; but I didn't realize they'd have such an issue processing a refund.", "I am relying on CSR as my trip cancellation insurance for a forthcoming trip to Hawaii. The flights and hotels are booked and paid for with CSR. If I want to be covered for nonrefundable excursions, do I also need to use CSR for those?  They don\u0092t code as travel, so I would  rather use another card for those expenses, but not if it would risk not being reimbursed for them if need be.", "Looks like the language in the latest benefits pamphlet has changed from the previous version. It still says \"The Cardholder [is] covered when ... the Cardholder charges all or a portion of a Trip to his or her Credit Card Account\", but it also says \"The Trip Cancellation ... benefit provides reimbursement for Eligible Travel Expenses charged to the Cardholder’s Account\". It also says \"No benefit will be paid for any Eligible Travel Expense unless a portion of such Eligible Travel Expense has been charged to the Account.\" With that (new) language I would not expect to be covered under Trip Cancellation for pre-paid expenses that were not charged to the account.", "Moderator action    Discussion continues: Chase cards Trip Cancellation/Interruption/Delay benefit", "35", "75", "79", "80", "81", "82", "83", "84", "Click here for full rules!", "Thanks.    We have Chase S Reserve. We drove. Ultimately the flight arrived 5 1/2 hours late. So I\u0092m guessing no claim given the 6 hour rule. Oh well.  appreciate the help", "I think no claim.  Sorry!  I had a friend with a 5h55m delay one time who was REALLY hoping the taxi in would be a little slower.   JBauer likes this.", "Hi all, a strike question:  I'm in France right now and December 5 keeps off one of their biggest transportation union strikes in possibly decades, with train, Paris metro, and I think Air France workers striking with no end in sight. I know most trip delay insurance insurances only cover \"unannounced\" strikes and not planned ones (sometimes in France they announce 1 or 2 day strikes with an end) but there's no announcement on when this will end. They're not selling train tickets for Dec 5 or 6 but they are still selling for Dec 7, when I'll be going from Lyon to Paris. Do you guys think, if they do continue to strike that day (a Saturday), Chase would refuse to cover expenses?", "liilak The Chase terms do not differentiate types of strikes only \"...an organized strike that affects public transportation\". You might like this site for strike status and mitigation suggestions: https://worldinparis.com/transport-i...eling-to-paris I would think you are covered.   liilak likes this.", "My question to you is: what kinds of expenses are you hoping to have covered? Are you staying in a hotel in either city? Are you assuming you will be trapped in Lyon and want the extra hotel nights there covered? Are you worried about your non-refundable room in Paris you won't be able to stay in? Are you worried about getting your train ticket refunded? Are you hoping it will cover a car rental, bus ticket, or plane ticket from Lyon to Paris? Are you hoping for coverage of meals you eat in your extra day(s) in Lyon? Are you hoping to have covered a change fee for your return Paris-&gt;USA flight that you will miss if the strike happens?", "I read through the wiki and have a report to add before I ask my question - for the following:\"I was delayed on my outbound and claimed $500. Now am I delayed on my inbound. Am I covered? Unknown, no reports on this thread. Chase says \"per trip\" on the phone, but Guide says \"per ticket\". So a round-trip ticket may not cover two delays, but two one-ways could.\" In November 2014, I was on a single ticket booked SFO-IAH-BOG-CTG-[four day stopover]-EWR-SYR-[four day stopover]-IAD-SFO (this was in my 1K days before the PQD req, hence all the legs that I was happy to take!). IAH-BOG was diverted to PTY for a night due to volcanic activity near BOG. Took the airline voucher for the hotel as it was a decent one, but (1) bought a jacket/toiletries from a nearby mall (was pouring in PTY) and (2) had a nice room service dinner and breakfast the next day - total ~US$400. All was reimbursed by Chase. Then later on the same ticket, my EWR-SYR flight was hit with rolling delays before an ultimate cancellation, with no flights available to any nearby airports that night. The PH NYC had just opened and I found a points + cash rate available for that night, with the cash component being $300. I hopped in a cab or Uber into the city, had a nice room service meal, and went back for the first flight out the next day - total just under the US$500 limit. So in a single ticket, I had two different overnight delay situations, and almost maxed out the $500 benefit for both occurrences, with all submitted receipts reimbursed with my CSP protections. I have updated the wiki to link to this report. ---- Now separately for my new question  I'm sorry if this question is super noob, but I've tried searching and googling to no avail - maybe my search terms aren't leading me down the right path. My s/o and I are taking Norwegian (that was my first mistake, yada yada, I know) roundtrip LAX-CDG-LAX in January, paid for on my CSR. I just got an email that we have been moved from our original return flight to a flight at the same time the next day - it looks like our original flight is no longer operating. Besides needing to take an extra day off work, it'll also be another night at a hotel + meals. However, given I'm being told this now (~7 weeks out), I don't know what our options are. Norwegian has no partners I can rebook on, and return flights on other carriers are many multiples of what we paid, so we'd prefer to not go that route. I know we're not eligible for EU comp due to &gt;2 weeks out notice, and the CSR benefits guide says the benefit is only for delays not known before the trip starts, but..... does that mean I'm truly SOL? Is there nothing I can claim in this situation with all the various protections we have?", "8 months of back-and-forth over email finally culminated this week in a 2x $125 change fee reimbursement due to trip interruption (illness). Original flight was domestic R/T for 2x pax using AS companion fare. (AS generously allowed me to reschedule for 3 months later.)", "I'm still.waiting for my Nov.5 claim for trip delay to process. I sent them the cancellation.reason form.and an explanation for the second person on ticket via email. And they never responded. I finally called last week and they said they still needed those two pieces of info. I got it to upload so now I'll wait until next week and call again. They never even asked for more info formally. I just saw when I checked it that it was still processing and two items were supposedly awaiting upload (relationship to other traveler and cancellation reason letter). Again this was stuff I emailed to them but apparently they didn't receive...", "This is pretty common.  They aren't very thorough about going through the stuff you send them and they aren't very proactive about asking for more.  Even if you already sent it, just send it again.   EkekoBWI likes this.", "So Funny enough, I got an email at 3pm or so saying that my claim was approved. Just to summarize my Trip Delay claim, I filed on Nov 5 2019 for a trip delay. My flight was cancelled on a Nov 1 return and I rescheduled a return flight on the same flight 24 hours later on Frontier. (On a side note, if I had booked it via Frontier's web link to schedule on another carrier or them for up to $400 in flight, I could have booked the same flight and got it reimbursed from Frontier, thus getting the 3X CSR miles from it. Instead I eventually went to the counter and got them to book me on that flight (supposedly the last seat too). I couldn't get the exact reason out of the agent so I wasn't going to try to go nuts with the room like some people have in this thread. I called Frontier to get the cancellation reason and they tried sending me the same form that I had been emailed and also given at the airport. It just said my flight was cancelled and gave me my options for rebooking. It wasn't until I message Customer Service via their website that I got an email stating that the reason for the delay was \"Unexpected Maintenance.\" I printed that email to PDF and that was the last thing I got to upload Dec 1(again I had emailed it to them two weeks ago as well). Either the Dec 1 upload just got seen or they took that long to get to the email version from two weeks ago. I claimed a car rental and gas (I was prepared with Uber screen shots showing a Surge price of $29 from LAS airport the Paris Hotel in case they tried to deny the rental). My rental and gas was only about $38 total so two Ubers would have definitely cost more. As I might have mentioned in an earlier post, I booked the Paris (and I saved them a resort fee due to my status with CET) for $63. I claimed Mon Ami Gabi in the Paris for lunch (about $60 with tip) and Dinner at the Oyster Bar restaurant in Harrah's (about $24 with tip). I also claimed some beverages, $50 in clothes, and an Uber home. About $260 total. They reimbursed the tips (most in the thread have reported the same, but I believe there a few data points where people had that deducted from their claim). This trip delay insurance is a great benefit. I actually hope I get a covered delay in the future. If I hadn't had an eating contest the day I returned, I would have eaten more (though it might have cost them less as I might have just gone to the Wicked Spoon Buffet at Cosmo, or I might have added another meal). I could see burning close to the $500, though, if I had a cancellation on my Friday morning redeye (which I often do to avoid the expensive weekend nights in Vegas). As stated in the quote above, keep checking the status of your claim as they don't really respond or keep you informed. (I will say the one other time I used this benefit, and we just claimed a $45 dinner, I filed the claim by mail and they were more responsive then with a mailed response asking for addition paperwork).", "CSR Delay Insurance for a Missed Connection    I'm flying DCA -&gt; PHL -&gt; SFO on AA in January with an extremely-tight layover\u0097just 33 minutes\u0097in PHL, on an award ticket but with fees paid on my CSR. I'm worried about missing my connection even if the flight is never formally delayed due to weather/mechanical issues, etc., but we just have to wait a few minutes for a gate in PHL or my gates end up being located far apart. If I missed the connection, I'd almost certainly need to do an overnight in PHL or elsewhere since I'm on AA's last flight of the day to SFO. Would these be reimbursable expenses in a scenario like the one I outlined above (or even if the flights were on time but I couldn't make the connection)? What sort of proof could I show Chase that I hustled to try to make the flight, rather than lollygagging around the airport?", "The guide says \"A Covered Hazard includes equipment failure, inclement weather, labor strikes, and hijacking or skyjacking.\"  I'm not sure \"I walked too slowly\" is a covered hazard. In reality they seem to cover all carrier-caused delays (e.g. for crew shortage, etc.).  I'm fairly confident that as long as your first flight arrives later than scheduled, even if just by a few minutes, you'll be covered (though of course I could be wrong). I don't know what happens if your flight arrives on time (door open) but between waiting for pax in front of you, waiting for valet-checked bags, and running through the terminal you miss it anyway.  If this happens please report back! I'd ask for some kind of delay letter in the airport (\"I need a delay letter / military excuse to submit to me travel insurance\") and then also request one on AA's website after the fact (see wiki).  See what it says for cause of delay and pick the one that seems more likely to go through with fewest raised eyebrows.", "Thanks for the insight. The scenario you pointed out is exactly what I'm worried about--getting to the gate technically on time, but between waiting for other pax to deplane (I'm in the first row of Main Cabin) and possibly getting a gate-checked bag (I assume there won't be room for my carry-on, and I'd rather not check my bag in case I get stranded in PHL) not making it to the next flight before the doors close. If anybody else has thoughts on whether this would be covered by Chase, please let me know!", "My opinion is that you are unlikely to get coverage if you misconnect, especially in the scenario above where plane landed on time.   NYCFlyer10001 likes this.", "Wanted to bump this up. Any thoughts?", "34", "74", "78", "79", "80", "81", "82", "83", "85"], "Applying for Chase Credit Cards, 2017-2019": ["Click here for full rules!", "I assume you mean 12/6/19.  If that is the correct date there's no need to wait.  I'd also suggest you look at the wikipost at the top of the page for more good info.", "Oops yeah I meant 12-6-19.  Application date was stuck in my head when typing that.  I read the wiki and other bloggers who mentioned that it might be \"safer\" to apply the next month?", "I'm surprised you even asked the question considering that \"next month\" is &lt; 4 days away.", "Would like some advice on the next best cards to open next. Already have a CSP, and am likely at 4 or 5/24 (how can I tell for sure). I do have a real business with an EIN number if that helps.  P2 has a CS (downgraded CSP) and IHG, but is likely only at 2 or 3/24.  Thanks in advance.", "Look at your current credit report and count the credit cards (both currently open and since closed) that were opened in the last 24 months. It's the only reliably accurate method.", "Thats what I thought but was hoping I could see it in one of the free services like CK or even the credit card programs.", "The data is available on Credit Karma. Click on Dashboard and then click on TU or EQ. Scroll down and you'll see \"Credit Report\"  The opening date is found after clicking on each card.", "Thank you.  Very Helpful! So it looks like I'm 4/24 and my wife is 1/24.  So CIP for both of us? (Can we each open an biz card?) That would put me at 5/24, so what's next for my wife?", "Obtaining a Chase business card does not add to the numerator of your x/24 count. If you are at 4/24 and are subsequently approved for a CIP, you would remain at 4/24.", "Those are fine, just make sure it's a current (recent) report.", "Thats good to hear. So what\u0092s the best order to apply? CIP, CIC, UMP?", "Get CIP first; after approval, refer CIP to spouse.   If you feel adventurous, in about 3 months, have spouse refer you for another CIP (this time, apply with EIN).  I can't guarantee how Chase will feel about this but there have been many (past) data points of folks getting multiple CIPs.", "What should he apply with the first time if not  using an  EIN?", "SS# Quote: Why the 3 month wait? Also, should I look into the United Explorer or MileagePlus cards? Planing on converting UR to United likely anyway.", "Moderator action    Discussion continues here: Applying for Chase Credit Cards", "102", "152", "192", "196", "197", "198", "199", "200", "201", "Click here for full rules!", "I'm under 5/24.  I just applied for and was approved for the ink unlimited.  Is it okay for me to apply for an amex personal cc now?  If I do this, this will put me over.  I'm worried Chase will see this and cancel my already approved application before the card gets here?  Not sure if that's a possibility and whether I have anything to worry about.  Thank you.", "Your'e good to go, Chase won't cancel your new (and approved) biz card if you apply for a new personal card. Whether or not you should apply for a new (non-chase) personal card is another story.   cruisingmickey likes this.", "Thank you 808traveler ! Haha yeah the non-chase personal app is another thing I thought about.  The amex personal is worth more to me at the moment.  I'm going to drop back under 5/24 very early next year so I should be good I think.  Thanks again!  Appreciate your help.   808traveler likes this.", "I just got under 5/24 and applied for a United Explorer card.  I wasn't instantly approved.  I got an email that said I was denied because I had gotten the bonus in the last 24 months (in January 2018). Can I reapply after the two year mark when the bonus was paid?  Also, I am considering getting a CSP, as I have never had one.  If I apply for the CSP soon will that set off alarms at Chase and result in a denial?  Thanks for any advice.", "Are you at 4/24 now? If so you can only apply for 1 Chase card. Which one will do you the most good? You can apply for the CSP now and then, after you go back to 4/24, apply for the UA card after Feb.1 or later.", "Can you apply for a Sapphire Reserve if you already have a Sapphire Preferred? Or do I have to downgrade first before applying? If downgrade, how long do I have to wait before applying for the CSR? Thanks for your help!", "Downgrade to one of the Freedom cards and wait a week before applying for Sapphire Reserve. Note that it also needs to be at least 48 months since you last received a signup bonus for any Sapphire card.   philemer likes this.", "This thread will answer any additional questions you might have: https://www.flyertalk.com/forum/chas...st-2018-a.html", "Hello all , I am new to the forum but I think I've read A LOT of these pages all day LOL (Thank you all for information) I have a question , I applied for the CIP but Chase is asking me for a fictitious business name statement and I live in NYC and I feel its too much of a hassle and time consuming and also expensive to do it and get it expedited( I messed up the application) ; so im just going to let the 30 day rule run its course and then apply with only my name but also the EIN i applied for on day 31 , has anyone had success with applying on day 31 &amp; any advice or tips would be great!", "These recommendations worked and she was approved a few weeks after applying.  Thanks for the help.   RNE likes this.", "You shouldn't need a business name. Just use your name. The name of the business should be something like \"Firstname Lastname\". I'm assuming you used your SSN as the EIN. This is what I did: SSN as EIN, and \"Firstname Lastname\" as the business name. I chose Sole Proprietor, put business income as $0, and put 0 for number of employees. It took about 2 weeks after I submitted the application until it was approved, but it went through on its own without me doing anything (except waiting...).   sdsearch and RafaelE1221 like this.", "Welcome to FT. I wish you'd found us before you applied.   I'd wait ~ 31 days and then reapply with your name as the business name and, if it's a new business, $0 income/sales &amp; the current date and your SS #. No need for an EIN.   RafaelE1221 likes this.", "Chase bonus waiting time? 5/24?    Hey all, So I've don't my first round of chase cards some years back (need to verify sign up dates still).  Question is, how long do I have to wait before getting the sign up bonus again?  I read something about the 5/24 changing to 5/48?  Also, if I close the cards on Jan 1, should I wait a period of time before reapplying?  I'm guessing one full month before reapplying? I have some travel coming up so looking for a good way to score some points :-) Appreciate the input.", "You're a bit mistaken 5/24 is a number of new accounts for approval rule The 48 month rule is the time between Sapphire card bonus. (Not approval date).  It is often advised to not close your current Sapphire card but to downgrade it to a CF or CFU even if you already have it. Then wait one full billing cycle &amp; minimum of 30 days from the date 48 months passes.", "Went 4/24 on 12-6-17.  Is it best to wait till next month before trying to apply for a Chase card?", "101", "151", "191", "195", "196", "197", "198", "199", "200", "202"], "Chase Product Change/Card Conversion: Downgrade, Upgrade, Keep or Cancel? (2016-2019)": ["Click here for full rules!", "Crap the only Chase Marriott I have is the business one. My personal Marriott cards are AX. I bet they will not convert a business to Ritz would they?", "You could apply for a personal Marriott card issued by Chase, and aim to convert it after a year.", "In addition to the above, you need to make sure you have at least 10k credit limit on the card as the ritz card is an infinite card.", "Moderator action    Discussion continues here: https://www.flyertalk.com/forum/chas...ep-cancel.html", "29", "69", "73", "74", "75", "76", "77", "78", "Click here for full rules!", "I would do it, providing that you're not engaging in other behaviors that might set off alarms.", "Yes, but instead of agreeing to a credit pull, TheRoadIsLife could ask to transfer CL from another Chase card (assuming he has one and it has a sufficient CL). Diplomatico likes this.", "CSR - No Downgrade to CSP    In the chase secure message center, I requested to downgrade CSR to CSP to save on AF since I have a spouse with a AU CSR card at LOL/24 (for primary car rental insurance). They said it wasn\u0092t an option to downgrade from CSR TO CSP but only the only available downgrade was to Freedom, which I already have.  Is this correct?", "There is no policy that prevents downgrading a Sapphire Reserve (open for at least a year) to Sapphire Preferred, but there could be something your specific account history. You should try by telephone.   mehudson likes this.", "I have 3 Chase cards, the Freedom card since 12/2013, CSP since 1/2014 and Ritz since 3/2014. I want to get the CSR and cancel my CSP and Ritz. Any idea what would be the best way to go about this? I am thinking of downgrading the CSP to Freedom Unlimited, then applying for CSR as a new card. Once approved I can transfer CSP and Ritz CL to the new card and close them. Is that the best way or is it better to PC? Also, how long do I have to wait to apply for the CSR card once I downgrade my Preferred to a Freedom?", "Hey everyone apologies if this has been talked about already I tried to search for this question but couldn\u0092t find an answer.  I\u0092m moving to a city whose airport no longer has Centurion Lounge (have Amex Plat) but several PP Restaurants. I applied for the Preferred a year ago but I didn\u0092t know about the 48M rule. If I upgrade my Preferred to Reserve, can I then downgrade my reserve later to freedom and apply for reserve in a few years for SUB?", "Yes, but bear in mind that Chase's rules may change, and it will be the rules in effect at the time which matter.", "This is fine, except I see no reason why you should close the Freedom Unlimited after the fact. Quote: One week.", "Where to transfer chase rewards    Hi, I have about 130k chase rewards on a card that is due for annual fee renewal. I do not use the card much so am wondering if it makes sense to close the card and transfer the miles. Is there a way to maintain the chase reward without closing off the card? thanks", "What is the full name of the card you intend to close? What other Chase cards do you hold today?   RNE likes this.", "Hi, Its the Chase Business card. I had the Sapphire over a year ago but I already closed that. thanks", "Which one?  INK Preferred, INK Cash, INK Unlimited or one of the discontinued INK cards? Of those three only INK Preferred can transfer to one of the airline or hotel partners.  If you have INK Preferred you can downgrade, rather than close, and this would preserve the points, but not the ability to transfer.", "Its Business Prefered. Not sure if it makes sense to close it down.", "All Chase Freedom/Sapphire/Ink branded cards use the same UR pts system -- you can move pts around b/w your cards as you like (you can move them to a household member as well) Move the pts from your CIP to another UR pts card that you have or you can downgrade the CIP to CIC/CIU (no annual fee) to keep the pts", "As far as we know, only Marriott co-branded cards can be converted to the discontinued Ritz card.", "28", "68", "72", "73", "74", "75", "76", "77", "79"], "Chase Retention Offers - 2019": ["Click here for full rules!", "I just don't understand. Chase hasn't offered me ANY offers on ANY cards for the past 2-3 years. I have a decent amount of category spend on the Ink Plus and they NEVER offer anything.", "Retention is not an additional reward for past spending, it's an incentive to keep the card open, driven by an algorithm which predicts the probability that you will otherwise close the account.   sdsearch, Drewm33 and 808traveler like this.", "Ink Business Preferred First AF posted a week ago and my spend was the minimum for SUB. Called retention and got nothing so I PC to Ink Cash.", "Ink Business Plus    AF posted 11/1, called on 12/30.  Given $95 statement credit to offset AF.   808traveler likes this.", "What is SUB?", "Sign Up Bonus offered for new card account.", "12-30-2019 Chase Southwest Plus Offered $70 statement credit Had for about a year (annual fee just posted) Enough spend to meet min spend. Nothing after that", "30 days Quote: Just clarifying that the AF is refunded if you request cancellation within 30 days after Chase provides the statement on which the annual membership fee is billed. ie: - if AF line item billed 1/31/2020 - statement spans 1/12/2020-2/10/2020 (Billing terms are 30 days versus 28 or 29 days) - you have until 3/11/20 (one day before the next statement cycle starting on 3/12/20) to request cancellation. - for clarity your 30 days spans [2/11/20-3/11/20] and includes 2/11/20 and 3/11/20 So the actual day that the AF is line item billed is not significant. Pay attention rather to the statement dates on which you see the AF billed instead and calculate from those dates. The only times you have less than 30 days is in situations with cards where the billing terms are say, 28 days long. In these cases a new billing cycle always occurs before 30 days is reached. Since the CSR's billing is 30 days, 30 days is also the same as \"before the next billing cycle.\"", "Southwest RR Business. Annual fee posted 12/1. Called yesterday and was offered credit to offset the fee. Have had the card for a year, only spend was to meet signup bonus.", "$70 SC offered on Southwest Priority. Very minimal spend beyond MSR in the first year (e.g., $5.60 ticket fees, the occasional priority boarding upgrade that the Priority gives 4 of for free, some on-board drinks here and there, etc.). Easily accepted.   Axela05 likes this.", "Southwest Priority    Chase Southwest Priority (personal). $149.00 AF posted yesterday (1/1/20). Called today, asked if there were any retention offers. Rep offered a $70.00 statement credit, happily accepted. Paid the first AF in Jan 2019, opened the card Dec 2018, spent $12k to meet the SUB threshold, no spend afterward.", "Ink Business Preferred $7k annual spend No offer Kept card, will HUCA", "1/4/2020 United Explorer Mileage Plus No offer first anniversary (first year was waived) Spending was for the SUB Will HUCA later.", "Thanks for refresher - when one calls to cancel, can one cancel effective end of cycle vs. immediately?", "Chase Retention Offers --2020 Moderator Note:  The 2019 thread is now archived.  Please follow the discussion here:  Chase Retention Offers  (2020)", "3", "4", "5", "6", "7", "8", "Click here for full rules!", "CIP on my second year. Went to cancel and no offer was made to refund annual fee, etc. 24k spend over the last year.", "No chase calls for the last year. Both cards open for 1 year, some minor spend other than minimum spend, calls right after annual fees hit. Call 1: SW Premier Business - $100 statement credit, accepted Call 2: SW Priority Personal - $35 statement credit, accepted (forgot to ask if there were additional offers).   808traveler likes this.", "Ritz Carlton Card. Third year and first time to call for retention offer. Was given $150 credit.   808traveler likes this.", "12/1/2019 AF posted  12/5 Called for retention offer, received $100 statement credit 1 year, ~5k annual spend", "Ritz Carlton Card - sixth year with this card.  Called in and was offered $150 stmt credit.  I accepted.", "Which card????  Drewm33 likes this.", "Chase Hyatt ($95 version), got $50 statement credit for nothing; $17k annual spend", "I have had an Ink Plus for more than 5 years, primarily for 5x points on office supplies, cell phone and internet. When Citi devalued the Prestige card, I opened an Ink Preferred for cell phone insurance, biz travel benefits. At this point, my office supply purchases are very minimal, called to cancel the Plus on the anniversary, Chase waived AF. Chase Ink Plus 12/8/19 Card member for more than 5 years, moved most spend to Ink Preferred earlier this year, Chase Private Client. Called to cancel on anniversary, immediately offered $95 statement credit (full annual fee).   Happy likes this.", "12/09/2019 - Chase SW Premier Biz - $100 Statement Credit I haven't used the card since meeting the minimum spend, and called on the 1 year anniversary after the annual fee posted.", "IHG $89 AF, offer to downgrade to $29 card - cancelled", "The $29 Traveler card no longer has an AF. https://creditcards.chase.com/a1/ihg...naep?CELL=6310", "I am in the same boat, how did you approach the agent?  Did you just ask if there were any offers available?", "I called 3 times, and at all times was offered to downgrade to the $29 dollar card.", "Called in for my Biz Premier - was offered $50 account credit.", "Have had Chase Ink Biz Plus for years for the 5X office supplies, $95 AF. Called and asked for retention, told there is a $50 offer on the acct: \"Is this to get an offer or are you really going to cancel the card?\" \"Uh, no I have another business card. Is it possible to get the offer? (grumbling) \"Yes, I can apply the offer\" Gotta work for them offers now...", "2", "3", "4", "5", "6", "7", "9"], "Ink Business Preferred- Cell Phone Protection Plan.  Experiences?": ["Click here for full rules!", "I\u0092ve had two claims for cell phones under the Ink policy and while neither were on payment/promo plans, the insurer never asked for a purchase receipt. They asked for a repair or replacement estimate. So my guess is if your promo phone,say, has irreversible water damage then the documentation you send would say it\u0092s X amount to replace and you would receive that amount minus $100 deductible. And you\u0092d keep paying the promo cost (or whatever). Perhaps someone with actual experience can weigh in, but I don\u0092t think it matters.", "What makes a phone not repairable? Water damage should still be repairable right? I much rather put the credit towards a new phone if I had the choice.", "So you actually are not required to proceed with the repair, for Chase to reimburse you? I thought they need the receipt of the amount you \"paid\" for the actual repair.", "You can cash the check and spend it on whatever you want. Quote: They need the authorized repair estimate.", "1", "2", "Click here for full rules!", "Any idea if your screen was unfixable, whether they would have funded the cost of a new device?  There Ts and Cs say so, but I wonder what the challenges would be of upgrading, e.g your S6 was broken but the lowest model they sold was an S8.", "I filed a claim for liquid damage last month and sent in the documentation the other day. Just waiting for response at this point. Question: what happens if I pay my next bill with a different card? Ink Pref was the card used for the last year and was used for the bill before and after the phone damage. Basically, do I have to continue to pay with the Ink Pref to make me eligible? Until my claim is resolved?", "As I read the terms, it just needs to be used to cover the month the incident occurred. That being said, switching away the month after may impact things if you get into a paid ahead vs arrears argument. Do you by chance have a link you can share to the claim form, I havent been able to find it online anywhere?", "The terms seemed ambiguous to me bc of the word \u0093bills\u0094. I\u0092ll just wait till I hear back from them on the claim. Or I\u0092ll ask in a secure message.  They do not make it easy to find the link. https://www.cardbenefitservices.com/...%2fhome%2fhome", "Just submitted a successful claim for my son's phone with a cracked screen and bent frame which precluded screen replacement.  I was worried about the part where I would have to prove the phone was on our family account because we had him using an alternate phone.  Turned out to not be an issue.  I only claimed the replacement value of the phone, but think I could have successfully claimed the original purchase price of phone.  Carrier was Cricket wireless.", "Had a successful claim recently. Water damage to iPhone 6 w/ ATT service. Used the damage report form they sent me (Apple store filled it out). I was reimbursed for the \"replacement cost\" ($299) minus the $100 deductible, so received $199. I opted to purchase a newer model (and more expensive) phone. I will say that the claim sat there for over a month with no response until I inquired. Then resolved in a few days. Overall a good experience.", "Was your son's phone line in his name on your account or in yours?", "So here's a question. I have a 4 year old iphone 6 with 64GB that cost me $300 (I do have the receipt) that has been damaged. When I started to fill out the claim form online, it asks for phone date of purchase and for \"amount claiming.\" Do I just enter $300 or do I enter the cost of the replacement phone. The cheapest one available on Apple is the iphone 7 w/ 32GB for $449 or 128 GB for $549. There is  are no iphone 6 and no iphone 7 64GB.  Do they reimburse for replacement cost or for original cost? And what should I put in the \"amount claiming\" box? Thanks. Edit: I should add the nature of the damage: I dropped the phone and now have dead pixels that are spreading across the screen.", "$200 appears to be applicable benefit amount. Benefit Guide is here: https://www.chasebenefits.com/inkpreferred Scroll to page 48: Quote:", "Yeah, I saw that but then wasn't sure if it was for the replacement purchase price.", "I've gone through this, and the benefit is capped at the lowest of: 1. Repair cost minus $100 2. Purchase price minus $100 3. Replacement cost minus $100 Or, for excel folks: F=repair cost P=purchase price R=replacement cost Payout=min(F,R,P)-100   mia and Stgermainparis like this.", "Apologies for delay in responding.  Phone was in my name on our family account.", "I confirm that this was the case. Had another claim for my daughters phone (this time on my Chase Ink as I switched account to my card). Water damage on old phone. Original cost of $749, replacement cost of $749, claim paid $600 (749-100 = 649, max claim is 600).  All the phones are in my name.", "Does anyone have any experience with what happens if you dont have the original purchase receipt?", "Phone on a carrier purchase plan??    Any experiences with phones that are purchased under a carrier's purchase plan? Specifically, I just got a Pixel 4 under a promo. I paid $100 or so up front. Every month I'm \"paying\" $33 for the phone, and receiving a $33 promotional credit toward the phone (net $0 cost each month). I wonder (and don't suppose anybody has exactly the same situation to report on, but would appreciate any data points) whether they'd cover the phone at the 24 months * $33 + $100 ($892), or whether they'd be looking to deny the phone cost me $892. Anybody with ANYthing similar to report on??", "1", "3"], "Chase/UA offer: spend $2000, get 2000 bonus miles (ends Dec 31)": ["Click here for full rules!", "congrats. I can relate. Your credit history may have been built with this card but your credit score is not attached to it. Give some thought to moving on to something better.", "App-o-rama in 2020, and this MP Select may become a resident of the sock drawer, if that. I'm (foolishly?) hoping it gets yanked by Chase/UA and I get a sweet deal on another one. Not a bad card, but, alongside CSR, doesn't do too much, esp exSEA. Still, the 2k for 2k got my attention.   Clincher likes this.", "I got spend $500 get 2500. Seems great, and I started, but then my annual fee hit on 12/1 and I don't think this card is a keeper. They clearly sweetened the pot for me given the annual fee. Tougher call. I don't really use the lounge, but I sometimes use the expanded award availability. And I get some extra points through MileagePlusX by having the card, but not a ton. Feels like I should dump this card and move on.", "Qualified, but still don't have a strong affinity for this card.", "1"], "Chase Card Referral Issues [consolidated]": ["Click here for full rules!", "Received this response: \"We understand your concern about referring a friend to  become a Chase cardmember. Please allow us to share that an issue with regard to the  referral link has been reported. Hence, your friend is  experiencing the same. We sincerely apologize for the  inconvenience this may cause. James, please know that we're working to correct the issue as soon as possible. Although we do not have the estimated timeframe when it will be resolved, your friend may try  again at a later time. We appreciate your patience and  understanding in this matter.\"", "Chase really needs some lessons from Amex on the whole referral thing.   On Amex, referrals are easy to find from any page on any card, easy to sort through, instant to send and received nearly instantly via email.  Or you can cut and paste your personal link.   They also post quickly after the person gets approved.   Chase, not so much.", "My referral links are working again.", "Chase Refer A friend    Can anyone tell me how long it takes for points to show on ones account after a friend used your link to apply and and got approved? Newbie here.", "Referral pts are pending Tuesday nights in 1-3 weeks (check rewards portal \"Earnings on Next Statement\") -- they should post when next statement generates", "My referral links still aren't working. The link seems to work, but when you click \"Apply\" it says \"Offer Unavailable\". Chase customer service says \"they're working on it\" and there's no way for them to manually credit the points in the interim. Anyone else still having this problem?", "\"Points currently unavailable for redemption\"???    Back in the summer, I generated a Hyatt referral code for my P2, then shortly after closed my Hyatt card.  My P2 was denied twice due to supposedly having received the bonus previously in the past 24 months, but was finally approved the first of Oct.  This week I get a statement for my closed Hyatt card showing a 5000 point referral bonus, then 5000 points \"currently unavailable for redemption\", and 0 points transferred to Hyatt.   What's that all about?  I earned the points, but they won't give them to me?  Is there a way to make the points available?", "It's in the terms of the referral program which state in part: Quote: Basically, the moment you closed the account before the referral bonus was awarded you became ineligible to earn the bonus.", "Is this different from other chase referral products?  We have referred each other for the CIP before and gotten the bonus after closing the referring account.  Whether its in the terms or not, it seems to be a common theme that you can generate a referral just before closing a card and still use it.", "Did you close or downgrade the CIP?", "trying to refer    I have a Chase Ink Business Cash. When I enter the required info at the Chase referral site, it provides a URL to provide to the business owner but the page with the referral URL describes the Chase Ink Business Unlimited card. I don't want to refer them to that because they already have that card. Any idea what is going wrong? Are the Ink Business Cash and Ink Business Unlimited considered the same card by Chase?", "They're not the same card, but you/me/everybody can't refer to the Ink Cash anymore. However you can cross refer to the Ink Unlimited from the Ink Cash.", "Just my luck. I thought I actually had a card that I could refer someone to but the already have the Chase Ink Business Unlimited card", "2", "3", "4", "5", "6", "7"], "Chase 1099 for referral &amp; other bonuses: paperless, retention, etc [Consolidated]": ["Click here for full rules!", "Under what provision of the Code?", "I just called customer service and they admitted mistakes were made on their end and they'll send out a corrected form ASAP...so hopefully before mid April? It's pretty upsetting that Chase knows it made a mistake, but made no effort to notify their customers of this mistake. There are plenty of people who will file their taxes before the correction is received and will have to make the additional effort to file a correction.", "Chase 1099 MISC received, no activity to support it I\u0092ve received two 1099 MISC for $500 and $100, respectively. I have gone through a lot of blogs/threads, but have seen nothing resembling my issues, so I am adding this experience tothe mix. BTW, I have spoken with Chase customer service reps and even the 1099 reps, and it is indeed an endless loop of ignorance. EG, when I ask the 1099 rep to explain what the listed amounts are for, I will be told that they don\u0092t have the records on my account and that I will have to talk to customer service. Customer service in turn knows zip and just wants to get rid of me, so they transfe me to the 1099 rep, who seems to be based in India. Of course,they know squat about US tax law. So, the $500 \u0093income\u0094 was from a Freedom Unlimited card. I got the card in August 2016 by downgrading a Sapphire Preferred card (to avoid the annual fee). I have never made any referrals or received any rewards. I transfer all points earned on this card to CSR. The $100 was for a different Sapphire Preferred card that I closed about a year ago. I had it for less than a year and never used it after meeting the spending requirement for the 50K sign up bonus. The rep I spoke to told me (believe it or not!) that since the account was closed, they no longer had any records to provide, including any information on when the account was opened. I did file a complaint with the CFPB on the $500 item. The bank\u0092s response was very desultory, like an assembly line response. They claimed the $500 was for a \u0093reward\u0094. They provided no specifics, just an attachment of \u0093terms and conditions.\u0094", "Puzzling. Neither of my 1099 MISC has any information of this kind. All it says is \u0093other income\u0094 box 3.", "Anyone receive a late 1099 from Chase.  I just got letter that they are sending me 1099.  Not too happy.", "Anyone just get 1099 from Chase for 2018 Taxes    I just received 2018 1099 from Chase.  Anyone have advice what to do.  Should I file amendment.  Thanks", "Many of the travel blogs are covering this issue, so I will refer you there for the full story. https://www.doctorofcredit.com/chase...d-filing-fees/", "Received my 2108 1099 today.", "Where do you go to see the referrals they are claiming you got.  Mine seems off.", "The 1099 lists account numbers...use that.", "Any updates on this 1099.  I finally had time to call Chase.  I have Chase Ink card and was told that I was sent 1099 for $600 for redeeming Hyatt points from Ultimate Rewards points.  Doesn't seem right.  Any recourse to get the 1099 reversed?", "If you make the request before the 1099-issuer (Chase) has submitted it to the IRS, Chase can agree not to submit it, notify you in writing, and you are done.  Keep that notification because mistakes happen and you may need that to show the IRS that the document was improperly issued. If you do not act relatively immediately and Chase has already submitted the 1099 to IRS, you need a corrected 1099, e.g. one showing that it is \"corrected\" and for $0. If the issuer will not cooperate or disagrees with you, you are left to prepare your return showing the Chase income at $0 and then providing a written explanation to the effect that you disagree with the specific 1099.  Many suggest that this significantly enhances your audit risk, so you have to weigh the amounts involved against your audit concerns.", "Did you earn any UR points from banking or referrals in 2018?  Even though the explanation is wrong, the 1099 may be correct. I would call again, and see if the same explanation is offered.", "1", "2"], "11.15.2015 Ultimate Rewards transfer ONLY to own &amp; AU's airline/hotel accounts": ["Click here for full rules!", "I don't recall I have done that before. I've had another AU but I recently removed him.", "UR transfer to Hyatt not instant.. what could go wrong?    I added an employee card on 12/25 and transferred some miles to his Hyatt account the same day. The transfer is not instant - still not confirmed after 48 hours.  I have a Ink business card. Called Chase and they told me to wait 7 business days..  Any idea?", "Is the employee also an owner of the business? Quote:", "2", "6", "7", "8", "9", "10", "11"], "Chase Luxury Hotel Collection": ["Click here for full rules!", "Thank you!!! ^", "Thanks for confirming what I already suspected. To me, switching hotels is a minor inconvenience to get guarantee an extra $200 in F/B, especially with the minimal distance involved. I prefer the MB/Del breakfast options (not great, but better than MGM/Sig) and think the MB restaurants offer a little more variety than MGM.", "Oddly, i have a different number from a reservation i made a couple months ago.  Try it if you have a problem with the other.  please call us at 1-855-234-2542", "That is the number to Chase Travel which is different from LHRC.", "I looked at the lhrc reservation that I made on 6/6 for the Signature Vegas in October and that was the number on the confirmation. Maybe reservations made via different routes get different numbers to call I cant seem to login to lhrc directly so i go to chase - card benefits - lhrc.", "I was rechecking the rates on my MGM and Mandalay reservations in November and saw that there is a difference in the benefits described in the card member benefits and the property overview sections. The card member section has a $100 food credit but the property overview mentions a $100 spa credit.  I wonder if they are changing to a spa credit like Amex. My reservation confirmation has the food credit listed so Maybe just a website issue.", "Hi I was wondering if you have verified yet weather you get a spa credit or a F&amp;B credit? I noticed this discrepancy also in the descriptions for MGM grand, MGM signature and the Aria.", "I stayed at Mandalay and signature over Halloween and got the F&amp;B with no discussion.  My belief is that it\u0092s a website issue for now but I do worry about next year.", "I am a little confused by this site. I am looking at the list of Vegas hotels on a specific date and there is one price for the various hotels but when I click through all the prices for that property are higher . The price that had shown on the previous page with the list of hotels and their prices is nowhere to be found. What am I missing here?", "The MGM properties will be switching to a spa credit instead of a F&amp;B credit in 2020. It's not on the Chase LHRC website yet but it is listed on the Signature Travel website (which is what Chase uses for the hotel program). Bad news for me since the spa credit isn't as useful. However, for some it might be great - for example, Park MGM is upping the spa credit to $100 (instead of $50 F&amp;B): 2019 Exclusive AmenitiesFull Breakfast for each guest daily in Primrose (Up to 2 guests per room, $30 per person credit, per day) $50 Food and Beverage credit, per room, per stay Complimentary Wi-Fi The following amenities are subject to availability at the time of check-in/departure:Upgrade Early Check-in Late Check-out 2020 Exclusive AmenitiesBreakfast daily ($30 credit per person for up to 2 people for purchased rooms or one-bedroom suites, $30 per person credit for up to 4 people for purchased two-bedroom suites). Applicable at Primrose Café at PARK MGM only; excludes in-room dining $100 Spa service or facility pass credit, per room, per stay at The Spa at Park MGM. (Not valid for salon or hair services, merchandise, or cross-property charges. Tax and gratuity not included) Daily $5 Wi-Fi credit applied toward Daily Resort Fee, subject to applicable tax The following amenities are subject to availability at time of check-in/departure:Upgrade; certain room categories may not be eligible for upgrades Early arrival based upon request Late checkout based on upon request", "I noticed that too. I'm not sure what was going on with it. I stayed last week at Cosmopolitan of Las Vegas on a LHRC rate. We were upgraded from a Terrace Studio to a Terrace One Bedroom although I think that was due to my Marriott status because the agent wasn't aware of the rate until I asked about the breakfast and F&amp;B/spa credits. She didn't offer and I didn't ask for a further upgrade, but it was during marathon weekend and the hotel seemed fairly full. We had a great breakfast at Wicked Spoon both days and used the $50 F&amp;B to cover the buffet drinks package. Credits were applied automatically on my account which was nice vs having to go ask about them at the desk. Tips were not included and did show up on the folio as expected.", "LHR Booking - Restaurant Selections for MB &amp; Delano    I\u0092d like to book at MB and Delano with LHRC for the $100F&amp;B credit. What are the restaurant choices we can use the F&amp;B credit? Are we restricted to eat on property or can we venture off to eat at other MLife restaurants? Also, we need 2 rooms and I see there\u0092s a 2-bedroom suite at MB. What are the chances of booking 2 of their suites, hoping to get the big 1450sq ft Suite w 2 bedrooms?  Had anyone gotten a nice upgrade for these bookings?", "I did Delano using AMEX FHR a couple of years ago and MB using Chase LHR last month. F&amp;B credit is limited to the restaurants in Delano and MB, but not at another MGM property. Each time, I got a room with better view or slightly larger room. You may try $20 sandwich trick but I wouldn't rely much. Suite room at MB may cost more than 2 regular rooms considering all the benefits. All Delano rooms are suite with a completely separated room from dining room. Regarding F&amp;B credit, there's a rumor that any booking from next year (2020) may switch to spa credit. I recommend to book before end of this month since the reservation is refundable anyway.", "9", "13", "14", "15", "16", "17", "18"], "Chase fraud alerts &amp; fraudulent charges  [consolidated]": ["Click here for full rules!", "Sorry to hear about the difficulties you experienced. When even a Chase employee is rolling her eyes at the procedure, it does seem like someone got carried away. But to your question about whether \"the experts here think\" Chase should give you extra time to meet the initial spend, I doubt if Chase will be swayed by the court of public opinion that is FlyerTalk. In other words, it doesn't matter what people here think. Ask, hope for the best, and expect the worst. Good luck.", "I expect SchmeckFlyer is asking if we think it's worth expending the time and effort to request extra time. I wouldn't bother. Even if you can work your way through the layers of agents, supervisors and managers to someone who has the authority to change the terms, I wouldn't have confidence that the change would be implemented, which means another run through the bureaucracy if the bonus did not post. However, I would ask Chase (by SM) to confirm in writing the amount of the bonus, the spend, and the exact date by which it must be made.", "Wow, this system is utterly useless. I approved a charge immediately three times and it asked me to retry and it still got rejected. Just went with my Amex instead. Come on, Chase.", "Just got off the line with the fraud dept. They were professional and polite. My Freedom card somehow got hacked but the idiots tried to do a test run using it on-line (which is something we never do) and it ran afoul of the algorithm and the charge was declined. We had used this card consistently at supermarkets since that was the 5% category this past quarter. Now we have to wait for new cards to be sent  I wonder how many centi bitcoins the hacker had to spend for the number.  msp3 likes this.", "I was never able to get a legit charge to go thru because I answer Yes on the txt or email or even call them on the phone.   The agent will tell me that the charge is already rejected and I need to tell them to charge it again.  But then it won't work.   So pretty much if you get the fraud alert on a legit charge, you just have to switch to non-Chase card. I think the purpose of sending you the alert is not for your to confirm a legit charge.  It is for you to confirm that it is a fraudulent charge so they could stop your card until you call them.", "FWIW, my most recent experience with those texts/emails involved a Circle K gas pump (and the charge did go through after answering Yes). I don't typically get declined charges all that often, however.", "Good to know.  My last one was a new vending machine installed at my work that takes credit card.   I was just trying to get a 20oz of coke zero.  Answered yes, still rejected.  Switch to another Chase, still rejected.  Now I have to answer Yes on a different txt.   So wait a few days.. same thing.   Eventually it did work after a month or so... Although the charge is $1.50 and from a vending machine, so it could look suspicious.", "A first one for me after a long life of credit card use. Puzzled by a mobile fraud alert on a Chase card number unknown to me. An email alert mentions the brand new Chase BA card. I applied for this card on August 23rd, 2019 and was instantly approved. This morning on September 4th, not even two weeks later, a long list of charges were made with this card. I didn't even receive and activate the card yet ! Fraud agent remarks: \"Too early for you to have received it - intercepted somewhere - happens every day\".", "Similar report, 2012, American Express: Quickest case of fraud ever?", "Chase UA Visa card WIFE CANCELLED    Sharing wife's experience with Chase Visa. Wife called Chase this morning to tell them she was going to buy $500-$1000 in gift cards at Vons Grocery Store this morning (Vons had a special deal).  The Chase operator said not a problem, as her credit limit was very large.  Wife told her it has been a problem for two years in a row.  Chase, not to worry.   Wife goes to Vons and tries to make the purchase (one hour later), but card not honored AGAIN this year.  The first year, okay as she did not call first.  The second year angry, as she called first.  This year really embarrassed as a lot of people were giving her the \"poor old lady\" overspent her card look.  Vons tried to process twice.  Meantime I got an alert on our pc (I was home) that the card had been declined and was it okay to allow it.  I replied YES to both.  I then called my wife's cell and left a message.  She was trying to call Chase but was put on infinite hold.  Bottom line, the clerk at Vons decided to split the purchase into two smaller purchases.   The first went thru ($500), the second did not.  Wife eventually used a different card for the balance of the purchase.  This complicated the Vons points we were to get with the gift cards purchase (a different issue, but Vons called \"headquarters\" and we got our points a hour later). When she got home, she was really upset.  I told her to call Chase and tell them what happen and ask for a waiver of the card fee for one year, after three years of hassle and embarrassment.  She called.  Gave the operator the ladies name at Chase that she talked to.  Chase is sorry but cannot provide anything more.   Transferred to customer retention.  Asked for waiver of card fee.  No deal.  Asked for UA points.  No deal.  So after being a card holder for more than 3 decades she cancelled!   I, hubby, have card too.  We use her card for UA Flight purchase, baggage check, boarding line status (when not in Business) and historically to get the \"free club passes\" which we seldom use, as we are usually in business international, and seldom can use the club before our domestic departure.  Up until the last few years those passes were gifted on FT.  Now they are electronic and mostly just die.  In the near future we will just use my card when flying UA.  Maybe resign up in two years and get bonus points and a free year?   Did I suggest her to try something unreasonable?  What would you have done?", "There are lots of threads here and in the UA forum about the impact of United's recent mileage plus changes on people's desire to hold the card.  The majority view appears to be that it's not worth keeping the card, and certainly not worth putting any spend on it considering the alternatives that provide better value and more flexibility (primary alternative: CSR).  My wife would probably have cancelled her card after that experience as well (alas, Chase cancelled it a few years ago for inactivity... it was the $0 AF card)", "Chase's fraud alerts can be finicky. Sometimes they alert on identical transactions that haven't in the past, sometimes the email to clear the fraud block works (or doesn't), etc. Unblocking a Chase fraud alert isn't reliable in my experience. Personally I wouldn't have even thought to ask for a fee waiver in this situation, but wouldn't have expected them to give me one if I had. Anything's worth a try I suppose. I would have just chalked it up to Chase's annoying fraud alert system and moved on with my day. Though since you say your wife had the card for a long time, the rule is 24 months from you last bonus, so you could in theory wait a couple months and have your wife apply again. As notquiteaff alludes to, UA miles are of a lot more questionable value than they used to be, but that's up to you. It's probably only worth it for you to both have the card if you frequently fly separately.", "Just noticed 4 unauthorized charges on my CSR card. Called the Sapphire help-line, then got transferred to the Fraud department. They are sending me a new card. I have not had any fraudulent charges before on this card, so I am a bit surprised. Hopefully I will not encounter any other trouble.", "Card numbers are often compromised in bulk data thefts, nothing to do with your physical card. The numbers are subsequently bundled and sold. The replacement card number would not have been compromised in the same incident.", "If your card was on Apple Pay, pull up the wallet on your phone and you will see that the last four digits have changed from what they were to the last four digits of the new account (I'm talking about the numbers you see on the card image, not the device account on the details). There may even be a legend under the card stating that you can continue to use the card on the phone without interruption. This is a great feature. I've no idea if other e-wallets (Google Pay, Samsung, whatever else might exist in the Android world) support this feature.", "4", "5", "6", "7", "8", "9"], "High Spend on United MP card": ["Click here for full rules!", "This roundabout could go on for a long time but when it comes to the card spending you're a customer of Chase. When you redeem points you're not a customer of Chase but of United's MP program just like every other MP account holder if their miles came from flying or from spending.  They extended a one time privilege of silver status with them to try to earn your flying spending and you didn't fly. It's over. Move on.  If you want to be shown some sort of concession for spending move to the DL Amex card that promotes EQMs for spending towards status or another program that does so but this ongoing attempt at justification for your spending here isn't going to get you there.  [QUOTE=stemme;28116816] Quote:", "While my experience in such realms is limited to a specific large hotel chain I learned a lot about how their points worked. And rarely did they issue points at a price point in large numbers that were less than they determined their worth for redemption. Points to a corporation are cheap mostly because of the tendency to either not use them or to redeem them for a very poor value. This is why they're a source of income for a program.  Quote:", "Let's also not forget that the airlines can devalue their points at any time.", "You are generating profits for UA. But it does not make you a UA customer. Using your logic, can I say I paid federal income tax because I have spent my money? Quote: You are definitely a customer, but not a profitable one.", "\"You are definitely a customer, but not a profitable one.\" Here's something that has a different perspective.. https://getpocket.com/explore/item/a...=pocket-newtab \"For carriers such as American Airlines riding Citigroup Inc. plastic, or Delta on American Express Co., these programs are a cash cow, a golden goose, or any other fiscal livestock you care to conjure. Each mile fetches an airline anywhere from 1.5 cents to 2.5 cents  1  , and the big banks amass those miles by the billions, doling them out to cardholders each month. \"", "I would argue that stemme is definitely a UA customer -- you might not be flying on their planes much, but your credit card spending is generating a fair amount of money for them and you would not have the credit card if not for the strong United brand and the ability to redeem miles to fly on their airplanes. Even better -- a customer that is demonstrating engagement (by spending on the CC).", "Sure - airlines make a lot from credit card deals. But again - there is no direct causation. For example, UA earns its money directly from Chase, which Chase earns its money directly from you. If UA truly values credit card spending, UA would not eliminate PQD, as well as its waiver. Also - don't forget, when you earn miles from credit card, while the airline profits from the bank, a liability is also created for the outstanding miles. When this is not an official position, I would see airlines will say that the money the airline earned from you has been even out by the liability. Hence, a customer that is not profitable.", "1", "2"], "Help with next (Chase) CC(s)?": ["Click here for full rules!", "Also I think you are still misunderstanding 5/24.  It is only affected by your credit report.  For instance I was at 3/24 at the end of October.  I applied for both the Amex Platinum and the Hilton card on the same day.  Amex doesn't report until your second billing cycle.  A few days later I decided to go ahead and apply for the IHG card.  According to my CR I was only at 3/24 because the Amex cards hadn't reported yet.  I was at 3/24 for almost a month before the IHG card hit my report, making me 4/24.  My Amex Platinum will post sometime tomorrow night or the next day putting me at 5/24.  But until then, Chase will only see me as being 4/24.", "Yeah, I understand that about non-Chase cards for sure, but Chase (if they want to) could see that someone has new cards with them (although not on the credit report yet). Maybe they'd never do that though...? Cheers, --Kyle", "Actually, that's not quite correct.  It's not the card issuers who combine pulls.  It's the bureaus (EQ/EX/TU) who combine pulls if they can't tell them apart.  The pull only includes information about the issuer and the date, and so if two pulls come in looking the same with the same date, the bureau can't be sure whether they're duplicates or not, so they don't count these potential duplicates. The reason business and personal pulls don't combine at most banks is because the bureau can tell them apart, because the issuer puts info in there that's different for personal apps than for business apps, because they're handled by a different group of offices within the bank.  So a bank A personal pull might come into the bureau saying something like \"bank A consumer services\" while a bank A business pull might come into bureau saying something like \"bank A business services\".  The bureau can't tell two \"bank A consumer services\" pulls apart from each other that have the same date, but it certainly can tell there difference between \"personal\" and \"business\".  (The actual IDs of two groups within the bank may be very different -- they could be alphanumeric mumbo jumbo, for all I know -- but the illustration is just to make clear that they are different enough to not have any risk of being duplicates of each other.)   bgriffin likes this.", "We have plenty of data points (in the Applying thread) that show that for whatever unknown reason, Chase evaluates 5/24 by looking at your credit report and nothing else (specifically, nothing within Chase's databases). There were people who applied in cases where they'd be at 6/24 or above if Chase was counting their own business cards opened months ago, but 4/24 or below if Chase's didn't count those, and all of those people were approved. Multiple data points of that sort proved that Chase wasn't counting their own business cards. Now, of course, Chase could change how they do this count tomorrow. But so far we have not had any datapoints showing that they've changed their count. Ie, we're not guessing about what Chase does. We're gathering evidence about what Chase does. One person can't do that easily alone, but a collective community like FlyerTalk can.   bgriffin likes this.", "1", "Click here for full rules!", "Help with next (Chase) CC(s)?    Hi All, I have some big expenses coming up (probably could hit $10k or so in minimum spend for signup bonuses), so it's a good time to apply for a card(s) that might need a significant signup bonus. With Chase, specifically: I'm now at 4/24 after getting the two cards below... Early October 2019 - Applied and approved after about 10 days for Chase Southwest Performance Business card (with $5,000 credit limit) November 1st 2019 - Applied and instantly approved for Chase Southwest Plus card (only $2,000 credit limit) Other Chase cards I have:Chase Ink Cash ($6k limit - total of $11k limit on my two biz cards) Chase Sapphire Reserve ($33k limit) Chase Freedom ($22k limit) Chase IHG ($10k limit) So a total of $67k credit limit on personal cards, plus the $11k on biz cards, puts me at $78k total CL) And I have a Chase personal checking account And I just paid off a Chase auto loan a few months ago (which caused my credit score to drop a lot) Anyway... I'd like to use up my last one (or two?) Chase slots. Suggestions on what I should do? Chase Ink Business Preferred - 80k on $5k spend. I would like this card the most for the big signup bonus! But with the 2 Chase Biz CCs already (and considering just $40k in biz revenue), are my odds low? I'd like Chase IHG Premier, but the bonus was 125k + $50 credit and now is just 80k points.  I'd like Chase Marriott Bonvoy Boundless, but the bonus was 100k and now is just 75k points.  Also, I had the old SPG personal (and Biz) cards, so I'm not sure if I'm eligible? And I'd like to have the Chase Freedom Unlimited, but it seems a waste of one of my 5/24 slots (considering I get more from sign up bonuses than I would from actual spend)... Chase United would be good too, but I need hotel points more than airline points right now (and don't really like United)... Should I try applying for the Ink Biz Pref AND the IHG or Marriott on the same day? Or would that make it unlikely that I would get the Ink (and maybe get the IHG or Marriott)? And which should I try for first?  I could also get non-Chase card(s), like the Amex Marriott Biz (but again, am I eligible if I had SPG Biz)? And I'd prefer to use up my last Chase spot first. FYI, my credit scores are 807 Transunion, 802 Equifax, and 790 Experian. Experian dropped from 836 in July to 814 after my car got paid off and then to 790 after the two new Chase accounts. Sorry for so many questions! Thanks for you help and opinions, --Kyle   bgriffin likes this.", "Bump? bgriffin , you posted a reply but looks like it got deleted (or you removed it)? At any rate, I saw it in my email and you made a good point that occasional pre-approvals may show up for Chase branded cards, but not co-branded cards. And also a good point about opening a Chase Biz Checking account and applying for CIP then... Maybe I'll do that. And right afterwards apply for either the IHG Premier or Marriott Bonvoy Boundless. It's just unfortunate those two have lower offers right now. Thx, --Kyle", "That's weird that it got deleted.  How odd.....", "i have 3 business cc and i only put 10k rev.  id get the preferred then get a freedom unlimted after.  i put a lot of spend on mine to get 1.5x points on what id usually get 1x for   kyamnitz likes this.", "It didn't get deleted just separated. The questions were diff. enough that they deserve their own thread. @:-)  Adding on to someone's question can cause confusion for our readers. Best to start your own thread in most cases. ^ See Need help on deciding which card to get next... bgriffin likes this.", "Hmm, odd, as it added some helpful info for me (to my post)!  But yeah, he's asking similar, but also different, questions. Thx, --Kyle", "5/24 as of today - one more Chase card today?    Hi All,  I just got approved (in branch) today for the Chase Ink Business Preferred. I was at 4/24, so now I'm at 5/24. Is there a window to apply for one more card today?  Or is that a bad idea (upsetting Chase perhaps)? Obviously (since I got down to 2/24 recently), I haven't gotten a lot of new cards lately. However, I got 2 other new Chase cards: Chase Southwest Performance Business around October 7th (to become 3/24) then Chase Southwest Plus on November 1st (to become 4/24). Should I try for the IHG, Marriott, or Freedom Unlimited? Or just be happy with what I got? I shouldn't have another inquiry since I'd be doing it on the same day. Thanks!  --Kyle", "Business cards shouldn't affect x/24 and nothing affects it until it hits your credit report.  For Chase purposes you are still at 3/24.  I wouldn't get in a big hurry.", "Well all of those cards were with Chase though. And I think Chase's own biz cards count towards 5/24 limit... At any rate, the main thing I'm trying to do here is get another card without another credit inquiry AND to get another Chase card while (if) I can. I have a lot of big expenses coming up, so now's a good time to get it and meet my minimum spend requirements. Thanks,  --Kyle", "Chase business cards do not count towards 5/24.  But it sounds like what you really wanna hear is yes apply for another Chase card.  So by all means apply for another Chase card.", "Why are you worried about an inquiry (aka hard pull)? They only drop your score a bit and it'll bounce back up in a couple months. Applying for two cards in one day will not combine the inquiries.  Chase can deny you a new card even if you are under 5/24. One reason I've seen used is \"too many recent cards\".  So feel free to apply but don't be surprised if you are turned down.  You really need to spend some time reading the wikipost in the \"Applying for Chase credit cards...\" before you attempt applying for another card.   bgriffin likes this.", "Hey,  It's always better to combine pulls in day if you can and keep that score up, IMO. Most card issues DO combine pulls for two apps in a single day. Chase included. That said, I forgot that business + personal apps might not be combined. However, if you read here you'll see reports that business and personal have been combined.  Yes, I realize I may be declined for reasons other than  5/24. I've read a lot about applying for Chase cards and have played the game quite awhile now.  I stand corrected on the Chase Business Cards counting towards 5/24. That used to be the case as you can see here, but apparently that changed at some point (text said they do count, is crossed out, and new text says that now they don't count). :-) So I won't rush to my next card as I should only be at 3/24 if that is correct. But the reason I started this post was because I wanted to get another Chase card in now while I have upcoming expenses to use it on and assuming my 5/24 slots were gone. Otherwise I'd apply for a card(s) with a different issuer and lose my ability to apply for Chase cards. Make sense? Now I'll probably wait a bit so that I can apply when Chase has a better bonus on the IHG or Marriott cards. Thanks,  --Kyle", "No, I wanted advice. Not sure why you're being snippy about it? I chose not to apply now because I learned that Chase biz cards don't count towards 5/24 - read the article I linked to above that had stated they did. That's how I had that knowledge. At any rate, the question I was trying to ask was is if you're at 4/24, if you can get two cards on one day (even though you'd be over 5/24). I searched more on DoctorOfCredit and found out that some have been able to do this. But no, I won't apply for another card now because I can wait until IHG or Marriott has a better bonus. Cheers,  --Kyle", "Wasn't trying to be snippy at all.  When someone puts up roadblocks to perfectly reasonable (and factual) replies it's generally because they are not getting the answer they want. I totally get wanting to pick up an extra Chase card now.  I have about 36 hours to decide if I'm going to apply for the Hyatt card or not before I'll go from 4/24 to 6/24 (because I did with Amex what you want to do with Chase).   Which card is best for you depends entirely on what you want to get out of it. Personally I am chasing (no pun intended) cards that have long term benefit to me as opposed to focusing on SUBs.", "Gotcha, thanks man. Maybe I'm a bit on edge with personal issues that have nothing to do with this.  Anywho, I don't do a ton of organic spending, so SUBs are key for me.  I'm slowing down with Amex myself after a huge run with them! I hadn't gotten any new Chase cards for years because of 5/24, but I had finally slowed down enough to be able to get a few. I probably need the Marriott most just because I don't have a way to keep my points alive with them unless I get one of their cards. Just hoping they up the SUB again! Thanks, --Kyle", "2"], "Chase Freedom 2019 Q4 Bonus Categories: Department Stores, Paypal and Chase Pay": ["Click here for full rules!", "Thanks for the info on Paypal Digital Gifts, i did not know about this. Can you confirm you received the 5% extra points by buying gift cards thru their site with the Chase Freedom?", "It worked for me.", "And for me.", "1", "2", "3", "4"]}