{"Going over credit limit": ["Click here for full rules!", "Just curious,  but any update on the situation?", "She increased her credit limit through the website without a hard pull. VFW explains why issuer's don't like you to overpay credit cards https://viewfromthewing.com/paypal-s...ks-like-fraud/ , although I don't believe this would apply to ACH payments rather than pay by check.   GUWonder likes this.", "r/creditcard Quote: Yes, the article linked here indicates that the \"danger\" to credit card companies of overpayment would only apply to checks. However, in real life I believe they also watch mid cycle ACH payments. Some will even limit the amount of mid cycle payments one can make. On Reddit's r/creditcard sub, users there post about paying off their balance every week, every day, or even every transaction. It is mostly done because of OCD. Personally, I never spend money I do not have, but yet I like to take full advantage of free use of the credit card company's money. I have autopay set up to pay the statement balance on the due date. I do nothing, except make sure I have enough funds in my checking account. The only time I make a payment mid cycle is when I need to spend more than the credit limit.", "Glad to hear she got the increase! BTW for Prestige (which one was her card?) is always a \"flexible spending limit\" CC so it can go over the limit, by how much .. I don't know as I never have gone above my limit. I would guess it could allow $1-2k above? As for the CL increase I have been having luck. I request every 6 months and get increased by $7k. I also have received small $1.5k increases made on Citi's behalf. So it's very handy to use the credit line increase button in the app or website. I recommend everyone that has a card and is eligible to try it, such like in this case scenarios. I only have requested them through the App. My card is 10 months old.", "1", "Click here for full rules!", "Going over credit limit    A friend asks if there's a recommended way to make a charge that would be larger than her credit limit on a Citi card. Should she pre-fund the purchase? Ask for a credit limit increase? Something else? She'd heard that some issuers don't like it if you pre-fund a large purchase above your credit limit and doesn't trust Citi CSRs to give an accurate answer (although she'll probably try to do an online chat for confirmation). She has an excellent credit rating, but has only had the Citi card for a few months.", "Citi often gives the choice of asking for a credit limit increase which can be done online even from its app. And there may be an increase of even a $1000 or more that Citi would do without doing a hit on the credit report before granting the increase.   I would suggest seeking a credit line increase of this sort first. I have seen Citi do this even for accounts that were less than 4 months old.", "The best way to do is to split the transaction among credit cards, assuming the merchant is willing to do so. This is relatively common with car dealerships accepting credit cards. If the card is issued within 1 year, the chance of the CL increase is extremely slim. Pre-funding the purchase may see as risky (Note - it is not generally identified by humans, but computer system).", "Having lots of recent experience with this with Citi credit card accounts, I disagree completely with the claim that the chance of  a CL increase with Citi is slim. The chance is reasonably high for at least $1000. The OP’s friend should log into the Citi app for the linked credit card and go to card management there to request a CL increase. $1000 increase at a minimum is more likely (than not) to come back as automatically approved for people with a credit score that is in the 700s or higher.  And the increased CL with no hard hit will usually increase the credit score while your suggestion will likely be a negative for the credit score if not paid off before the next filing to the credit reporting agency.", "I don't believe OP's friend is seeking a mere $1000 CL increase. So I stand correct on the issue.", "Quote: No. A CL increase is a CL increase;  the CL increase is more likely than not in this case;  and the automated CL increase is more helpful than not having it at all.  Perhaps the OP’s friend needs more of a CL increase than the likely $1000+ CL increase with no hard pull on the CR, but it doesn’t change the fact that Citi card management (even in the app) allows for a request for an automated CL request fulfillment for the account holder which can then be followed up with an additional CL request after that ... If the initial (and probable)  CL increase is less than the card account holder hoped to get. I have seen this done successfully with over a dozen Citi Rewards+ cards that are less than 6 months old. Without any exception for those accounts for people with credit scores in the 700+ range.  People loved getting 30,000 TYPs SUBs on these no-fee accounts and seeing their credit scores boosted under my advice.", "As GUWonder says Citi will do a soft pull CLI request online every 6 months. If the customer wants more than they offer for the SP, there will be an option to request more with a hard pull. The decision will in either case be based more on DTI/history with Citi than credit score.", "I'll suggest she try asking for a credit limit increase on the website and see if it's enough. I don't know if she cares about a hard pull if the soft pull CLI isn't enough. Earlier, she told me she did an online chat with Citi that basically consisted of her asking if she should send money to the account in advance if she'd otherwise go over the credit limit and was told she didn't have to do that, she'd be fine. She replied by asking if the rep meant what the rep said and was told she wasn't allowed to go over the credit limit.", "The card management feature on the app allows for a CLI request to be submitted without chatting with anyone.  This can be done even within 90 days of the accounts being opened. Go to Services &gt; Credit Management &gt; Request CLI Quote: The customer can initiate a request for and receive a soft pull CLI even within 90 days of Citi credit card account opening. I had this done for multiple Citicard accounts last quarter that were opened last quarter.  If the customer wants more than that rather common (and almost instantaneously approved) $1000+ increase for customers with a 700+ score, the customer can do so by requesting that too, but then that will be a hit on the credit report.", "Interesting info, I didn't know that. I was just going off my experience with a well seasoned account of every 6 months. To be fair I've never tried it at a shorter interval.", "If the card is a MasterCard World or World Elite product Citi should approve a transaction that exceeds the revolving limit, but in practice it is difficult to know the amount they would approve.", "I had it done within 90 days of account opening to offset the hits that were taking place to the credit scores soon after rushing to qualify for the (in-branch application’s 30k TYP) SUBs while also trying to use the interest-free promotion that came with the signing up for the accounts.  Fresh experience from being a peddler of the Rewards+ card is why I knew what to make about the merits of a  claim about CLI requests on very young Citicard accounts. Otherwise, absent correction from an experienced party inside or outside of Citi, I would have probably been under the impression that such young accounts had very little chance for a CLI to happen upon customer request for a CLI (at least for those whose  income and housing costs remained constant during the period between card application time and CLI request times)..", "I would have thought the same since Citi has historically been a fairly conservative lender, (but perhaps that's limited only to the sub-prime customer market).", "Whether a CL increase will be approved depends on many factors.  If OP's card is one of those \"starter\" cards with a $500 CL, an increase of $1,000 is 300% of the CL.  If the current CL is $20L, then $1K is only 5%. An issuer may also grant a temporary increase for a specific purchase.  While that may not be useful in many settings, it can be quite useful for someone who has other major credit-impacting activities on the horizon, such as a real estate closing. If OP has any concerns about whether a CL will be approved, it is worth the time to call in and explore options.  It certainly doesn't help to get a $1K increase if you need $10K, so the call becomes worth the effort.", "50% increase of the CL within 90 days of account opening being done without a hard hit on the CR hasn’t been unusual for some of the no-annual-fee Citicards issued in recent months. It certainly does help plenty to get a $1000 increase in CL  even if needing $10k to spend or whatever.", "2"], "Citi Prestige: Priority Pass Select membership.": ["Click here for full rules!", "I have a couple questions about Citi Priority Pass and families. I have a large family, and we are American expats. This means that we travel between our present home and the US occasionally. The airports we frequent have decent Priority Pass lounges, and this would be a huge value for us. I currently have Priority Pass via CSR, but I would consider signing up me or my wife for the Citi Prestige card to get the family benefit. 1. Is there a limit on family size? The most I've seen used in data points is a spouse and 2 kids. What will Citi say if I have 7 guests (depending on the lounge's free child age limit; we have young children) on a visit? We are a traditional family, two parents with children, all with the same last name. 2. I know that the lounge itself doesn't worry about the charges, but some do limit the amount of guests. I have already tried to take 2 guests into a lounge and was told that I can bring only 1 guest. Do lounges make exceptions for families? Or, isn't a lounge limiting the number of guests generally a problem? Was it just a lounge I happened to try?", "We've never had issues with a lounge caring too much about our family (also two parents+two kids) for PP guest/family rules.  However, as I mention upthread, the limit we tend to encounter is that lounges don't want to displace their J customers, so sometimes they just aren't taking PP guests at all.", "12", "16", "17", "18", "19", "20", "21", "Click here for full rules!", "Whoops -- you're totally correct.  I was looking at the au site.", "Hi guys, I just got the card. When do I receive my Priority Pass card? It's been like 2 years since my last PP card and I always would need a PP card to enter the lounges. Do they send one nowadays or you just enter showing the card, in this case the Prestige. Thank you", "You cannot use the credit card for Priority Pass lounge entry. Once you have the Priority Pass membership card you can register on prioritypass.com and load the Priority Pass credentials into their smartphone application. The app will allow you to enter many, but not all, lounges without presenting the physical card.", "Oh thanks for the tip, very handy!", "So apparently the Amex Priority Pass cards will stop being accepted at non-Lounge locations (ie, restaurants, cafes, etc) from August 1. Who wants to bet if this is coming to Citi as well?  It may explain why they kept the \"Select\" branding long after it served it's original purpose (stopping credit card PP cards from accessing the United Red Carpet Clubs)", "Well I can't for the life of me find the site I saw it on, but apparently it's been confirmed that ALL Priority Pass Select cards will lose access to \"non-lounge\" locations including Cafe and Restaurants as of August 1st. Amex notified their members of this a few months ago, but none of the others including Citi seem to have done so yet. Can't say I'm surprised, but it's a pity...", "This blog article makes the claim in the headline, but the text of the article does not support the headline: Quote: https://dannydealguru.com/2019/07/11...select-access/ This blog apparently also reported, and then retracted: Quote: https://milestomemories.boardingarea...d-memberships/", "I don't think a material change like this would have been left to a third party vendor to relay to the customer. Even though I don't have high expectations of Citi I think they would want to make sure that a change like this doesn't constitute some CARD violation, given that they have collected a big up front fee for their financial product, and now changed the terms.  (in many dimensions, considering the insurance changes too) Don't get me wrong: I do expect the benefit to eventually be adjusted - and would not have any issues/objections to that - but I don't think it would happen with 18 days notice, on a consumer/retail product.   Biz cards maybe. To wit: A few years ago, Chase changed the transfer-ability rules (for spouses) for the Chase Ink Bold over a weekend, with nothing more than email notice. I was lucky and saw it, and moved out 150k+ UR for a redemption we needed to make out of the SO's account. But I'm sure plenty of other people got hosed over that.", "Hi - I will be traveling with the family in a couple of days and based on my understanding my Citi Prestige will let my immediate family (wife/kids) for free as part of my membership but what do I have to state at time of entry?  I called Priority Pass they didn't know they said we can deal with it later.  Then I called Citi they said that benefit is valid. But how at time of entry would they classify my family in the right category so its not additional guests but family.  Thanks!", "The lounge knows nothing about the terms of your individual Priority Pass membership. The lounge will not collect any payment, just record the number of people in your party. To my knowledge we have no reports of Citi actually billing cardholders for guests, but in the event it happens save some sort of documentation (e.g. boarding passes) to show that you were travelling with your family.", "That is an excellent question that hasn't been answered in an official fashion anywhere yet, as far as I can tell.  I've always wondered the same myself. I've gone to a lounge with two family members and a third person (in-law with different last name); I was never charged for the third guest.", "I have found that de facto constraint tends to be whether lounges will allow in a group, especially if they don't look like a conventional 'family' i.e. biological parents + small children. We've never had an issue with being charged, but lots of times when lounges aren't taking PP members and saving space for their own natural patrons.", "Thanks - do I need to mention anything different or just say how many guests - say '3'? That's why i wasn't sure - we are basically two adults and two kids - so technically my Citi Prestige should cover us - i mean it is immediate family", "Whenever I've taken two of my immediate family members, I've signed for \"2 guests\". How do lounges charge for 3 or 4 immediate family members? Do they have a different way for billing immediate family rather than \"3 guests\" if you're with spouse and 2 kids? Quote: I have the same question, I called Citi but they didn't have an answer. I wonder if lounges bill differently for \"immediate family\" (especially for &gt;3 people) vs \"guests\". Does anyone know?", "Consider the possibility that Citi does not actually bill for guests, even though their terms allow them to do so if they detect a pattern of high use.", "11", "15", "16", "17", "18", "19", "20", "22"], "Citi AT&amp;T Access Card (free version)": ["Click here for full rules!", "Yes. But if 3x TYP will not be available, then 2x MR is much better than 1x TYP. Then maybe Plastiq will introduce mobile app with mobile wallet payment option, and we will be able to utilize USB AR.", "I asked Plastiq about Apple Pay support a couple months ago, with USB AR specifically in mind. Their response was that they're interested in offering it, but it's not currently a focus, \"stay tuned.\" I'm not holding my breath.", "Why do you value MR over TYP?  They're about the same now.  You'll still get 1500 points for every 1000 TYP transferred to Hilton, and 800 points for every 1000 TYP's transferred to Jet Blue.", "I value the AmEx transfer partners a bit more (e.g., ANA). Also, going forward AmEx can cash out at 1.5 cents for travel (with Bus Plat) while Citi can only cash out at 1.25 cents for travel (with Prestige).", "Not sure if I am missing something (regarding discontinuation) but I applied for this card yesterday on a public link on Citi's main page and was approved. 10,000 TYP's after spending $1,000 in the first 3 months.", "the one you signed up for is not the \"Access More\" version, this one has different rewards.", "My bad, thanks for clarifying.", "Does the Citi ATTA offer virtual numbers?", "Do you need the AT&amp;T-specific benefits? Because from an earning perspective, the Citi ATTA is now a \"useless\" card IMHO. It only earns 2x TYP in certain categories (and unreliably), while the Double Cash card now (effectively) earns 2x TYP on absolutely everything (so there's no worrying about what will count for 2x and what won't count for 2x). So I don't see the point of bothering with the ATTA card unless perhaps you need one of it's AT&amp;T-specific benefits.", "Basically need to cycle the card and Citi seems to be sensitive with the DC.", "What do you mean by \"cycle the card\" and \"seems to be sensitive with\"?  As to your original question, in case you didn't see it already: Say goodbye to Virtual Account Numbers at Citi", "Charge the card up to the credit limit, pay off, and repeat in the same billing cycle. Some issuers regard this as a credit risk.", "I'd be skeptical that someone can cycle their credit on ATT any more than they can on the DC. They're all running off the same technology backbone.   Even the Citi Retail Card services, although customer interface is different.", "1"], "LOL - OK to sign up for second Citi bank account SUB in a shutdown world?": ["Click here for full rules!", "There have been some locks and terminations for that and less, even though most cases had higher velocity. Has she used a definitive method to confirm not being locked (e.g., air, hotel, rental redemption)? Note that there is no reason to believe that AA is done with lockdowns and terminations.[/QUOTE] Yes, booked and ticketed an award flight two weeks ago, so there was no lockdown on the account; as of two weeks ago anyway.", "This is a joke . . . right? They are still sending emailers for credit cards to accounts they claim are fraudulent. Citi is making retention offers to people whose AA accounts have been shutdown. Citi wouldn't approve someone for 15 AA credit cards in a year if it weren't legit . . . right? And yes, there are reports of exactly that happening. The simple fact that you have to post this question in the first place is pretty good evidence that AA's no-information crusade is going to have a damaging effect on their business. No one has any idea what AA is doing, or what they will do in the future and how they are unilaterally defining what is the appropriate way to participate in the AAdvantage program.   84fiero likes this.", "The main point is that there are people who have gotten many types of sign up bonuses (biz, Plat, credit cards, etc ) over the past year or so (worth potentially up to 260,000 miles in a year)- many of these folks are not locked and continue to get bank account offers that explicitly say multiple bonuses are allowed. Are Citi/AA saying that those who participate in this manner (let\u0092s say MileUp, Executive, Biz, two bank account) are OK while those that got multiple versions of the same card are not? That is what is implied by the lack of locks for those with multiple public card sign ups, but we can\u0092t be sure", "\"[M]any of these folks are not locked . . . yet.\" People are still getting locked.  No one knows how long this will continue or if/when AA will stop tossing the net farther and farther until they rid the program of anyone who has the audacity to get some value from it. Are they going to go back 8-10 years when the soft rule was 1 personal card every 18 months and go after people who got 3 SUBs in 2011? \"That is what is implied by the lack of locks for those with multiple public card sign ups\" . . . but Citi knowingly issuing more than a dozen cards to a person in a year doesn't imply anything?  Citi created mailers with no 'non-transferable' language that bypassed time restrictions on SUBs even though they had mailers that didn't do this and that implies nothing? The fact is that AA and Citi are not providing any guidance and NEVER HAVE as to how many SUBs are reasonable or what triggers a shutdown. The fact that people with NO SUBs have been shutdown implies that AA can and will shut you down for any or no reason. Two months ago, no one would have thought to ask this question. The fact that it is being asked suggests that the only takeaway from all of this is that booking an award flight using AA miles is risky and subject to random cancellation up until you check in for all flights.", "Based on DP's I would say your award flight ( that leg) is safe when you board and not before............Maybe even after they close the cabin door, lol", "Right, the way AA is going about this - and the wording of their termination emails - there truly is no telling how far AA will go in determining what is \"exploitative methods\". Maybe I'm too paranoid, but hard not to be with these shenanigans.  Quote: OK, thanks good to know.  There aren't as many DPs on folks who could be targets but are still unlocked. Quote: This scorched-earth crusade is just ridiculous. What will they start looking at next to use to target people for termination?", "I'd consider the segment \"safe\" when the plane is up in the air.", "True,  from once they close the doors the plane could still have problems and need to turn back to the gate. I guess \"safe\" now means when you arrive at your final destination, lol", "FWIW, Citi changed the eligibility language in its latest bank offer... The Fall 2019 offers indicated that customers had to be new to Citibank, and that customers could only earn 60,000 miles via bank offers every 365 days; Quote: However, the January 2020 offers do not have any language about “new to Citibank” requirements and up the mileage total to 120,000 miles: Quote:", "1", "Click here for full rules!", "LOL - OK to sign up for second Citi bank account SUB in a shutdown world?    I received in my inbox today a Citibank sign up bonus offer on one of my two AA cards (I have a Mileup and a Platinum card and received SUB for both). I already received a targeted Citibank SUB for one of the cards - today I received a targeted Citibank SUB offer for the other. After scrubbing the terms, it looks like multiple bank signup bonuses within 365 or expressively permitted. I would presumably have to open up a second Citibank account to get the SUB... The question is - is it wise to sign up for this offer in today\u0092s environment?", "[QUOTE=Adelphos;31946725 The question is - is it wise to sign up for this offer in today\u0092s environment?[/QUOTE] Should be some time before it expires, so you can wait or go for it.", "I think it depends on your existing SUB behavior and whether or not your account has or will be locked/terminated in the future. If you\u0092ve been good and your account is fine, I don\u0092t see why earning more AA miles is necessarily a bad thing.", "I have not done the \u0093mailer churning\u0094 (which I define as signing up for multiple Citi AA Platinum cards), but you can earn 200,000+ AA miles through normal sign up activity within a year without any of that - I have been watching to see if any those kinds of users have been locked, and no dice so far. But they may be in the future, so I am hesitant", "Within one year, yes, but not year after year, right? Within one year requires getting all the different cards, but then the 48 month clock start on all the Citi cards, and who knows what clock starts on all the Barclay cards. So it's likely you can do anywhere close to that the following year, right? And I don't think there are than many of those types of users, because most users are already in the middle of a 48-month clock on most of those cards. I know I'm there on Gold, Platinum, and business cards, and the last time I churned any of those personal AA Citi cards was during the World -&gt; World Elite era. Meanwhile, I've had a Barclays Aviator card since the merger, though I'm likely to cancel it next week, and I just opened my first Barclay Aviator Biz (my one AA signup recently), so I don't think I qualify soon for either of those.  (If it weren't for the fact that I'm trying to stay below 5/24 for Chase, I guess I could get an AA Executive card, since I've never yet had one, plus a MileUp card, since I've never yet had one, but I think that's about it for the near term.) So while someone who's either stayed away for 4+ years or never chased AA miles before this might be able to do 200,000 in one year, I don't know how many of those people there are, and thus while I don't think that's what AA would concerned about, I don't know if the lack of datapoints proves anything one way or another about that situation.", "Within one year just requires three cards (Mileup, one of Executive or Platinum, and Barclays) plus two bank account bonuses. If you are starting fresh, or even only have one card, you can do that. I\u0092ve been scanning the threads to see if such customers have been locked, but haven\u0092t seen such data points so far. I would guess the vast majority of Citi/AA customers only have one card, so they would also be able to get these SUB", "Wouldn't it be funny if all of the shutdowns have the effect of causing many of the AA customers with only one card to pursue some additional cards to mazimize their sign up bonuses within permissible limits?", "I have had no Citi card SUBs credited to my AA account at any point in the last 5-10 years at least..  I guess I could apply now for as many Citi AA cards as Citi allows me. But I really don\u0092t see the point of it since I have restricted opportunities to use my AA miles for any reasonable return and don\u0092t feel like testing the AA limits since I still want to milk AA LT Platinum status for a long time ahead.  Also given how other card issuers have become fussier and given the alternatives from Citi and other banks, I see even less reason to sign up for a bunch of Citi AA cards for myself. For old people with few to no miles in the AA account and limited future travel plans, milking the Citi AA SUBs may work out better than it does for me.", "For those that don't have AA lifetime status, you could simply fly with another airline. My main focus is on Delta, but I'll take a couple of paid AA flights a year based on schedule, price and product. Maybe my focus in the future will be on AA. In the meantime it is nice to have (company approved) options to earn additional miles via sign up bonuses, credit card spend, banks, etc. I still see value in AA miles on Cathay Pacific, JAL, and economy web specials to Europe from October through April/May.", "One way to stay under the radar of fidgety missile battery operators primed to expect enemies is to remain tiny (with the account balance) and have minimal additional mileage activity signature. This helps to not give AA additional opportunity to fire at and gain from firing at the AA account.    My regular paid AA flights can be credited to non-AA programs just fine for me.  I haven’t completely written off using AA miles, but not all AA accounts are equal and some are worth a little more force protection than other AA accounts.   Adelphos likes this.", "I don't disagree with this. This is why I try to get people to be extremely precise with the data points and such they post on the various other Citi threads", "How many AA SUBs have you had the last 24 months?  If it's less than 2 I would apply.  I'm confident in writing that because i signed up my relative for two citi aa cards using mailers in 24 months and she didn't get locked down.", "Personally, I wouldn't touch a Citi CC SUB right now with a 10 foot pole.  We don't know if or when AA is done with this exercise or how their criteria may morph.  But that's just me - if you're OK with the risk that's up to you.  When you received those SUBs may be a factor.  Just know that whatever language present, or not present, in the offer you received won't be a defense in AA's eyes (and you won't have any opportunity to make a defense in the first place, for that matter).  Quote: There have been some locks and terminations for that and less, even though most cases had higher velocity.  Has she used a definitive method to confirm not being locked (e.g., air, hotel, rental redemption)?    Note that there is no reason to believe that AA is done with lockdowns and terminations.", "This is a bank account SUB, not a credit card SUB", "AA/Citi are sending out fresh bank account offers now - it seems unlikely they would send out targeted e-mails to credit card holders (most of whom signed up for cards recently) only to terminate their accounts", "2"], "Any Citi Prestige Holders Receive (or not Receive) 5 Points Per $ for Expedia, etc.": ["Click here for full rules!", "Looks like Agoda and Booking are posting hotels as hotels and aren't triggering the 5X, but not all the time.  At Citi it says:  Category Lodging - Hotels, Motels, Resorts Lodging I had one Agoda transaction that looks like it coded 5X. It was a really small hotel charge of $12.77.   Other Travel - Travel Agency And Tour Operators -- I just booked another Agoda hotel, its pending but says: Category - Travel Agency And Tour Operators   I can followup if it changes to a \"Hotel\" category.    Any idea how to get Agoda and friends to trigger as travel agency not as hotel?  I think my other bookings were done with the App while the one I just did I used my computer to book.  I don't remember which of the bookings I did with the app vs on my computer but usually the App price is a few percent less so I go with that.  I try to book using TopCashBack on the computer for the 6% back but would rather take the cheaper price if its close. but the app usually has some promo code that drops the price lower than I can get on the website.  If booking on the computer gets me another 2X TYP's, could change that calculus.  Also seems like booking online (computer) gets me 2% Agoda points as well.  2% Agoda + 6% TCB + 2X extra TYP = 11%.    Any other data points?", "1"], "AA account restricted - Data Points only": ["Click here for full rules!", "But if it does ticket, and you didn't actually need it, then aren't you out the cancellation fee? Or are you allowed to cancel an award booking fee-free within 24 hours of actual ticketing (no matter when that is relative to your actual booking time)? Because if you have to pay a cancellation fee, that sounds like an expensive way to test whether you're not locked. Plus, if you do this multiple times, because you're trying to see if you're locked now even though you weren't locked before, might you get locked just for having made and cancelled way too many award reservations in a short time?", "I think the point is that you can waste the miles in exchange for running this experiment.   If you have a million miles, then risking 12.5K miles to try this might be worth it to some people, for example.", "Since I doubt this thread will ever be about DP's I may as well add on.................there are many 5K saver awards a person can book to do a test, you can travel today ( 1/14 ) Minneapolis (MSP) to Key West (EYW) for 5k miles one way.........one stop and nice flight times also. Why these are so cheap I have no idea. If a person doesn't have any flights planned I have no idea why they would waste miles ( and possibly draw attention) to their account.   Happy likes this.", "In this case one could actually take the \"free\" trip to Key West and escape from cold snowy weather, even if only for a few hours.   Global321 likes this.", "Read the wiki in this thread. There is a cheaper way (1000 miles). .", "5k Miles or $599..............talk about $$ value per mile, lol", "1", "2", "3", "4", "Click here for full rules!", "Deleted...", "That is correct - the 3 award trips (across AA, AS, JAL, EY metal) were ticketed before Dec 2019, and travel was completed by Jan 5th.   flyer4512 and zmicer88 like this.", "Quote: I would be willing to forfeit the CC SUB miles from last year as a recourse to keeping the account active - if only there was a way to reach out to AA security to resolve this one way or the other. I have upcoming (paid) travel on AA which i need to decide if i should accrue to AA FF program, or switch to another alliance partner (AS or BA) if the end result is ONLY a complete shutdown and ban from AA program.", "I gave someone some of my mailers that came to my household. I believe 1 emailer and 1 or 2 physical mailers and they used to get their own cards. This person also has gotten a few AA cards on their own as well. Anyways, this person is not locked. I know there is some speculation to the maximum amount/threshold of cards/bonuses AA is allowing, and I'll work on getting this data regarding their specifics re: amount of cards in total. But at a minimum I thought it was encouraging that this person is not locked.", "Pure speculation... maybe Helix score plays into this as well... 3 mailers - generic or otherwise - with Helix &gt; x - no lock/cancel, 4 mailers - generic or otherwise - with Helix + Y &gt; x - no lock/cancel. Less than x, lock/cancel.", "Locked Quote: Prior to being locked I had one domestic award for a flight today on AA metal that was ticketed.  I was able to obtain a boarding pass today but I will not be flying due to personal reasons.i have also had an international flight out of LAX booked for quite some time on a partner airline trans pacific booked as an award listed as ticketed.  Around 12/10 I saw that one direction opened in a better class and called in to change that award.  Change made via phone and the process was that the miles would be returned to my account and then the new quantity of miles deducted.  Miles were returned but never taken back out. Trip still shows ticketed.  Contacted partner airline and they said as of now ticket is fine and they provide ticket numbers, record locator and seat assignments.  Again, miles for this trip have not been taken back out of. Y account.i had another transpacific flight on a different partner on request.  When it still showed pending I called AA around 12/12 and was told the account was locked.Seems like although locked I could fly my domestic award trip today without an issue.  I\u0092m in the same boat as others regarding my trip in a few months.  Still ticketed and as per the partner still valid.  Business class for 2 which would be about $5k each to purchase.  Will wait a couple of months to see what happens.  I really don\u0092t have another airline that I can book for that trip.", "You said a better class is available so you called to upgrade the existing booking. What the partner sees now is the old class or the upgraded class?Did you have a NEW eticket emailed to you? When the partner confirmed your booking, what ticket number the partner sees at their end? The original ticket number or a different ticket number? This is very important to find out. PNR only means you have a reservation, it is the Valid ticket that you need to be able to travel on. If the partner has a new ticket number, and the class of service is upgraded, then a new ticket is reissued but the process of deducting the miles was derailed by the status of account being locked. I honestly dont know how a new ticket can be reissued without taking the miles out of the account - but that could happen, and you now being \"lucky\" to have a new ticket issued without paying the miles for it! Quote: Yes, the domestic trip seems valid to fly on given the fact you can print BP, as previous DPs on trips being canceled close to departure, people saw their BPs disappeared from the apps on their phones. Regarding the \"$5K\" each ticket - it boils down to whether you must go on that trip or not, to determine whether you want to protect the trip. I would just forget about the perceived value of the booking - plenty folks I know have lost a lot more value of their award trips. Life goes on.", "What is the Helix score.  NM. Found it.", "It’s a system of ranking the value of each customer. A business flyer who pays cash for tickets is a high-value Helix, while an awards-only churner isn’t nearly as valuable", "Yes I was in business one way and economy the other. I was able to call in to change the reservation to business both ways. I never looked for the actual ticket numbers when I made the original reservation. After I made the change and I found out a couple of days later I was locked I contacted the partner. They have my new reservation thus far confirmed in the new class of service with ticket numbers, etc. I must have been locked the next day as the miles for this award which were put back in my account t have never been taken back out at the new award level. We have to take this trip and I’m willing to pay the $$ but thus far want to wait to see what happens. Still a number of months away.", "The original ticket number is in the original e-ticket email you received.  Sure you still have that email from when the award was ticketed?  There you should see the eTicket number, and hopefully it is different from what the partner can tell you now. Hopefully it would not take another 2 - 3 months before the dust all settles.  If you are willing to travel in Y, the fares are not that expensive whether it is to Europe or to Asia.", "She just dialed AAdvantage from her phone and got the normal phone tree.  So probably not locked, though it's not the strongest evidence.", "What does \"good\" information mean to you?  My request to join the private forum was rejected weeks ago (lol) but the rumors I've heard from there are nothing but doom &amp; gloom.", "Try making a cheap domestic award booking on AA metal - if it doesn't ticket and stays in PENDING status for more than 24 hours, pretty sure that's a sign your account is locked (domestic award tickets for AA metal should ticket within 1-2 hours max).", "1", "2", "3", "5", "Click here for full rules!", "Not one.  Closures with as few as 4 SUB in a 24 month period, no unlocks.", "Are there indications as to when AA proceeds to move the \u0093locked\u0094 accounts to \u0093terminated\u0094?     Based on earlier  DPs, it always seems to occur right before a trip.   Or in the middle of a round trip.   LWT3 likes this.", "How many people can even read/post in that thread ?  They banned a lot of people and prevented others from joining or they might have more DP's. You better hope they don't figure out who you are or the REDITT GODS ( who read FT) will also ban you for reposting, lol   cheaptom likes this.", "All over the place; the rollout of closures was pretty shambolic.  However MY sense (not everyone would agree with me) is that CorpSec has begun to prioritize close in bookings and definitely to prioritize anything that people do that put eyes on an account.", "At this stage most information is coming in from other private channels; definitely the case since we had more or less determinate proof of AA employees in the private Reddit sub.", "There doesnt seem to by any rhyme or reason from AA here. I had 3 award bookings (international - combination of AA metal and partners) between Dec 15 and Jan 5. My account is locked up for sure - but i can still login and see my miles. Just cant redeem any - tried to make an award reservation and its been on hold for 2 days now. Fortunately, AA did not cancel my account or my existing award flights during this period -- which per popular consensus should have happened (or maybe not, who knows really). We used mailers sent to the family only, no barter/selling, bookings for family only.  the real question is - what is the next step here? Do we expect AA corp sec to contact us regarding a recourse? I would like to keep my accounts with the possibility of forfeiting some of the miles if necessary - i would prefer to continue using AA for flying and collecting miles.  I am hoping the end result of this is not a complete ban from AA program with no recourse.   flyer4512 likes this.", "In the absence of any DPs to the contrary, I'd proceed believing that all locks will lead to complete account shutdowns, eventually.  There's not a single piece of evidence of any flexibility on AA's part.   akr1970akr likes this.", "Totally agree. AA has been the only FT thread of interest to me, as Chase apps are 24 months away at best, B/A Barclays USB are all off limits due to MAC, and I've had every AMEX card that interests me. Basically finding that coming here to find only concerns and unfounded opinions is now a waste of time. In a day or two I'll be closing my FT account, so if anyone wants to PM me, this is your last chance. Otherwise, Good Luck to everyone. It was lots of fun while it lasted, but now it's time for me to move on.", "Hey (XYZ)^3 we really are gonna miss you on FT.", "I found out I was locked when an award reservation stayed pending and I called in about 12/12.  About 1 week prior I made an award reservation (domestic) using a web special economy award (10k roundtrip).  My account is locked but I can see my reservations.  My trip is for tomorrow and I can get my boarding pass.  I don't plan on traveling due to a personal issue but I am guessing I would be allowed to board.   flyer4512 likes this.", "That is a nice DP, just to be clear you were able to fly 3 award trips that you already had booked prior to being locked with the most recent award flight being this ( Sunday) week ? Thanks", "I am confused - you said your account is locked since 12/12, but yet you are able to ticket an award about a week ago. - that seems to me the account is unlocked? given you actually received an eTicket and able to print a BP? You have to have a ticket before you can check in and print a BP...  I also assume you see 10K miles deducted from your account?    If you have an eTicket, 10K is deducted from your account for that ticket,  to me it sounds like your account is unlocked ...", "I believe the \u0093one week prior\u0094 refers to \u0093one week prior\u0094 to 12/12.   flyer4512 likes this.", "I would think that some terminated people have written to AA Security or Customer Service to state their case and ask/demand their miles back. I imagine some are indignant about \"how dare you do this to me, \" while others will play innocent. I don't think anyone at AA will care in those cases.", "No indications. People who have never used the miles they\u0092ve earned have been shut down.", "1", "2", "4", "5", "Click here for full rules!", "Any pending trips?", "Nope, typically go FC TATL each Summer. Since only Anytime awards have been available the last several years, we didn't make res for next Summer yet. Had I known, I would have, but hindsight is 20/20 of course.", "DP on pre booked award ticket: Booked international economy ticket on AA + EY to Inida somewhere in August - way before lock down process. I learned my account is locked about 2 weeks ago I was able to travel on Jan 5th and finished the journey without any issue.   mia, sdsearch, flyer4512 and 4 others like this.", "Thank you for the DP. How did you find out about your account being locked? Was your flights round trip or one way? Did you have any connections?", "I am locked (stage 1). Household has been churning AA cards since 2015. P1 used lots of mailers (addressed to real revenue pax), the W/WE loophole before that, and same-day app-o-ramas back when that was a thing. Also did a fair amount of TATL F corporate travel on that account, enough to earn Plat every so often. My spouse has different last name, frequently flies with me (revenue &amp; not), but only does SUB in exceptional cases like the Amex 100k and CSR intro. Has never held a Citi card (except as AU), let alone churned multiples. Was a prime source of mailers, however. P1 has earned 62 total SUBs since mid-2015. Looking at AA mile earning only: 2019: 5x Citi Plat, CitiBiz Plat 2018: 6x Citi Plat, Aviator Biz 2017: 6x Citi Plat, Aviator 2016: 2x Citi Plat 2015: Citi Plat, Citi Exec Above does not count dozens of X0,000 credits that AA agents would see coming from Citi due to courtesy matches, retention offers, and other 1-offs. Based on internet chatter I'd always suspected we would be among the first locked, but didn't actually test the theory until Dec 28. Booked two TATL J reservations with miles to visit P2's family on overlapping weeks. As of today, neither one had ticketed (despite being simple 1-segment flights on AA metal), so I called in. After waiting a very long time for different ticket agents to confer, they were able to confirm the account was locked for a fraud investigation, and let me cancel w/o penalty. Guess we'll be flying economy. (at least outbound; once I suspected what was going on, I booked our return flights with UA miles, in J) Imperfect DPs on award tix booked prior to lock:We sent my brother &amp; his wife to Japan, then onward to India, all on JAL J using 200K miles from P1's account. Booked Aug 4, flown Dec 7 and Dec 12, 2019. Based on other DPs I suspect the AAdvantage account was already frozen at this time, but I don't have any way to know for certain. Spouse and I are supposed to return from LatAm in mid-Feb 2020 on AA J metal. Booked Jul 3 using 50K miles from P1, still says \"ticketed\" on AAdvantage account (vs \"ticket pending\" for the troublesome LHR bookings mentioned above), but from the sound of it we won't know if we're actually getting on that plane until day-of  Have burned ~1.2M miles since 2016. About 820K more at risk if the fraud investigators don't like what they see, but I'm more worried getting murdered in Mexico.....by P2. If I survive, I'll update. I don't know if any other household members (such as mailer addressees) have been locked. Nor have I asked any of the non-HH family whom we've flown around the world using \"tainted\" miles. I doubt any has more than mid-5 digit balances at risk, though getting banned for life would make them reconsider accepting my offers to \"help\" on other airfare deals... Edit: we have never used an email code, nor bought/sold/bartered AA awards", "DPs from other threads: Quote: https://www.flyertalk.com/forum/31919948-post813.html Quote: https://www.flyertalk.com/forum/31913420-post1409.html Quote: https://www.flyertalk.com/forum/31912404-post1397.html sdsearch likes this.", "So is P2's account locked or not?", "I'm sure AA is monitoring this thread in some fashion so I would caution folks from divulging too much info if you're not (yet) locked or shut down   GUWonder likes this.", "Should not be a concern. Every shred of data that AA considers relevant is already in an AA database.  Nothing you can provide here is more detailed unless it is something which is of no concern to AA, in which case it is irrelevant. A lot different than confessing to selling miles tickets on Craig;s List.   Global321 likes this.", "Quote: Please let's keep this thread for actual DPs. Comments of concern and/or opinions are very welcome on the original thread. Thank you....   flyer4512, 84fiero, mhdena and 1 others like this.", "Report of a successful international trip a few days ago https://www.flyertalk.com/forum/31926193-post1485.html", "Oddly enough, you're wrong since we have an AA mole in the private forum who reacted to a DP just yesterday.   84fiero likes this.", "I didn\u0092t even know that FT had private forums!  Are you getting any useful DPs from it?", "Not FT, Reddit. Yes, lots of good information that will come out eventually.  Unfortunately, and pathetically, AA staff have infiltrated the Reddit private forum so information on our response will end up being even more locked down in the future.   84fiero likes this.", "Have you seen any reddit datapoints where a locked account was reopened?", "1", "3", "4", "5", "Click here for full rules!", "AA account restricted - Data Points only    There is another thread on this topic but it doesn't have any data point or hardly has DP, let's keep this thread only for data point. Please post your DP if your account is locked so that will help others if they are on radar or not.  How many cards did you apply in 2018/2019? How much AA points did you burn with economy/business/first class and within USA or Outside USA? Do you have any upcoming award ticket? When? When/how did you learn about your account lock? Anything else you can think of as DP. Please do not discuss anything other than DP.   sdsearch, LWT3 and cheapblackdad like this.", "DW and I have gotten AA cards with SUBS @ every 40 days or so for almost 2 years. Lots of various types of churning for the 8 years before that with Citi and Barclays. Both accounts are locked, but all miles from spending and SUBs are still posting. New Emailers are still being sent to the same email accounts we used for our last 2 apps. Have used FC TATL awards yearly for years, with Saver way back when, and then Anytime, including last Summer.", "I had an AA J domestic flight last week, that I booked in June using miles.  A few days before my flight, I discovered I was locked.  I called AA and they said they see no issues with my flights.  I was able to get my boarding passes at T-24 and boarded both flights without a problem. I so many posts about AA cancelling flights of locked people, but that was not the case for me.    I still am locked, but my flights went smoothly.", "Looks like I'm shut down.  Canceled my August booked Dec PHL-HKG flight to get a web saver for 37000.  Showed at the airport and the ticket wasn't valid, they told me my credit card wasn't accepted for fraud.  Tried to reinstate the original FF ticket.  Found a flight only to be told my account was totally locked and would have to call on Monday.  I earned Plat last year, so I fly a lot for biz.  I suspect the \"fraud\" isn't because of my card (which has never been flagged, and it was for $5.80), but I got the shutdown.  Should have just taken taken the previous flight, but I poked the bear.  Sad days.", "Just to clarify, when you say \"totally locked\", does it mean that you couldn't log into your AA account online?  Did you receive any (e)mail regarding the shutdown?  Thanks.", "I realize the situation is still fluid, but perhaps someone could propose standard terminology to use for the various AAdvantage account states?   Often1 likes this.", "I would propose this:  \"Locked Account\" means you can still log into your account, view your miles and upcoming trips, etc., but you may not use your miles to purchase anything.  Also, when you call in, the auto-bot does not recognize your number.   You're essentially \"locked out\" of using your miles, but you still have access to your account.  AA CSRs themselves refer to this as \"a flagged account,\" but I think locked is better because we're locked out of using our miles. \"Terminated Account\" means you can no longer log in or view anything.   You may have received an email explaining this termination, and (from what we've seen) your miles may be gone.   cheapblackdad likes this.", "I believe this is the terminology they are using on reditt 1st stage of locked - can still log in and see miles / reservation but cannot make any new redemption or change existing reservation. 2nd stage of locked - unable to log in, in the dark, but no email either. shut down - received email. Account is terminated and miles zero. Global321 likes this.", "So is using miles the only thing that is locked out? For example, you can still request upgrades and (if upgraded) have 500-mile upgrades pulled out of your account (if you're Gold or Plat), because they're not the same thing as using miles? You can still change seats on an existing miles reservation because that isn't the same thing as using miles? You can still earn miles for paid flights because that isn't using miles?  You can still earn 500-mile upgrades (if you're Gold or Plat) from EQMs because that isn't using RDM miles?", "did you use mailers?", "Yes, @ every 40 days for @ 18 months. Then when the mailers stopped, waited a couple of months, then opened new accounts for 'family members of same last name', and then applied with emailers again @40 days apart. Last SUB posted mid Dec along with miles from spend. We can still log in, but not use miles.   cheapblackdad likes this.", "No idea about using 500 milers for upgrade but the rest of earning miles activities, are posted normally - ironically even incl new sign up bonus from the emailer derived cards based on the data points up to this moment. The data points are even posted on the other thread in this forum that is cluttered by repetitive debates.  However my guess is, any usage of \"instrument\" would not be allowed once the account is locked.  500 miler is consider an \"instrument\" just like SWUs.  From previous history  SWUs are not working once account is locked.  Hence the 500 milers may very well not working with a locked account. Though I suspect those earning activities are already in place previously, i.e. flights booked before account locked, spend already made on credit cards, etc. Else I could not think of anyone whose accounts being locked would still go on to earn AA miles on new activities. What is the point to earn AA miles when people dont know whether their AA accounts would survive? Believe seat change on existing award flights is still working. Whether such flights still exist by the time the passenger of locked account will fly on, is anybody's guess.", "could you provide some perspective into mailer use, frequency of SUBs, and perhaps if you were churning across multiple AA accounts in a single HH?", "My account is locked.  I received 7 SUB in 23 months using mailers.   JonNYC, sdsearch, Adelphos and 1 others like this.", "Nothing new to add here, except a request for anyone who posts to be as detailed and specific as possible.  For example, if you were denied boarding on a pre-booked Aaward flight, please let us know things like when you booked, what airline (AA metal or a partner), destination/itinerary, when you first discovered you were locked out, etc.", "2", "3", "4", "5"], "ThankYou Point Airline Transfer Error": ["Click here for full rules!", "Same issue for me. Sent Amex MR instead, posted instantly. Both Citi and Amex show my name as: first name last name. Asia Miles shows as: last name first name middle name. Via chat Asia Miles won't drop the middle name unless I can produce a travel document that doesn't have my middle name. Maybe I'll send a library card. For fun, I tried registering an Asia Miles account with my first name in surname field and last name in given name field, so it would show in the right order. Citi transfer failed also. By the time I created a 3rd Asia Miles account with names in the right field but no middle name I got issues with their phone account verification and gave up on Citi, since by then Amex went through.", "I am also not able to transfer to asia miles from TYP either online or on the phone. They told me to call AM. AM said there was nothing wrong. Want to downgrade my prestige...", "Just a quick update - was still unable to transfer to AM this morning but the error message changed. Called citi and they manually transferred. TYP deducted and AM transaction showed up in about 2 hours. All good, just a little laborious.", "Looks to be working again. Just transferred points to Asia Miles, and confirmed on the AM side.", "Working again for me on 1/12. 85k instantly posted.", "1", "2", "Click here for full rules!", "Has anyone had issues transferring TYP to flying blue? Everything I've read on the blogs suggests its instantaneous, but an hour later and my points haven't posted to my flying blue account yet....Not sure if this is relevant, but its my first time ever transferring TYP to flying blue", "Have you earned any FB miles from actual flying? If not, this has been a problem for others where AF blocks the transfer or the award booking. See this post and the assorted threads linked in it. They are more about booking an award post-transfer but if you haven\u0092t earned any miles from flying, this could potentially be a problem for you as well.  https://www.flyertalk.com/forum/31292507-post3.html Air France/FB says my 317,000+ MR transfer is FRAUD! Help!", "I had the error message transferring last night, but it went thru fine this morning. and my points were posted immediately. My account isn't new though. I contemplated about transferring 150K TY points to book 3 tickets for myself and family after reading recent stories of FB cancelling award tickets. But In the end I decided to take the risk. I ran into issues and payment wouldn't go through, and then I got the message saying \"your reservation cannot be ticketed in this country\"!! Feeling defeated, I decided to call FB and 20 minutes later, my flights were booked and now I have 3 one-way tickets from Tahiti to LAX in business class!", "Yup, I actually just made FB gold after my last Europe trip =) The miles eventually showed up ~20 hours later, and I was able to book and ticket...not sure why it took so long, but a good lesson for me to just be patient!", "Amazing! I've been eyeing LAX - PPT for awhile now but could never find availability for a reasonable amount of points. Happy my points eventually went through and posted too =)", "The 25% FlyingBlue transfer bonus from TYP ends today: 7/20/19. I know, last minute but was going to transfer some however encountered the following message 7/20/19 2300hr EST: ThankYou Rewards Maintenance We're sorry, the ThankYou Rewards website is temporarily unavailable while we perform maintenance. Please check back later today to register or redeem your points.. Totally my fault for waiting till the last minute but really Citi TYP?! (I just laughed - and said of course...)", "thank you points transfer to Asia miles error    Data point: tried for 3 days to transfer CTYP to  Asia miles; kept  getting \"When we tried to complete your Points transfer, we encountered a system error. Please try again or contact customer service\" error. The names and the phone numbers of the accounts match. I've tried 3 different browsers.  I called customer service; they tried and got the same error.  So, they have elevated my request to have the transfer done manually but it will take 3-5 business days.", "Sometimes there can be glitches in the ways middle names interact with first names.  I've had issues with Chase transfers due to that, with another program.   Basically one party sees FIRST MIDDLE LAST as the name, the other one somewhere in their system sees FIRSTMIDDLE LAST, mashing up the first two into one token. And that can blow up the xfers.", "I am seeing this error with AsiaMiles transfer \"When we tried to complete your Points Transfer, we encountered a system error. Please try again or contact Customer Service for help\" This is the first time I am seeing this error and I've successfully completed multiple transfers in the last 2 years.  I spoke to an agent and he said they've been having this problem in the past 2 days with only AsiaMiles program.  He suggested to try again tomorrow and also to contact AsiaMiles to see if there is they can do.", "Transfer points    Have anyone have this problem before  There appears to be a problem with the information you\u0092ve provided. Please confirm that the information entered is correct and try again. I know I copy everything correctly.", "Had Citi ended up manually transferring the miles for you?  I have issues on transferring to Asia Miles since Sept 11 and every time when I called, CS only told me it is a known issue and the technical people are working on it.", "Had this issue back in Oct / Nov when attempting to transfer TY to Flying Blue. I spent an hour on the phone with a rep, who claimed they would escalate and I would get call me back. They never did. Now I'm having the exact same problem trying to do a transfer to Asia Miles. Update: It's definitely an account-wide issue. I proved it to the agent by asking them to try transferring 1,000 points to a different partner - which resulted in the same error message. They initiated a case with IT.", "Was trying to transfer to AM this morning and failed multiple times online or by phone. Agent mentioned a few days ago same thing happened to a TY-AM transfer. Appears to be Citi IT issue.", "Same here. The initial error message had mentioned about my Asia Miles membership ID not matching. On the second try (with the same ID), the error message had displayed a system issue. Hope for resolution soon.", "Exactly the same. Called them and the agent had no clue what was going on. Might try again today or tomorrow but given Citi's IT...not hopeful.", "1", "3"], "Reasons to keep Citi Premier?": ["Click here for full rules!", "I have Citi Premier and Citi ATT Access more right now. I also have Ink+, CSR, Freedom, Freedom unlimited cards for Chase UR system. But I find Chase UR system earn points much quicker than Citi TYP system. Of course, it involves MS. I'm hesitating to keep Citi Premier. Probably I'll transfer all TYP to certain partner and then downgrade Citi Premier to Reward+.", "Citi Premier + Double Cash is a pretty good combo for $95 total fee. 3x earning on travel (which includes Lyft/Uber, which is for many the biggest travel expense), 2x on dining and entertainment, 2x on everything else with Double Cash, access to Mastercard, etc. Transfer bonuses are helpful too.   lsquare likes this.", "I don't understand the appeal of Citi ATT Access. What makes it a keeper?", "I'm leaning on that combination as well. Whatever doesnt belong on the Premier should go for the Double Cash. However, I'm wondering if at some point I should add a Prestige to the combination if I have significant amount of airfare and dining expenses? Sucks that Citi took out the travel insurance.", "Quote: Access More was a different product than Access, but it is no longer available, and Citi seems to be dismantling the primary attraction which was 3 points per dollar for online purchases, plus an annual bonus. Citi AT&amp;T Access More card (Discontinued) lsquare likes this.", "Any possibility to product convert to the Access More?", "I would add Citi Rewards+ to the mix. For those $3 and under purchases, it's not bad and has no annual fee.", "Which one would you apply for first? Citi Double Cash or Citi Rewards+?", "No, not for quite some time now.", "I would say that if you have a Citi personal card you want to product convert, on which you can drain the points (if any) first, Double Cash would be the one to convert to, because it never seems to have a signup bonus. (But since it's not a true TYP-earning card, just a card which lets you convert cashback to TYP, if you convert from another TYP card, your points from that card will expire, if you have any left.) On the other hand, you can get a signup bonus for Citi Rewards+.(currently googling it I see 15k for $1k spend), so that one you definitely should apply for directly. So, having said that, if you don't currently have any Citi card you want to product convert, but there's another card you want to apply for which you don't see the sense of keeping for more than year, you could apply for Citi Rewards+ approximately now, apply for that other Citi card approximately now, and then after you've had that other Citi card for a year you can product convert it to DoubleCash.   lsquare likes this.", "Citi Rewards+ has bigger TYP SUBs for those who apply at Citibank branches in person than those who apply online.  I went into a Citibank branch a few months ago and got it with a 30K SUB for $1500 within 90 days.   sdsearch and lsquare like this.", "1", "2", "3", "Click here for full rules!", "I do not have a DoubleCash card. At the time I wrote the quoted post DoubleCash earn only cash. There was no option to convert to ThankYou points. This has changed. I already have a card which earns two Membership Rewards points on all spending. DoubleCash still offers no incremental advantage. In particular, DoubleCash adds a 3% foreign transaction fee. Therefore, I still continue to use Premier for performance tickets purchased outside the USA. GTITAN likes this.", "How can you say they are worth a minimum of 2cpp when I can pull up 100 examples without trying well below that.  Don\u0092t get me wrong, Hyatt points are great and its relatively easy to get very good value out of them, but most any point currency has outsized value redemptions.  At the end of the day there are two sides to the points game \u0097 what the points are worth for the redemptions you want and the spend required to earn those points.   lsquare likes this.", "Because it's easy to get Hyatt redemption values over 2 cpp. It's not \"kool aid\" like the person I replied to said.", "There are plenty of Cat 6 resorts that are 25,000 Hyatt points or $250 - $300/night. Just as there are plenty of $200, $300, $400 rooms available for 10,000 or 15,000 points. You need to decide what you actually plan on using the points for, not what is just out there. I agree that Hyatt points are very valuable, I just disagree with your assertion that they are worth “minimum 2cpp” because there are easily obtainable 2cpp redemptions. There are easily obtainable $0.10/pt airline point redemptions available but no one claims those points are worth $0.10 each. At the end of the day, you need to look at the earn side and the burn side. What should matter most to people is return against spend, not what they are able to redeem their points for.   notquiteaff likes this.", "Well, maybe for you this doesn't matter, but if it's Membership Rewards it's obviously an Amex, but I have a number of online / mail periodic expenses (some once a year, some up to 6 times a year) that don't accept Amex, only Visa and MC (and in some cases also Discover), so I would think in those cases (if no other Visa/MC/Disc card has a better-enough category bonus for those) that DoubleCash would have the major advantage that it's an MC, and thus accepted at all those places that accept MC but not Amex. For those who only want to earn transferable points if possible (and are OK with transferring to mostly foreign airlines), it's Chase (personal or Ink) Unlimited (at only 1.5%) which was the previously obvious solution, which DC earning TYP just trumped.", "The big advantage of the DC over the BBP is that, when paired with a Citi Premier your Double Cash is earning 2 TYP which can be redeemed for $0.0125 through Citi’s portal. If you’re primarily flying domestic economy that’s not an awful redemption option especially considering that you’ll have vastly better optionality. This costs you $95 in annual fees. To get similar with AMEX you need to be spending $295 annual fee with the BGR and you’re stuck with a single airline choice.   lsquare likes this.", "What about flying long hauls? What are the prices like on Citi\u0092s portal?", "My somewhat limited experience with the Citi portal is that it prices flights identically to booking directly on airline websites.   lsquare likes this.", "I forgot to asked earlier, but with Biz Platinum, one can select any airline right?", "No.  For economy it is always a selected airline.  For business or first class it can be any airline.   lsquare likes this.", "Chase Hyatt is not better for earning points for overall  credit card spend, however the  overall value of the WOH Visa card is better than Sapphire Reserve or Preferred if Hyatt redemptions are the goal.  Free nights and status (base Discoverist with the opportunity to spend to obtain higher status) tip the scale in the favor of the WOH card. If one wants to focus on Hyatt, the WOH credit card is the way to go.  For earning points for spend on Hyatt stays only, the 4 points per dollar spent on the WOH Visa is better than either Sapphire.  For those who don't have status, additional points are given as a bonus for status.", "I see a post of mine from several months ago has been quoted recently. My position hasn't changed. It is blogger Kool Aid, when it comes to Chase Ultimate Rewards. If you don't think it is  blogger Kool Aid, please reference the blogger which can justify Chase UR points &gt; 2 cpp where there is at least one UR transfer partner, or WOH points, which the blogger rates  as &gt; 2 cpp. Sure, it is true that Hyatt redemptions can be found over $.02 USD per point. The same can be said for many other point redemptions.  Citi Thank You and Amex MR both have point redemptions where one  could justify that individual redemptions are north of $.02 USD.   Since this thread about the Citi Premier, I don't want to waste much more time here on other issuers, unless it is related to the Citi Premier card   mhdena likes this.", "You can get 2 additional cards: Rewards+, and get 10% points back, up to 10k. This no AF card will offset your AF on Premier. Also add Citi Double cash, which gives 2x on everything. And use premier for gas and travel.", "TK redemptions are always north of 3 cpp.", "Why this card works for me: - 3x on gas is exceptional for an annual fee sub $100 - 3x on travel if AMEX isn't taken (some international small hotels if I book outside something like Hotels.com) - 2x on dining isn't awful for when AMEX isn't taken - I often find cheap Turkish Business paid fares which nets me a lot of TK points, so TYP to TK transfer is very valuable to top off for award redemptions - 1.25 cents per point is a niche use for me (used once on an international economy ticket where I couldn't book using miles), but certainly does not hurt - I loved Chase for a while, but I have left the UR program totally since the AMEX + Citi strategy works for me and it consolidates annual fees - I largely only transfer points (UR, TYP, MR) for premium flight awards, so it doesn't matter to me that Citi isn't a helpful player for hotel transfers. If I occasionally need, I can move from MR to Marriott or Hilton for a small, specialized top-up.   sdsearch, GTITAN and lsquare like this.", "1", "2", "4"], "Citi to reinstate cancelled protection benefits?": ["Click here for full rules!", "you can now earn 2% non-bonus category TYP with DC", "That\u0092s ... not much of a replacement for the lost travel insurance, etc.", "I guess it can still count as “new benefits” :-) I usually have about $200k of non-bonus spend per year so the extra 0.5% compare to Chase Freedom Unlimited adds up to quite significant too. The extra 100k miles is almost a RT biz class ticket to Asia already. So I guess it depends on the individual situation too.", "Has there been any other news about whether these benefits are coming back?  Wondering about the rental car insurance in particular.", "1", "2"], "Benefits of a Citigold account? [consolidated]": ["Click here for full rules!", "I was successfully reimbursed for both Amazon Prime and Costco Executive membership. I think I may try ordering Costco cash cards online and see if it will count as well. The only thing I don't understand is why the hell Amazon is charging tax for Prime, while Costco is charging nothing on their membership?", "Sounds as if that's what was negotiated in some states based on the services bundled in the membership. Quote: Amazon  Amazon", "Costco is really a membership. But Amazon Prime is not. At the minimum, Amazon Prime can be considered as a video subscription service like Netflix (Netflix is taxed).", "Netflix is not taxed in CA, since it's a service.", "Nexflix is not limited to streaming, but DVD as well...", "I received a renewal. Still $350.", "I'm shocked and amazed that something isn't taxed in California.", "Yes, sounds surprising, but groceries and services are not taxed Quote: But you're not buying DVDs, you're renting them. Not taxed.", "If you sign up for a new CitiGold account, how long do they give you to bring your combined balances up to $200,000?", "They give you 4 months.   Sandeep1 likes this.", "True to form, HSBC (USA) has notified us that effective late January 2020 the interest rate on our saving will be 0.15% (less, if we reduce the balance).", "4 months is pretty generous.  Was expecting 2.", "7", "47", "51", "52", "53", "54", "55", "56"], "Citi AA cards: TARGETED offers (includes Mailers, eMailers and Matching)": ["Click here for full rules!", "The ham-fisted way that AA has handled this, including not allowing anyone the chance for a rebuttal or anything (as they've apparently often, though not always, done with other account investigations) is a negative for me even if I'm not directly impacted.  Not that dynamic award pricing, other AAdvantage changes the past few years, and other issues haven't already diminished AA miles' value and utility for me - this is just another brick in the wall.   strickerj likes this.", "Also in strong agreement here. I am canning AA and will no longer be flying them, for a variety of reasons. The question is now, UA or DL.   84fiero likes this.", "AA is winning the PR war:  https://www.flyertalk.com/forum/31860015-post428.html hurnik likes this.", "Since this last wave of closures has anyone (who hasnt been closed down) attempted to book an award flight, even a short/cheap one, just to see if it will go through or get cancelled? Thank you.", "Is there a forum or even a way to churn DL CC's?", "Yes and No, IMO. If you get a targetted offer (DoC routinely posts when the \"waves\" come out), they don't contain the lifetime restrictions.  Personally I've never received one (you input your skymiles #, name, and I think something else and it tells you if you're eligible or not).  Gee, amazing that they actually check/enforce (unlike apparently Citi). Theoretically (I shouldn't say this it's been proven it works) if you wait 7 years (maybe over 7) you can get another DL Amex card (that you don't currently have) and get another SUB since apparently \"lifetime\" in Amex-land means like 7 years.  Like:  8 years ago you had the Delta Amex Gold and cancelled it back then.  7.whatever years later you re-apply for Delta Amex Gold and can get the SUB. Now, is that wise, given the current state of affairs?  IMO, probably not.  I don't think DL would get you, but Amex might (and claw back the miles and shutdown your Amex accounts).  Although it would seem even in that case, DL probably keeps your account open (albeit minus some miles maybe).   84fiero likes this.", "Yes there's a way to do so.  You're only restricted by Amex 5 credit card rule. That's how Amex protects DL from excessive churning.", "Plus you have a number of cards earning Amex Membership Rewards and Chase Ultimate Rewards, that transfer to DL and UA, respectively (a little more planning with Chase as you need to have certain cards open to do transfers to partners, but not hard to do).  So plenty of earning opportunities for those two FFPs without even repeating any one card.  Though there are other transfer partners for both MR and UR that may be more worthwhile than DL/UA to consider, depending on your situation and goals.   hurnik likes this.", "Yes, totally forgot about MR.  Although personally I'd rather use MR on other programs.  Skypesos aren't a \"good\" return, IMO unless you want to fly domestic economy (I live at an airport where there's never any cheap Skymiles flights and their Flash deals are never out of my home aiport either.) UR on the other hand, is easily churnable (I wouldn't chance any self-referral CIP at this point either), although with UA dynamic pricing, probably better off with other programs, BUT you get more UR on a SUB than UA MP for the same spend, IMO.  Good points about the MR/UR options.  Always good to have flexibility, IMO.   84fiero likes this.", "Anyone who needs to close their platinum cards, I recently had a few to close;  I found that by calling later in the evening ca 10 pm EST, I have been getting the automated close account, no talking to a human.   brc01 likes this.", "Moderator action    Discussion continues here, for now: AA accounts restricted  (Nov/Dec 2019)", "64", "114", "154", "158", "159", "160", "161", "162", "163", "Click here for full rules!", "You scrolled past it. Re-read post 2424", "Left out the word 'might' in that statement. As in 'You will might lose all AA miles, future award trips and your AAdvantage account'. No one really knows what the 'heck' is going on with AA right now. So best to keep that emailer handy, but don't use it until this mess gets figured out.  sdsearch and Robl like this.", "I just signed up using the Nov mailers, I plan on holding off the MSR spend until 2 months from now when my holiday travel is done and hopefully the purge is over.  But I'm small potatoes, I only dipped into the gravy a few times over last year.", "You would be unwise to think that AA will not still go after you.  People without any mailers have been shutdown.  Drawing any attention to your account at this point seems unwise.   84fiero and Robl like this.", "I'd agree.  And we don't know how long AA will be going at this, either.", "What was the possible reason for their AA shutdown if they had never used a mailer?", "That was my question too. AA has been aware of churning for years, and even using your relative's mailer (especially at same address) is more of a dispute between Citi and myself. I would think AA only cares about the most egregious abusers, or those who sold miles / mailers, which is more of a serious violation.   Dream of Flying likes this.", "Nobody knows for sure.  The boilerplate shutdown email lists a whole bunch of possible reasons. \"abuse\" is probably the most likely (I think fraud/misrepresentation have legal definitions). It's possible to get like what, 6 or more SUBs for AA \"legitimately\" without a mailer, and more with a mailer (that was addressed to you without creating fake AA accounts).  Depending on velocity, perhaps the criteria AA is using is flawed (ie, if you got more than X SUBS in X time period and also redeemed awards for someone else). The truth is we don't *know* why, we can speculate why. The other situation (we've seen so far) is folks who NEVER used a mailer, NEVER used/created a fake account, only got \"legit\" SUBS and got shutdown is that they were a traveler on an award ticket that was used by someone else who was shutdown (ie: spouse, etc. in same household).  Again, speculation, but AA may be thinking that this person knew about the whole thing and thus is abusing the system as well.  We all know that spouses always 100% of the time tell each other 100% of everything that's going on. Whether or not AA \"wanted\" to do that (in both scenarios) again, we don't know.   84fiero and Dream of Flying like this.", "AA does not seem to feel that they need to provide an explanation to anyone.   Happy, 84fiero and Dream of Flying like this.", "You would be mistaken.  To date I have not heard of anyone getting shutdown who has bought or sold miles.  It is possible everyone is lying but that is the available data.  From what I gather, people who bought/sold miles in the past were given the opportunity to come clean and save their accounts and maybe some of their miles.  No one who had the audacity to open more than one Citi card has had that opportunity.   Happy, 84fiero and Dream of Flying like this.", "Part of the game I imagine. If they give you an actual reason, you can dispute that. It might even be that the reason they used is illegal. But if they tell you nothing, it's impossible to dispute it. Can you imagine a bank that had in it's T/Cs that if, in their opinion, you violated their T/C they could close your savings account and keep the money? Banks are regulated so they can't do that, but FF are not. AA's T/C simply say, we can close your account and void all your miles, for no reason at all. And you have no choice, because all FF programs are run that way. I'm not usually a 'big government person', but this is just crying out for some government rules to keep things fair.   GUWonder, Happy, Robl and 2 others like this.", "IMHO that's insane behaviour right now. I have never used any mailers, but I did get a Citi/AA card about a year ago (not violating any x/24 terms, etc.). If Doug Parker himself showed up with an engraved invitation for me to apply for an Citi AA card right now, it'd go straight into the trash. Even if I hadn't signed up for one a year ago, I'd say the same thing.", "Why though?  If you haven\u0092t churned any AA cards I\u0092d think you are safe.", "What would be such illegal reasons?  People affected by this could use some collective input. As long as one side does not provide their narrative, the other side has a free rein.", "Because AA miles are worth less ... way less .... and getting more invested in the AA mileage game may be more for patsies who fail to consider the opportunity cost from not avoiding (further?) investment in the AA mileage game via AA credit cards? I have not submitted an AA credit card for my AA account for at least quite some time and then some  , but any and all of the current AA card offers I receive are and will be trashed by me.", "63", "113", "153", "157", "158", "159", "160", "161", "162", "164", "Click here for full rules!", "for those bold enough to keep applying with these emailers, TODAY is the last day to use those expiring tomorrow, 12/11 (yeah, citi being citi)", "Did anyone get targeted emails with the transferable 50K SUB this month? Usually they seem to come early in the month, haven't seen anyone mentioning getting them in December. Indication the emailer grAAvy train has stopped?", "Wait until Friday.", "Did anyone else receive a new mailer? The terms are still the same, and the AAdvantage number is changeable. Citi/AA too incompetent to change even with all this noise in the past two weeks.", "new mailers just showed up in my account. expiration 1/8/2020, the only difference is the first digit changed from 8 to 9, as it seems they ran out of 8s", "got emailers on 3 accounts today - a bit concerned than before given the recent news of shutdowns. All of these 3 accounts are new - opened in last 2 months. None of the older ones (actual family members) recd offers (yet).", "Same here. Choo choo!   gumercindo likes this.", "No one ever lost money betting on Citi's IT incompetence.   rover4618 likes this.", "Moderator action    Most recent post have been moved to a new thread. If you have created extra AAdvantage accounts to elicit Mailers or eMailers without restrictive language,  you will want to read this thread because it is is not obvious when an AAdvantage account is restricted: AA accounts restricted  (Nov/Dec 2019)", "Sadly my 60 days is up on 1/11, so the 1/8 mailer is useless. Previous mailers stayed valid well after expiration.", "Reminder of the \"Life after AA Churn\" thread    This thread about non-Citi alternatives for those who were basically out of options with most other issuers due to the high volume of Citi apps never saw much action, but it may be worth reviving now. Life After AA Churn Robl likes this.", "Finally I received one emailer on 12/12 exactly after two months of registering new account on 10/12. I registered for two accounts but received emailer only in one account but I am happy! I have not applied any citi card in last 6+ months so I am safe to apply now, but want to confirm if I can use same link for two different applications on two different names. Do I have to use two different browsers technic or can I use it one by one?  Thanks.", "Have you not seen the news about the shutdowns? You will lose all AA miles, future award trips and your AAdvantage account will be permanently closed if you do this.", "You need to read the shutdown thread.", "Oh! I am not paying any attention lately, can you please provide me shutdown link. And thanks for the update.", "62", "112", "152", "156", "157", "158", "159", "160", "161", "163", "164", "Click here for full rules!", "Anyone activating a recently received emailer card and or applying for another before the Dec 11(actually10th) apply by date?", "I just received a mailer for an AA biz card with a 9 digit code and 48 month language.  Is this really enforced? Was anyone successful in receiving the bonus on this card?", "Data points suggest they do enforce the 48 month rule on these.", "Anyway to see when a past card was opened?  I have a CitiBiz card still open, but I can't remember when I opened it.", "I got one in early Nov.  Was approved with another emailer in early Oct, and just now hopped on the train again with instant approval.", "The shutdown rumors were about aadvantage accounts not Citi cards. Citi is a pita with in store purchases, won't even let them through if you pre-warned them.", "Citi keeps a running account of where they experience the most fraud. If you think they were paranoid about a purchase at Crate and Barrel, just try buying $1K in VGCs from CVS, You'll be on the phone with their fraud department for at least half an hour. And even then, when they tell you the purchase has been approved, and try to redo it right away, you have a 50% chance of having the purchase denied again.  hurnik likes this.", "I know - there's a reason I'm doing my citi MS exclusively at GC.com. 2K online with a brand new account in one txn - no problemo. \"you have a 50% chance of having the purchase denied again\" in my experience (although it's been a few years) - more like 100% If Citi ever moves like Amex to not counting online GC purchases towards the SUB MS, I'm out. Amex I can do several K at my Safeway 500 at a time without a glitch.", "First of all, doesn't it say 48 months since the last sign-up bonus, rather than 48 months since opened (like the public offers now do)? If so, then you need to wait closer to about 52 months since it was opened. (And in case you had to fight for your bonus for some reason, it might have taken even longer! ) Second, you can see when a past card was opened or when you got the signup bonus that far back if you have something you kept about it: statements, emails, etc. If you kept absolutely nothing, since you still have it open, you can try calling up Citi and asking them. (Citi is not likely to tell you over the phone about when closed cards were opened, but it is more likely to tell you over the phone when a still-open card was first opened.) AA itself only lets you see your activity (including signup bonuses) going back 2 years, so it doesn't help if your bonus was further back and you never kept captures of those activity reports before. If you think your bonus may have been less than 2 years ago, go to AA.com right now, and capture all your activity for the past two years, and if it's there. And, obviously, from on, keep track of all of this stuff yourself, since you never know what the rules may be in a few more years.   Happy and 84fiero like this.", "What's the latest DPs on offer matches?  I just got approved on a 50k emailed code, and  USPS daily digest says I have a 75k offer coming in the mail....of course addressed to one of my dogs   Anyone got a match from this recently?", "I got a written rejection in the mail stating that the offer I will receive can not be substituted.", "Matching is dead.", "That 75k offer is for a business card. And matching has been dead for many months.   jsl_313 likes this.", "Ok thanks.  I'll give it a go anyway we'll see  what the paper mailer looks like anyway. It could be a 48mo language type of deal.", "NVM, it turned out to be a crappy biz offer with 48-mo language.", "61", "111", "151", "155", "156", "157", "158", "159", "160", "162", "163", "164", "Click here for full rules!", "This happened to me, and I got the bonus.  You can call or chat to ask about the terms of the bonus associated with your account to confirm it is still there.  If not, then you would have to plead your case, but I think that won't be necessary.", "Not necessary. The bonus is attached to the application ID, which has nothing to do with the CC acct#. App ID dictates app velocity limit (8/35/65 rule) as well, not card open date nor card receipt date.", "You will get the bonus as long as you meet the spending deadline.  That will be based on the original approval date, but you can call or chat to find out exactly.", "Random AA Emailer received 11/21    I got sent a 50k/2.5k/3m, no 24/48 mo language, code from AA randomly on 11/21 - with the same 12/11 Exp. The subject was: \"**Reminder for [INSERT first name on AAdvantage acct here] - earn 50,000 bonus miles to jumpstart your AAdvantage membership\" This AAdvantage acct created approx 10/23. Other new AAdvantage acct, same date of creation, got no offer. I searched my email inbox, but did not see any INITIAL email with the subject, so perhaps the word REMINDER means nothing, or my email provider (GoDaddy) sucks?! and the fist email that SHOULD have been sent with the other reported E-mailers around 11/8 was lost?", "I received the same \"Reminder\" on Nov 21, but it was preceded by an offer on Nov 6 with the same terms and expiration date.", "I last applied on 8/2/2019, 10/7/2019 both were declined. Then tried again on 11/20/2019 and also got declined but this time the reason is because I have multiple applications within last 60 days. These were for personal citi aa cards. I got approved for the citibusiness aa on 11/4. I thought the rules for personal and business are different. I'm puzzled why I was declined on my latest personal application. Thoughts?", "Um, no. The different rule about biz cards is no more than 1 biz card app in 90 days, but ALL cards (pers and biz) fall under the 2/65 rule. You obviously violated that by applying on 10/7, 11/4, and 11/20. (read number 4 in the wiki.)", "Ahh ok, that makes sense now. So would it be safe to wait till 1/15/2020 to apply for the personal citi? This would be a little over 65 days since the 11/4 application.  Or is it i need to wait 65 days since my last application which is on 11/20?", "It's 65 days since your last 2, (or more), apps. To make it easy, there is a \"days from\" calculator here: https://www.convertunits.com/dates/daysfromdate/ The August app is clearly past the limit, so we can ignore that one. The 10/7 is up Dec 11. But you kept applying, so no apps in Dec. 11/4 is up Jan 8th. But you're not clear then, because there is still the 11/20 app, which is over on Jan 24th. So you can apply around Jan 10 or so, since we know Citi is so bad at math, and then again around Jan 26. Frankly I find juggling a series of dates to be quite confusing, so I just apply once every 35 days, which is much easier to compute. Update: But now it dawns on me that method is outdated, as long as Citi keeps the emailers on a very short expiration period. I haven't worked with the new system long enough to quite know how that's going to work out. The Jan 10 app puts your next app in the middle of March, most likely past the exp date on the February emailer, so you'll have to wait until the March emailer. Maybe someone who is more of a math wizard can tell us if it will be more efficient under the new system to use 35 days or 65 days. Applying every 35 days came out to 11 apps a year. But with the new shorter exp periods I'm afraid it'll be far fewer than that. Still a game worth playing though.", "Assuming you can get emailers, there are only a couple of days a month that there are no unexpired ones.  They expire Expiration Date-1 and new ones come out Expiration Date +2-3", "anyone try using plastiq to satisfy the minimum spend for AAdvantage card?  Just want to make sure it doesn't code as a cash advance.", "Many times.  No cash advance.", "Yes, it works -- mortgage payments (plus the fee) code as a purchase, not cash advance.  I always lower my cash advance line to the minimum anyway .....", "Citi placing speed limits on AA mailer card apps?    Hello, a family member was recently given an ambiguous denial letter in the mail after an AA \"mailer\" app. in September. That app was more than 35 days after the prior app. The letter read we could not approve you because: \"the credit privileges on your existing account(s) are currently restricted\" Two calls into recon got nowhere; they could not detail any more than the letter, but could not approve. A final call into recon (this week) revealed a managers report that \"we see you have opened and closed 10 AA accounts in a short period of time, and we can not approve you for another AA Citi card. This does not affect any current Citi AA card account.\" For more than a year, this family member has never got auto-approved, even if more than 60 days between apps, and always get the letter denial letter \"the credit privileges on your existing account(s) are currently restricted.\" We were told once before by a manager this occurred due to a prior reported lost/stolen CC with Citi. Any insights?", "After one hell of a run my physical mailers have dried up. None of my accounts has ever received an email offer. Is there something I may be missing to spur email offers? Thanks for any insights.", "60", "110", "150", "154", "155", "156", "157", "158", "159", "161", "162", "163", "164"], "Citicard reneged on  AA miles..HELP!": ["Click here for full rules!", "A frontline customer service agent does not have the authority to make this decision at any bank. Why do you think that what this person said changes what you have in writing? What is the context of the discussion?   84fiero likes this.", "I probably had the same card, but it must be Citi obligation  to then not approve the new card in writing  CONFIRMING the miles bonus. I have the card approval letter stating the miles bonus.", "Your posts are not responsive.  Do you want help or do you just want to complain? Someone working at a bank told you something contrary to what the bank promised in a letter. The person is probably wrong, but to help you decide if this is an exception we would need details beyond what you have provided.   Happy, hurnik, 84fiero and 1 others like this.", "Mile bonus Quote: I would appreciate help suggestions and repeat: Applied for card, got written approval letter from Citi mentioning clearly bonus miles...when called for the miles they reneged because of prior card. What to do next?", "You made the required spend in the stipulated period, the bonus did not post, and you called once?  Did you speak only to one person, or were you switched from frontline agent to someone senior?", "Fulfilled requirements, talked to agent and supervisor and they repeatedly answered that I am not entitled to the miles ....but which are clearly stated in their official card approval letter to me. I am left in the cold and consider small claims court.", "You could file a complaint with the CFPB: https://www.consumerfinance.gov/complaint/ 84fiero likes this.", "As mia said a CFPB complaint is a good avenue - whether you'd be wasting your time or not depends. We're trying to help but can't offer meaningful advice without answers to specific questions you're not answering. 1. Did you apply for this card through (a) a public offer (found on Citi or AA website or a blog, for example) or (b) a mail or email offer you received from Citi or AA? 2. If the answer to 1. above is (b), do you still have the email/mail offer? If so, look carefully for any language stating something to the effect that American Airlines miles are not available if you received a new account bonus for [whatever flavor of card this is] in the past 48 months. 3. If your answer to 1. is (a) or your answer to 2. is \"yes there is such 48 month language\" then the next question is for you to confirm whether you did have this same AA card previously and if so, when the bonus posted. If you still have that card open, you should be able to go back through statement history to check.  4. If your answer to 1. is (b) and you're certain there is no such restrictive language in the targeted offer you received, then it shouldn't matter when or if you had a prior bonus.", "The lack of clear answers to simple questions on repeated occasions over a period of days suggests that there is more to this than is being revealed. A clear and concise summary, not snippets of partial sentences, which explains exactly and without omission what occurred is the only way OP gets anything useful. Otherwise it is GIGO (Garbage In, Garbage Out).", "1", "Click here for full rules!", "Citicard reneged on  AA miles..HELP!    Got an approval letter from Citibank cinfirming 40000 mile offer. Now Citi reneged by phone saying I had a similar card before. BUT I have their approval in writing! what to do?", "Go to the citi forum and ask there.", "Read T&amp;C which usually states not applicable if previously received the bonus- sometimes it has a time frame i.e. last 24 months. However, your options are probably nil- just cancel the card. This should be in the Citi credit card section per JJeffrey. Ask the MODS to move.   FAA1996 likes this.", "You have approval for the miles in writing or  just approval for the card? When did you last get miles for a Citi card? What do the terms say for this card, regarding previously getting  miles?", "This would be interesting if the offer didn’t have the 48 Month language on it and now Citi is also cracking down on AA bonuses but it seems unlikely.  The 40k miles offer is likely the one on their website which 100% has the language.  If it really didn’t have the language then you could file a complaint against Citi and they’d almost certainly give the bonus miles. However, AA might just terminate your account and at that point it doesn’t matter if you bonus was for 10M miles.", "This may well be part of the AA crackdown. It struck me that the sudden and mysterious approach smacked of one of Citi's bank regulators having raised the issue of dangling too many bonuses in front of people who had no economic need for another card. If that is the case, it would make all the sense in the world for Citi to crack down on its underwriting. As noted above, it would do little good, in any event, to have Citi issue the card with the bonus, only to have AA credit the bonus and then close and zero out the account. OP has not supplied any details, so not much to be said.  Did he have another card and when?", "We need more details: - When did you previously hold (or still hold) the card and was/is it the exact same card product?  Citi's current time limitation is 48 months from when you last received a sign-up bonus for the exact card product.  (Previously it was 24 months based on the card \"family\").  So having held a \"similar\" card isn't the same, nor applicable to the current T&amp;Cs. - The above assumes that the offer under which you applied had the 48-month language, which all public links AFAIK have.  If you had a targeted offer without the restriction, then it obviously wouldn't apply.  Did you use a targeted offer (mailer for example) or a general public link?  Do you still have the link or offer to read its terms? - What prompted the telephone conversation?  Citi frontline CSRs are notoriously uninformed and unreliable, so if this was a comment made during card activation for example, I wouldn't take it as gospel on its own.", "Relax on the AA-conspiracy theory folks.  OP creates account today and their first post, with no further info or replies so far.  OP, ignore the Citi rep (they are unreliable), make the spend, miles will probably post.   84fiero, 355F1, akr1970akr and 1 others like this.", "In what context, why were you discussing the bonus?", "If I recall, Citi's 24 mo for TY and 48 for AA is from the point when a card is open/closed, not when the bonus was earned.  Standard practice had been to keep cards open for more frequent apps, while reducing their respective CLs to increase odds of auto-approval--this was assuming one's Fico score could withstand such tinkering.  At least in my experience, Citi had no qualms with anyone having a gazillion of the same card.", "This has changed. Quote: ...and there were some transitional variants during 2019.   hurnik likes this.", "Still...    I got an approval letter clearly stating the mile bonus...why would Citi approve in writing if they do not want to grant the miles?", "AA cracking down on churners...", "Why do you believe what one front line CSR told you over the phone, rather than what the company put in writing?", "As said: when I asked by phone about the 40000 miles which were in the official APPROVAL letter, they reneged. I am not referring to the offer but to the written APPROVAL.", "2"], "Citi Prestige USA refresh: 5X Air,Dine; 3X Hotel,Cruise; Hotel 4NF capped 2X/yr; $495": ["Click here for full rules!", "A booking I made in Sep stacked properly.  Note that there is also a code out there for an additional $75 off if purchase is &gt; a certain sum.", "Any DP's for getting the global entry credit for a second time?  Citi's rule is once every 5yrs, but wondering how well that is enforced (Citi's IT afterall). Reckon its been 4yrs since I last used this credit Travel Credit + renewed global entry + some sort of retention would probably keep the card alive for another year for me.", "my 495 annual fee just hit and i'm out! when i called to cancel (to ask for retention too) they said i had 37 days to cancel to get the fee credited back? does that sound right? If so, how shady is it to cancel the first week of January so I can use the $250 travel credit - i can easily book a flight on jan 1st! what do you guys think?", "Just wondering how strict Citi is with Prestige applications? I just got the Premier and I'm already putting all of my travel spending on the card. Probably $6-7k since I got it. I'm thinking of applying for the Prestige. Not sure if Citi is as strict as Chase when assessing CSR applications.", "The soonest you would be eligible for a Prestige bonus is 24 months after you received the Premier bonus.  Quote: .", "What if I don't care about the Prestige bonus? I don't think it's worth waiting 2 years to apply for the Prestige just to get the WB.", "No need to wait till Jan 1st, you can start spending after your Dec statement closes, but you'll get reimbursed when your Jan statement closes. Not sure if it'll get posted if you close the card, but you can try.", "I have Citigold. My card renewed yesterday and the AMF became $495. I called Citigold and they told me a $145 credit should automatically appear on my card in the next 1 to 3 months.   akr1970akr likes this.", "I've got $350 right away, with no credits.", "For those of you cancelling -- where are you parking your TYPs? Or do you guys hold a separate Premier card or similar?", "I've had the Prestige since around 2013 (when it came with Admirals Club access). I've stuck with it, and it's been a good card for my partner and me with the 4th night free, but I'm wondering if there isn't any reason I shouldn't just burn my 130k TYPs on a statement credit, since it's 1:1 and I don't have any current travel plans that I could do a points transfer for. AF will be due in January. We have no problem getting the travel credit, and we could probably still use the 4th night free even with the new restrictions, but it seems silly to have too many $450+ AF cards, and the insurance changes to the Prestige really hurt (travel insurance is one thing, but we also rent cars a lot but don't have car insurance because we live in a city and don't own a personal car). Am I missing something if I cancel and switch to CSR or Amex Platinum (if we even want to keep a high-fee card?). Thanks!", "I don't think you are missing anything if you drop Prestige for CSR, but from my perspective if you can use the 4th night free benefit, this card becomes pretty close to net-0 cost.  Why not keep it and also get CSR for rental car coverage?  High AF cards are not really high fee if the net cost is close to zero.  I have Prestige, Amex Plat and soon CSR.  Amex plat is the only one I'd consider dropping because using the benefits are so difficult.  I even have the Amex Gold and I'd sooner drop that than Prestige because the Gold restaurant benefit is a PITA. But hey, the more people drop Prestige the easier it will be for me to get a retention bonus, so go for it :-)", "i transfered everything to lifemiles because they had the 25% bonus... haha i may have way too many lifemiles now, but i'm a star alliance flyer and wasnt sure where else to park it - so the bonus was nice!", "Spend them.", "20", "24", "25", "26", "27", "28", "29"]}